{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_0", "document_index": 246, "latency_s": 0.8838102000008803, "prompt_toks": 3613, "completion_toks": 52}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Amphetamine\npsychonaut_name: Amphetamine\npsychonaut_url: https://psychonautwiki.org/wiki/Amphetamine\n\n\n                    Context: \n                    This snippet provides the basic identification and referencing details for the substance Amphetamine, including its name, alternative names, and a URL to its detailed page on PsychonautWiki, serving as an introductory reference within the comprehensive article on its chemistry, effects, and use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_1", "document_index": 246, "latency_s": 0.7934985999891069, "prompt_toks": 3895, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Amphetamine | Chemical Nomenclature | Common names | Amphetamine, Speed, Adderall, Pep | Substitutive name | α-Methylphenethylamine | Systematic name | (RS)-1-Phenylpropan-2-amine | Class Membership | Psychoactive class | Stimulant | Chemical class | Phenethylamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 75%+ | [1] | Threshold | 2.5 mg | Light | 5 - 10 mg | Common | 10 - 25 mg | Strong | 25 - 50 mg | Heavy | 50 mg + | Duration | Total | 6 - 8 hours | Onset | 30 - 45 minutes | Come up | 30 - 135 minutes | Peak | 2.5 - 4 hours | Offset | 2 - 3 hours | After effects | 3 - 6 hours | ⇣ | Insufflated | Dosage | Threshold | 4 mg | Light | 6 - 15 mg | Common | 15 - 30 mg | Strong | 30 - 50 mg | Heavy | 50 mg + | Duration | Total | 3 - 6 hours | Onset | 1 - 5 minutes | Come up | 30 -\n\n\n                    Context: \n                    This chunk is an infobox summarizing key chemical, pharmacological, and dosage information about amphetamine, including its common names, chemical nomenclature, routes of administration, bioavailability, dosing thresholds, onset, peak, duration, and effects at various administration methods. It provides essential reference data relevant to the detailed discussions within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_2", "document_index": 246, "latency_s": 0.7770409000077052, "prompt_toks": 3914, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    ⇣ | Insufflated | Dosage | Threshold | 4 mg | Light | 6 - 15 mg | Common | 15 - 30 mg | Strong | 30 - 50 mg | Heavy | 50 mg + | Duration | Total | 3 - 6 hours | Onset | 1 - 5 minutes | Come up | 30 - 90 minutes | Peak | 1 - 2 hours | Offset | 1.5 - 3 hours | After effects | 2 - 4 hours | ⇣ | Intravenous | Dosage | Threshold | 4 mg | Light | 6 - 15 mg | Common | 15 - 30 mg | Strong | 30 - 50 mg | Heavy | 50 mg + | Duration | Total | 3 - 6 hours | Onset | 2 - 10 seconds | Come up | 2 - 10 seconds | Peak | 2 - 4 hours | Offset | 1 - 2 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Alcohol | GHB | GBL | Opioids | Cocaine | Cannabis | Caffeine | Ketamine | Methoxetamine | Psychedelics | DXM | PCP | 25x-NBOMe | 2C-T-x | 5-MeO-xxT | DOx | Tramadol | aMT | MAOIs\n\n\n                    Context: \n                    This chunk provides detailed dosage, onset, duration, and interaction information for insufflated and intravenous administration of amphetamine, including threshold, light, common, strong, and heavy doses, along with timing of effects. It is a vital reference for understanding administration specifics and potential interactions within the comprehensive overview of amphetamine's effects, pharmacology, and usage guidelines in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_3", "document_index": 246, "latency_s": 1.3347309000091627, "prompt_toks": 3628, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk provides an outline of the main sections covered in the webpage about Amphetamine, including its chemistry, pharmacology, effects, toxicity, legal status, and references. It serves as a navigational summary for understanding the detailed information within the full document, aiding research and reference purposes on amphetamine-related topics.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_4", "document_index": 246, "latency_s": 0.7735683000064455, "prompt_toks": 3776, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Stimulation - Amphetamine is reported to be very energetic and stimulating. It can encourage physical activities such as dancing, socializing, running, or cleaning. The particular style of stimulation that amphetamine produces can be described as forced. This means that at higher dosages, it becomes difficult or impossible to keep still. Jaw clenching, involuntary bodily shakes, and vibrations become present, resulting in extreme shaking of the entire body, unsteadiness of the hands, and a general loss of fine motor control. This is replaced with mild fatigue and general exhaustion during the offset of the experience. Spontaneous bodily sensations - The \"body high\" of amphetamine can be described as a moderate euphoric tingling sensation that encompasses the entire body. This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Physical euphoria Abnormal heartbeat [28] Increased heart rate\n\n\n                    Context: \n                    This excerpt details the physical effects of amphetamine, including its energizing stimulation, involuntary movements like jaw clenching and tremors, and sensations of euphoria. It also highlights cardiovascular impacts such as increased heart rate and abnormal heartbeat. These effects are crucial for understanding the drug's physiological impact and potential risks, forming part of the comprehensive description found in the full webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_5", "document_index": 246, "latency_s": 0.8527239999966696, "prompt_toks": 3803, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Physical euphoria Abnormal heartbeat [28] Increased heart rate [28] Increased blood pressure - By about 30mmHg systolic and 20mmHg diastolic, from naive users taking 40mg d-AMP. [28] [29] Appetite suppression [30] Bronchodilation [31] Dehydration [ citation needed ] Dry mouth [32] Frequent urination Difficulty urinating Increased bodily temperature [33] Increased perspiration Mania - Amphetamine can produce mania in genetically predisposed individuals, such as those on the spectrum of bipolar disorder or schizophrenia . Higher doses and sleep deprivation appears to increase the risk. Nausea - This can be mitigated by eating before dosing and throughout the experience. Pupil dilation - This effect is experienced only at common to high dosages as well as in low lighting and is more prominent on the comedown. Reflex syncope [ citation needed ] - This may be\n\n\n                    Context: \n                    This excerpt details the physical effects and bodily sensations associated with amphetamine use, including increased heart rate, blood pressure, euphoria, and side effects such as nausea, pupil dilation, and mania. It provides specific data on dosage-related effects and physiological responses, making it relevant for understanding amphetamine's impact on the body as discussed in the comprehensive webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_6", "document_index": 246, "latency_s": 1.1266382000030717, "prompt_toks": 3732, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Pupil dilation - This effect is experienced only at common to high dosages as well as in low lighting and is more prominent on the comedown. Reflex syncope [ citation needed ] - This may be experienced due to an Effect:Abnormal heartbeat causing a sudden loss in blood pressure. Stamina enhancement Teeth grinding - Teeth grinding may be present at higher doses. However, it is less intense than that of MDMA . Temporary erectile dysfunction Vasoconstriction [34] - Amphetamine use causes blood vessels to constrict resulting in not enough blood reaching some parts of the body. This can cause feelings of tingling or pain, a cold feeling, numbness, paleness, or skin color changes especially in the fingers and toes.\n\n\n                    Context: \n                    This excerpt details the physical effects of amphetamine, including visual effects like pupil dilation at higher doses, cardiovascular impacts such as reflex syncope and vasoconstriction, and motor effects like teeth grinding and potential erectile dysfunction. It emphasizes dose-dependent and physiological responses, highlighting risks related to blood vessel constriction and cardiovascular strain, making it essential for understanding amphetamine's physical impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_7", "document_index": 246, "latency_s": 1.0127230000070995, "prompt_toks": 3780, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stimulation - Amphetamine is reported to be very energetic and stimulating. It can encourage physical activities such as dancing, socializing, running, or cleaning. The particular style of stimulation that amphetamine produces can be described as forced. This means that at higher dosages, it becomes difficult or impossible to keep still. Jaw clenching, involuntary bodily shakes, and vibrations become present, resulting in extreme shaking of the entire body, unsteadiness of the hands, and a general loss of fine motor control. This is replaced with mild fatigue and general exhaustion during the offset of the experience.\n- Spontaneous bodily sensations - The \"body high\" of amphetamine can be described as a moderate euphoric tingling sensation that encompasses the entire body. This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached.\n- Physical euphoria\n- Abnormal heartbeat [28]\n- Increased heart rate [28]\n\n\n                    Context: \n                    This excerpt covers the physical effects of amphetamine, including its stimulating properties, bodily sensations, and cardiovascular impacts. It details how the drug enhances energy, movement, and euphoria while also causing physical symptoms like jaw clenching, shakes, increased heart rate, and abnormal heartbeat, making it a key section on amphetamine's physical and physiological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_8", "document_index": 246, "latency_s": 0.8006560999929206, "prompt_toks": 3816, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria\n- Abnormal heartbeat [28]\n- Increased heart rate [28]\n- Increased blood pressure - By about 30mmHg systolic and 20mmHg diastolic, from naive users taking 40mg d-AMP. [28] [29]\n- Appetite suppression [30]\n- Bronchodilation [31]\n- Dehydration [ citation needed ]\n- Dry mouth [32]\n- Frequent urination\n- Difficulty urinating\n- Increased bodily temperature [33]\n- Increased perspiration\n- Mania - Amphetamine can produce mania in genetically predisposed individuals, such as those on the spectrum of bipolar disorder or schizophrenia . Higher doses and sleep deprivation appears to increase the risk.\n- Nausea - This can be mitigated by eating before dosing and throughout the experience.\n- Pupil dilation - This effect is experienced only at common to high dosages as well as in low lighting and is more prominent on the comedown.\n- Reflex syncope [ citation needed ] - This may be experienced due to an Effect:Abnormal heartbeat causing a sudden loss in blood pressure.\n\n\n                    Context: \n                    This section details the physical effects and physiological responses associated with amphetamine use, including increased heart rate, blood pressure, thermoregulation issues, and other cardiovascular and metabolic effects. It highlights common bodily sensations and risks such as euphoria, mania, nausea, pupil dilation, and potential cardiovascular complications, making it essential for understanding amphetamine's impact on physical health within the comprehensive drug profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_9", "document_index": 246, "latency_s": 0.9288846999988891, "prompt_toks": 3709, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Reflex syncope [ citation needed ] - This may be experienced due to an Effect:Abnormal heartbeat causing a sudden loss in blood pressure.\n- Stamina enhancement\n- Teeth grinding - Teeth grinding may be present at higher doses. However, it is less intense than that of MDMA .\n- Temporary erectile dysfunction\n- Vasoconstriction [34] - Amphetamine use causes blood vessels to constrict resulting in not enough blood reaching some parts of the body. This can cause feelings of tingling or pain, a cold feeling, numbness, paleness, or skin color changes especially in the fingers and toes.\n\n\n                    Context: \n                    This chunk covers specific physical effects and risks associated with amphetamine use, including reflex syncope, stamina effects, teeth grinding, temporary erectile dysfunction, and vasoconstriction-related symptoms like coldness and numbness in extremities. These details are relevant to understanding the adverse health consequences outlined within the broader discussion of amphetamine's physiological effects and toxicity.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_10", "document_index": 246, "latency_s": 0.7951952000003075, "prompt_toks": 3780, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - The cognitive effects of amphetamine are oftentimes subjectively perceived as being more clearheaded and “functional” compared to other strong stimulants such as cocaine . In low to moderate doses the amphetamine headspace can, in many ways “mimic sobriety”; thus leading users or even onlookers to mistake the effects for more natural or mundane states of stimulation and focus. Individuals diagnosed with ADHD/ADD ( dopamine and norepinephrine deficiencies in certain brain regions) may however react starkly differently to amphetamine in low or moderate dosages. Analysis enhancement - This effect is considered to be more consistent and prevalent when compared to other common stimulants . Cognitive euphoria Compulsive redosing - This behavioral effect is generally less pronounced than it is with cocaine or when amphetamine is insufflated as opposed to taken orally. Ego inflation Emotion suppression - This effect is typically most intense at light and common doses or\n\n\n                    Context: \n                    This section details the cognitive effects of amphetamine, highlighting its perceived clarity, focus enhancement, and differences in response among individuals with ADHD. It covers behaviors such as analysis improvement, compulsive redosing tendencies, ego inflation, and emotion suppression, situating these effects within the broader discussion of amphetamine's subjective and physiological impacts.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_11", "document_index": 246, "latency_s": 0.8768313999898965, "prompt_toks": 3775, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    than it is with cocaine or when amphetamine is insufflated as opposed to taken orally. Ego inflation Emotion suppression - This effect is typically most intense at light and common doses or with frequent usage, and is more commonly reported from medical usage rather than recreational. Focus enhancement - This effect is most effective at low to moderate doses, as anything higher will usually impair concentration or cause the user to be too physically active or restless to focus. Increased libido - While amphetamine use can cause feelings of enhanced sexual desire, the constricting of blood vessels may make it difficult to achieve or maintain an erection. Increased music appreciation Irritability - This is more likely to occur at higher doses and/or during the comedown. Memory enhancement Motivation enhancement - Anecdotally, this component can be seemingly more prevalent when the levoamphetamine enantiomer is present in this substance, such as with racemic amphetamine or mixtures of\n\n\n                    Context: \n                    This chunk describes various cognitive and subjective effects of amphetamine, including ego inflation, emotion suppression, focus and motivation enhancement, increased libido, music appreciation, irritability, and memory improvements. It highlights dose-dependent variations and the influence of different enantiomers, emphasizing effects relevant to understanding amphetamine's psychological profile and user experience within the comprehensive psychoactive profile detailed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_12", "document_index": 246, "latency_s": 3.934896499995375, "prompt_toks": 3775, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Motivation enhancement - Anecdotally, this component can be seemingly more prevalent when the levoamphetamine enantiomer is present in this substance, such as with racemic amphetamine or mixtures of amphetamine salts such as Adderall. Psychosis - This effect only occurs in either predisposed individuals, or after chronic, high frequency use, or due to sleep deprivation. Repeated administration of threshold/very low dosages (such as 2.5mg) however may also be associated with this effect possibly due to the “dopamine hypersensitivity” hypothesis. However this topic is somewhat controversial and speculative. Suggestibility suppression Thought acceleration Thought organization Time distortion - This can be described as the experience of time speeding up and passing much quicker than it usually would when sober due to increased levels of dopamine . Wakefulness - This component is generally considered to be less intense when compared to methamphetamine but more intense than with cocaine.\n\n\n                    Context: \n                    This excerpt covers key cognitive and psychological effects of amphetamine, including motivation enhancement, susceptibility to psychosis, suggestibility suppression, thought acceleration, organization, time distortion, and wakefulness. It highlights factors influencing these effects such as enantiomer composition and usage patterns, and compares the wakefulness effect to other stimulants like methamphetamine and cocaine. This information is crucial for understanding amphetamine's impact on mental state within the broader pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_13", "document_index": 246, "latency_s": 0.837236599996686, "prompt_toks": 3759, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis enhancement - This effect is considered to be more consistent and prevalent when compared to other common stimulants .\n- Cognitive euphoria\n- Compulsive redosing - This behavioral effect is generally less pronounced than it is with cocaine or when amphetamine is insufflated as opposed to taken orally.\n- Ego inflation\n- Emotion suppression - This effect is typically most intense at light and common doses or with frequent usage, and is more commonly reported from medical usage rather than recreational.\n- Focus enhancement - This effect is most effective at low to moderate doses, as anything higher will usually impair concentration or cause the user to be too physically active or restless to focus.\n- Increased libido - While amphetamine use can cause feelings of enhanced sexual desire, the constricting of blood vessels may make it difficult to achieve or maintain an erection.\n- Increased music appreciation\n\n\n                    Context: \n                    This excerpt summarizes key cognitive and behavioral effects of amphetamine, including analysis enhancement, euphoria, redosing tendencies, ego inflation, emotion suppression, focus enhancement, increased libido, and music appreciation. It highlights dose-dependent effects and distinctions between recreational and medical use. This section is relevant to understanding the subjective and cognitive impacts detailed within the full document on amphetamine's physical, mental, and behavioral effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_14", "document_index": 246, "latency_s": 0.9160929999925429, "prompt_toks": 3758, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased music appreciation\n- Irritability - This is more likely to occur at higher doses and/or during the comedown.\n- Memory enhancement\n- Motivation enhancement - Anecdotally, this component can be seemingly more prevalent when the levoamphetamine enantiomer is present in this substance, such as with racemic amphetamine or mixtures of amphetamine salts such as Adderall.\n- Psychosis - This effect only occurs in either predisposed individuals, or after chronic, high frequency use, or due to sleep deprivation. Repeated administration of threshold/very low dosages (such as 2.5mg) however may also be associated with this effect possibly due to the “dopamine hypersensitivity” hypothesis. However this topic is somewhat controversial and speculative.\n- Suggestibility suppression\n- Thought acceleration\n- Thought organization\n\n\n                    Context: \n                    This section summarizes key cognitive and perceptual effects of amphetamine, including enhancements in music appreciation, memory, motivation, and mental acceleration, as well as potential adverse effects like irritability and psychosis, especially at higher doses or during withdrawal; it provides detailed insights into amphetamine's subjective and psychological impact within the broader discussion of its physical and mental effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_15", "document_index": 246, "latency_s": 0.9165992999915034, "prompt_toks": 3665, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Suggestibility suppression\n- Thought acceleration\n- Thought organization\n- Time distortion - This can be described as the experience of time speeding up and passing much quicker than it usually would when sober due to increased levels of dopamine .\n- Wakefulness - This component is generally considered to be less intense when compared to methamphetamine but more intense than with cocaine.\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This excerpt covers the cognitive and psychological effects of amphetamine, including mental enhancements like thought acceleration, organization, and time distortion, as well as alertness and wakefulness. It is part of the broader discussion on amphetamine's physical, mental, and cultural effects, providing detailed insights into its subjective and behavioral impacts for user awareness and harm reduction.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_16", "document_index": 246, "latency_s": 0.8108409999986179, "prompt_toks": 3793, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - The visual effects of amphetamine are inconsistent and occur only mildly noticeable at higher doses. They are somewhat comparable to deliriant visuals and occur more readily in darker areas. Distortions Drifting - This effect is usually subtle and barely noticeable and only occurs at higher dosages or when combined with cannabis . Commonly this consists of level 1-2 drifting. Brightness alteration - Amphetamine can make spaces seem brighter as a result of its pupil dilating effects. Tracers - This effect is imperceptible with low dosages. It's most pronounced with bigger dosages and especially when someone becomes sleep deprived, what on the other hand can be easily provoked by other effects of this substantion. It can get up to around 2.5-3 points on the psychonaut wiki scale. (click Traces above to read more) Hallucinatory states Transformations - This effect occurs very rarely, and typically only when the user has taken high doses, is coming down, or has been\n\n\n                    Context: \n                    This section details the visual effects of amphetamine, including mild and inconsistent visual disturbances such as drifting, brightness changes, tracers, and rare hallucinations, primarily at higher doses or under sleep deprivation. It provides specific descriptions of these effects, their conditions, and their intensity levels, making it a key part of the comprehensive overview of amphetamine's subjective and perceptual impact within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_17", "document_index": 246, "latency_s": 1.1588431999989552, "prompt_toks": 3740, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    wiki scale. (click Traces above to read more) Hallucinatory states Transformations - This effect occurs very rarely, and typically only when the user has taken high doses, is coming down, or has been awake for unusually long periods. They are usually very mild when they do occur. Geometry - This effect is reported by some users of amphetamine and related substances, typically at heavier doses when one is attempting to sleep. It can be described in its variations as simplistic, algorithmic, synthetic, dimly lit, multicolored, glossy, sharp edges, zoomed out, smooth, angular, immersive, and progressive. It typically occurs at level 3 however may progress to 4 and 5 when combined with substances like cannabis or DXM\n\n\n                    Context: \n                    This excerpt discusses the visual and hallucinatory effects of amphetamine, specifically highlighting rare phenomena such as visual transformations and geometry, which occur at high doses or during sleep deprivation. It provides detailed descriptions of these effects, their typical levels, and conditions that may provoke them, offering valuable information on the substance's perceptual impact within the broader context of amphetamine's effects outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_18", "document_index": 246, "latency_s": 0.6440472999966005, "prompt_toks": 3737, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Drifting - This effect is usually subtle and barely noticeable and only occurs at higher dosages or when combined with cannabis . Commonly this consists of level 1-2 drifting.\n- Brightness alteration - Amphetamine can make spaces seem brighter as a result of its pupil dilating effects.\n- Tracers - This effect is imperceptible with low dosages. It's most pronounced with bigger dosages and especially when someone becomes sleep deprived, what on the other hand can be easily provoked by other effects of this substantion.\n- Transformations - This effect occurs very rarely, and typically only when the user has taken high doses, is coming down, or has been awake for unusually long periods. They are usually very mild when they do occur.\n\n\n                    Context: \n                    This excerpt details the visual and perceptual effects of amphetamine, including subtle phenomena such as drifting, brightness alteration, tracers, and rare transformation experiences that occur primarily at higher doses or under specific conditions. These effects complement the broader discussion of amphetamine's physical and visual hallucinations, emphasizing their occurrence in relation to dosage and context.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_19", "document_index": 246, "latency_s": 1.2837631000002148, "prompt_toks": 3702, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Geometry - This effect is reported by some users of amphetamine and related substances, typically at heavier doses when one is attempting to sleep. It can be described in its variations as simplistic, algorithmic, synthetic, dimly lit, multicolored, glossy, sharp edges, zoomed out, smooth, angular, immersive, and progressive. It typically occurs at level 3 however may progress to 4 and 5 when combined with substances like cannabis or DXM\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects:\n\n\n                    Context: \n                    This excerpt describes the visual and perceptual effects of amphetamine, specifically focusing on geometric visual distortions that occur at higher doses during sleep deprivation or when combined with substances like cannabis or DXM, highlighting the severity levels and typical descriptions of these effects. The section is relevant for understanding the substance's visual hallucinations and sensory distortions, which are part of its broader psychodynamic profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_20", "document_index": 246, "latency_s": 0.680066100001568, "prompt_toks": 3772, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    After effects: - The effects which occur during the offset of a stimulant experience generally feel negative and uncomfortable in comparison to the effects which occurred during its peak . This is often referred to as a \"comedown\" or “crash” and occurs because of neurotransmitter (specifically catecholamine) depletion. Its effects commonly include: Anxiety - Anxiety can reach severe levels during the comedown in some users. Appetite suppression Cognitive fatigue Depression Increased heart rate - While blood concentration of amphetamine and most subjective effects are highest about 3 hours after administration, heart rate peaks much later at 10 hours after administration. [29] Irritability Restless legs Sleep paralysis - Some users note sleep paralysis after consuming amphetamine. Dream suppression Thought deceleration Wakefulness - The insomnia following a repeated series of amphetamine doses can last for longer than a day in some users. Motivation suppression - Experiences can range\n\n\n                    Context: \n                    This excerpt discusses the after effects of amphetamine use, including common \"comedown\" symptoms such as anxiety, depression, sleep paralysis, and motivation suppression. It details the negative and uncomfortable feelings experienced during the stimulant offset, emphasizing neurotransmitter depletion and sleep disturbances. This section provides crucial information on the rebound and recovery phase following amphetamine stimulation.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_21", "document_index": 246, "latency_s": 0.9133394000091357, "prompt_toks": 3645, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Thought deceleration Wakefulness - The insomnia following a repeated series of amphetamine doses can last for longer than a day in some users. Motivation suppression - Experiences can range from mild demotivation to extreme states of disinterest. This effect is more prominent at common and heavy doses.\n\n\n                    Context: \n                    This excerpt discusses the after effects of amphetamine use, specifically focusing on cognitive and physical impacts during the stimulant's offset phase. It highlights issues like thought deceleration, prolonged wakefulness, and motivation suppression, emphasizing their occurrence after repeated doses and at higher intensities. This information is relevant for understanding the substance's withdrawal symptoms and potential harm.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 17, "doc_id": "doc_246", "num_chunks": 23, "chunk_id": "246::chunk_22", "document_index": 246, "latency_s": 0.7357945999974618, "prompt_toks": 3772, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety - Anxiety can reach severe levels during the comedown in some users.\n- Appetite suppression\n- Cognitive fatigue\n- Depression\n- Increased heart rate - While blood concentration of amphetamine and most subjective effects are highest about 3 hours after administration, heart rate peaks much later at 10 hours after administration. [29]\n- Irritability\n- Restless legs\n- Sleep paralysis - Some users note sleep paralysis after consuming amphetamine.\n- Dream suppression\n- Thought deceleration\n- Wakefulness - The insomnia following a repeated series of amphetamine doses can last for longer than a day in some users.\n- Motivation suppression - Experiences can range from mild demotivation to extreme states of disinterest. This effect is more prominent at common and heavy doses.\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk summarizes the after effects of amphetamine use, including psychological and physical symptoms such as anxiety, depression, increased heart rate, sleep paralysis, and motivation suppression. It is part of a detailed section on the drug's physiological and psychological aftermath, providing key information on potential adverse experiences during the comedown phase. These effects are crucial for understanding amphetamine's toxicity and harm potential.\n                "}
