{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_0", "document_index": 249, "latency_s": 0.581672799991793, "prompt_toks": 1450, "completion_toks": 41}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Buprenorphine\npsychonaut_name: Buprenorphine\npsychonaut_url: https://psychonautwiki.org/wiki/Buprenorphine\n\n\n                    Context: \n                    This chunk provides the basic identification details and psychonaut reference URL for Buprenorphine, serving as an introductory metadata section within the comprehensive webpage dedicated to its pharmacology, effects, and legal status.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_1", "document_index": 249, "latency_s": 0.6350278000027174, "prompt_toks": 1774, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Buprenorphine | Chemical Nomenclature | Common names | Buprenex, Subutex, Butrans, Cizdol, Addnok, Transtec | Systematic name | (2S)-2-[(5R,6R,7R,14S)-9α-cyclopropylmethyl-4,5-epoxy-6,14-ethano-3-hydroxy-6-methoxymorphinan-7-yl]-3,3-dimethylbutan-2-ol | Class Membership | Psychoactive class | Opioid | Chemical class | Morphinan | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Sublingual | Dosage | Bioavailability | 30% | [2] | Threshold | <=0.3 mg | Light | 1 - 2 mg | Common | 2 - 4 mg | Strong | 4 - 8 mg | Heavy | 8mg + | Duration | Total | 18 - 24 hours | Onset | 40 - 80 minutes | Peak | 1.5 - 2 hours | After effects | 1 - 3 days | ⇣ | Insufflated | Dosage | Bioavailability | 48% | [3] | Threshold | < 0.2 mg | Light | 0.2 - 0.4 mg | Common | 0.4 - 0.8 mg | Strong | 0.8 - 1.5 mg | Heavy | 1.5 mg + | Duration | Total\n\n\n                    Context: \n                    This chunk is a detailed excerpt from the infobox section of the Buprenorphine webpage, providing key chemical, pharmacological, and dosage information such as common names, systematic name, routes of administration, bioavailability, dosage thresholds, onset time, and duration, supporting quick reference and search optimization.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_2", "document_index": 249, "latency_s": 0.7727465000061784, "prompt_toks": 1626, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    1 - 3 days | ⇣ | Insufflated | Dosage | Bioavailability | 48% | [3] | Threshold | < 0.2 mg | Light | 0.2 - 0.4 mg | Common | 0.4 - 0.8 mg | Strong | 0.8 - 1.5 mg | Heavy | 1.5 mg + | Duration | Total | 8 - 14 hours | Onset | 30 - 60 minutes | Peak | 4 - 8 hours | After effects | 1 - 3 days | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine | MXE | Tramadol | Grapefruit\n\n\n                    Context: \n                    This excerpt provides detailed insufflation dosing guidelines, onset, duration, and interaction warnings for buprenorphine, complementing the full pharmacological and physical effects overview in the document. It highlights key dosage ranges, durations of effects, and safety considerations critical for understanding its use and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_3", "document_index": 249, "latency_s": 0.8156753000075696, "prompt_toks": 1627, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences: \nPhysical effects: - Pain relief Physical euphoria - This particular substance can be considered as less intense in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin) due to it being a partial agonist of the μ-opioid receptor. The sensation itself can be described as extreme feelings of intense physical comfort, warmth and bliss which spreads throughout the body. Itchiness Respiratory depression - Buprenorphine causes less respiratory depression than other opioids due to it being a partial agonist of the μ-opioid receptor. Dizziness Sedation Decreased heart rate Constipation Cough suppression Decreased libido Difficulty urinating Pupil constriction Nausea - Buprenorphine causes substantially more nausea and vomiting than other opioids. Appetite suppression Orgasm suppression\n- Pain relief\n\n\n                    Context: \n                    This chunk provides a detailed section on the physical effects of buprenorphine, outlining its analgesic properties, euphoric sensations, side effects like nausea and respiratory depression, and other physiological impacts. It is part of the broader document that covers pharmacology, subjective effects, toxicity, and legal status. Including this section enhances understanding of buprenorphine's physical profile and harm potential for user reference and educational purposes.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_4", "document_index": 249, "latency_s": 0.8128091999969911, "prompt_toks": 1602, "completion_toks": 57}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Pain relief\n- Physical euphoria - This particular substance can be considered as less intense in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin) due to it being a partial agonist of the μ-opioid receptor. The sensation itself can be described as extreme feelings of intense physical comfort, warmth and bliss which spreads throughout the body.\n- Itchiness\n- Respiratory depression - Buprenorphine causes less respiratory depression than other opioids due to it being a partial agonist of the μ-opioid receptor.\n- Dizziness\n- Sedation\n- Decreased heart rate\n- Constipation\n- Cough suppression\n- Decreased libido\n- Difficulty urinating\n- Pupil constriction\n- Nausea - Buprenorphine causes substantially more nausea and vomiting than other opioids.\n- Appetite suppression\n- Orgasm suppression\n\n\n                    Context: \n                    This excerpt provides a detailed list of the physical effects associated with buprenorphine, including opioid-related sensations such as pain relief, euphoria, and side effects like nausea, respiratory depression, and constipation, highlighting its pharmacological profile and safety considerations within the broader drug overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_5", "document_index": 249, "latency_s": 0.8806408000091324, "prompt_toks": 1593, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Decreased libido\n- Difficulty urinating\n- Pupil constriction\n- Nausea - Buprenorphine causes substantially more nausea and vomiting than other opioids.\n- Appetite suppression\n- Orgasm suppression\nCognitive effects: - The general head space of buprenorphine is described by many as one of euphoria, relaxation, anxiety suppression and pain relief. Cognitive euphoria - This particular substance can be considered as less intense in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin) due to it being a partial agonist of the μ-opioid receptor. It is still, however, capable of extreme intensity and overwhelming bliss at heavier dosages with a low tolerance. The sensation itself can be described as powerful and overwhelming feeling of emotional bliss, contentment,  and happiness. Anxiety suppression\n\n\n                    Context: \n                    This excerpt covers the physical and cognitive effects of buprenorphine, including side effects like decreased libido, difficulty urinating, pupil constriction, nausea, appetite and orgasm suppression, as well as its subjective experience of euphoria, relaxation, and anxiety suppression, highlighting its distinct profile as a partial μ-opioid receptor agonist.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_6", "document_index": 249, "latency_s": 0.6979550000105519, "prompt_toks": 1580, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive euphoria - This particular substance can be considered as less intense in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin) due to it being a partial agonist of the μ-opioid receptor. It is still, however, capable of extreme intensity and overwhelming bliss at heavier dosages with a low tolerance. The sensation itself can be described as powerful and overwhelming feeling of emotional bliss, contentment,  and happiness.\n- Anxiety suppression\nHistory and culture: \nLiterature: \nVisual effects: - Hallucinatory states Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\n\n\n                    Context: \n                    This excerpt discusses the subjective cognitive and visual effects of buprenorphine, highlighting its capacity to induce feelings of euphoria, anxiety suppression, and dream-like hallucinations at higher dosages. These details are relevant for understanding the drug’s psychoactive profile and are situated within the broader section on physical and perceptual effects of buprenorphine in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 20, "doc_id": "doc_249", "num_chunks": 8, "chunk_id": "249::chunk_7", "document_index": 249, "latency_s": 1.0725144999887561, "prompt_toks": 1516, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt details the visual effects and related phenomena associated with buprenorphine use, specifically highlighting internal hallucinations such as dream-like states and geometric imagery during heavy dosages. It is part of a comprehensive overview of buprenorphine's subjective effects, providing specific information on hallucinations and sensory phenomena relevant to users and researchers.\n                "}
