{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_0", "document_index": 252, "latency_s": 0.9321032999869203, "prompt_toks": 6436, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Codeine\npsychonaut_name: Codeine\npsychonaut_url: https://psychonautwiki.org/wiki/Codeine\n\n\n                    Context: \n                    This chunk provides the basic identification details of the substance, including its name \"Codeine,\" alternative psychonaut name, and official webpage URL. It serves as an introductory reference point within the comprehensive document, which covers detailed chemistry, pharmacology, effects, legal status, and more related to Codeine. Highlighting these identifiers helps users quickly locate core information about the drug.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_1", "document_index": 252, "latency_s": 0.820646600011969, "prompt_toks": 6700, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Codeine | Chemical Nomenclature | Common names | Codeine, Lean, Purple Drank, Syrup | Substitutive name | 3-methylmorphine | Systematic name | (5α,6α)-7,8-Didehydro-4,5-epoxy-3-methoxy-17-methylmorphinan-6-ol | Class Membership | Psychoactive class | Opioid | Chemical class | Morphinan | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Smoked | Dosage | Bioavailability | 49.9 - 59.7% | [2] | Duration | ⇣ | Oral | Dosage | Threshold | 30 mg | Light | 50 - 100 mg | Common | 100 - 150 mg | Strong | 150 - 200 mg | Heavy | 200 mg + | Duration | Total | 3 - 6 hours | Onset | 30 - 45 minutes | Come up | 1 - 2 hours | Peak | 3 - 5 hours | Offset | 2 - 4 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified\n\n\n                    Context: \n                    This chunk provides detailed infobox metadata for codeine, including chemical names, common slang, dosage information, routes of administration, bioavailability, duration, and legal warnings. It complements the main text by summarizing key pharmacological and usage data critical for understanding codeine's properties, effects, and responsible use. This structured overview enhances quick reference and search retrieval for technical and safety-related information about codeine.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_2", "document_index": 252, "latency_s": 0.9707609000033699, "prompt_toks": 6508, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    5 hours | Offset | 2 - 4 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine | MXE | Tramadol | Grapefruit\n\n\n                    Context: \n                    This excerpt summarizes key pharmacokinetic details of codeine, including duration (5 hours), offset (2-4 hours), and a disclaimer on responsible use. It also lists critical drug interactions with substances like MAOIs, nitrous, PCP, stimulants, alcohol, and others, highlighting safety considerations in the broader context of codeine's pharmacology and harm potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_3", "document_index": 252, "latency_s": 0.7496888000023318, "prompt_toks": 6571, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: Codeine, or 3-methylmorphine, is an opioid of the morphinan class. Codeine and other molecules of this class contain a polycyclic core of three benzene rings fused in a zig-zag pattern called phenanthrene. A fourth nitrogen-containing ring is fused to the phenanthrene at R 9 and R 13 with the nitrogen member looking at R 17 of the combined structure. This structure is called morphinan. Codeine (along with other morphinans) contains an ether bridge between two of its rings, connecting R 4 and R 5 through an oxygen group. It contains a hydroxy group (OH-) bound at R 6 and a methyl group located on the nitrogen atom at R 17 .\n\n\n                    Context: \n                    This section provides a detailed chemical description of codeine, including its molecular structure, key functional groups, and relation to other morphinan opioids. It highlights the molecular bonds, the presence of a hydroxy group, and the methylated nitrogen, which are essential for understanding its pharmacology and classification within opioid compounds. This chemical overview is integral to the broader discussion of codeine's pharmacology and chemistry in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_4", "document_index": 252, "latency_s": 0.9083076000097208, "prompt_toks": 6602, "completion_toks": 93}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    On the same ring containing the hydroxy group, codeine contains a double bond which dihydrocodeine lacks. Codeine is closely related to morphine as both contain an oxygen group at R 3 , but this oxygen group in codeine is substituted by a methyl group (making a methoxy group). Codeine is analogous to the other morphinans including dihydrocodeine , heroin , ethylmorphine , hydrocodone , and oxycodone .\nPharmacology: Codeine is not itself centrally active, and must first be converted via first-pass metabolism into morphine by the cytochrome P450 enzyme CYP2D6 (as such, it is a prodrug for morphine). Codeine is also metabolized into the inactive norcodeine via the CYP3A4 enzyme system. Both resultant forms are conjugated by UGT2B7 into their corresponding 3-glucuronide. [ citation needed ]\n\n\n                    Context: \n                    This excerpt explains the chemical structure of codeine, highlighting its double bond and its relation to morphine and other morphinans, as well as its pharmacological mechanism as a prodrug that is metabolized into active morphine via CYP2D6 and inactive norcodeine via CYP3A4. It provides essential details on codeine’s chemical properties and metabolic pathways, relevant for understanding its effects, addiction potential, and interactions discussed throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_5", "document_index": 252, "latency_s": 0.7025390000053449, "prompt_toks": 6567, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Some percentage of the population produces less CYP2D6 enzymes and so experience a significant reduction of effects from codeine in comparison to that of the average person. However, others produce CYP2D6 enzymes in higher quantities which can result in hypersensitivity to the drug. Some methods of potentiating opioids , such as using grapefruit juice throughout the day before consumption, inhibits the CYP3A4 enzyme. [6] This results in less codeine being converted into norcodeine which leaves more to be metabolized into morphine [ citation needed ] . This also indicates a lacking capability in the metabolism of codeine into morphine when a user consumes antihistamines such as diphenhydramine prior to the ingestion of codeine. [7]\n\n\n                    Context: \n                    This excerpt discusses genetic and pharmacokinetic factors affecting codeine metabolism, highlighting variations in CYP2D6 enzyme activity, interactions with substances like grapefruit juice, and the impact of antihistamines on morphine conversion, which are important for understanding individual responses, potency, and risks associated with codeine use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_6", "document_index": 252, "latency_s": 0.7904283000098076, "prompt_toks": 6484, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    There is an upper limit to the amount of codeine which can be converted by enzymatic metabolism into morphine throughout an individual session. This limit is commonly referred to as the \"ceiling dose\", which is commonly believed to be around 400mg. Consuming higher doses will lead to greater side effects such as itchiness and nausea , but will not increase euphoria .\n\n\n                    Context: \n                    This section explains the concept of the \"ceiling dose\" of codeine, typically around 400mg, which limits the amount of active morphine produced through metabolism during a session. It highlights that exceeding this dose increases side effects like itchiness and nausea without enhancing euphoric effects, emphasizing important safety considerations within the broader discussion of codeine's pharmacology and dosage guidelines.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_7", "document_index": 252, "latency_s": 0.6986097000044538, "prompt_toks": 6576, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The active metabolites of codeine, notably morphine , exert their effects by binding to and activating opioid receptors, mainly the μ-opioid receptor . [8] This occurs because opioids structurally mimic endogenous endorphins which are naturally found within the body and also work upon the μ-opioid receptor set. The way in which opioids structurally mimic these natural endorphins results in their euphoria , pain relief , muscle relaxing and anxiolytic effects. This is because endorphins are responsible for reducing pain, causing sleepiness, and feelings of pleasure. They can be released in response to pain, strenuous exercise, orgasm, or general excitement.\nCodeine itself is a weak ligand for the opioid receptors. However, its main active metabolite, morphine , shows much stronger agonistic effects .\n\n\n                    Context: \n                    This section explains the pharmacological mechanism of codeine and its active metabolite morphine, detailing how they interact with μ-opioid receptors to produce effects like euphoria and pain relief. It highlights that while codeine is a weak ligand, its conversion to morphine accounts for its stronger opioid activity, a key aspect of its psychoactive profile discussed elsewhere in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_8", "document_index": 252, "latency_s": 0.739327699993737, "prompt_toks": 6567, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Binding affinities (K i ) [9]\n- Mu opioid agonist - 589 nM\n- Kappa opioid agonist - 18061 nM\n- Delta opioid agonist - 11442 nM\nSubjective effects: Disclaimer: The effects listed below cite the Subjective Effect Index ( SEI ), an open research literature based on anecdotal user reports and the personal analyses of PsychonautWiki contributors . As a result, they should be viewed with a healthy degree of skepticism.\nIt is also worth noting that these effects will not necessarily occur in a predictable or reliable manner, although higher doses are more liable to induce the full spectrum of effects. Likewise, adverse effects become increasingly likely with higher doses and may include addiction, severe injury, or death ☠.\n\n\n                    Context: \n                    This section details the binding affinities of codeine to various opioid receptors, including mu, kappa, and delta, measured in nanomolar concentrations. It also discusses subjective effects based on user reports, emphasizing the variability and risks associated with dosage. This information is crucial for understanding codeine's pharmacological profile and its potential psychoactive experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_9", "document_index": 252, "latency_s": 0.6329697000037413, "prompt_toks": 6547, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Experience reports\nThere are currently no anecdotal reports which describe the effects of this compound within our experience index . Additional experience reports can be found here:\n- Erowid Experience Vaults: Codeine\nToxicity and harm potential: Codeine has a low toxicity relative to dose. As with all opioids, long-term effects can vary but can include diminished libido, apathy and memory loss. Some people may also have an allergic reaction to codeine, such as the swelling of skin and rashes. [10] It is also potentially lethal when mixed with depressants like alcohol or benzodiazepines .\nIt is strongly recommended that one use harm reduction practices when using this drug.\n\n\n                    Context: \n                    This segment discusses anecdotal user reports, noting the absence of specific effects described in the experience index for codeine, and highlights toxicity, harm potential, long-term effects, allergic reactions, and risks associated with combining codeine with depressants. It emphasizes the importance of harm reduction practices when using this opioid.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_10", "document_index": 252, "latency_s": 0.7663614999910351, "prompt_toks": 6467, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Tolerance and addiction potential\nAs with other opioids , the chronic use of codeine can be considered moderately addictive with a high potential for abuse and is capable of causing psychological dependence among certain users. When addiction has developed, cravings and withdrawal symptoms may occur if a person suddenly stops their usage.\n\n\n                    Context: \n                    This section discusses the potential for tolerance and addiction associated with codeine, highlighting its moderate addictiveness, high abuse potential, and risk of psychological dependence, which are important considerations within the broader context of its pharmacology, effects, and harm potential detailed in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_11", "document_index": 252, "latency_s": 1.002771900006337, "prompt_toks": 6538, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Tolerance to many of the effects of codeine develops with prolonged and repeated use. The rate at which this occurs develops at different rates for different effects, with tolerance to the constipation-inducing effects developing particularly slowly for instance. This results in users having to administer increasingly large doses to achieve the same effects. After that, it takes about 3 - 7 days for the tolerance to be reduced to half and 1 - 2 weeks to be back at baseline (in the absence of further consumption). Codeine presents cross-tolerance with all other opioids , meaning that after the consumption of codeine all opioids will have a reduced effect.\n\n\n                    Context: \n                    This passage explains the development of tolerance to codeine's effects with repeated use, highlighting variations in tolerance buildup across different effects such as constipation. It details the timeframes for tolerance reduction and emphasizes cross-tolerance with other opioids, making it crucial for understanding dosage adjustments and risks associated with prolonged use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_12", "document_index": 252, "latency_s": 0.8675262999895494, "prompt_toks": 6557, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Dangerous interactions\nWarning: Many psychoactive substances that are reasonably safe to use on their own can suddenly become dangerous and even life-threatening when combined with certain other substances. The following list provides some known dangerous interactions (although it is not guaranteed to include all of them).\nAlways conduct independent research (e.g. Google , DuckDuckGo , PubMed ) to ensure that a combination of two or more substances is safe to consume. Some of the listed interactions have been sourced from TripSit .\n- Alcohol - Both substances potentiate the ataxia and sedation caused by the other and can lead to unexpected loss of consciousness at high doses. Place affected patients in the recovery position to prevent vomit aspiration from excess. Memory blackouts are likely\n\n\n                    Context: \n                    This section details dangerous interactions between codeine and other substances, emphasizing potential health risks and emphasizing the importance of independent research before combining drugs. It highlights key substance interactions, such as with alcohol, stimulants, benzodiazepines, and others, making it essential for understanding safety considerations in codeine use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_13", "document_index": 252, "latency_s": 0.9327780999883544, "prompt_toks": 6573, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stimulants - Stimulants increase respiration rate which allows for a higher dose of opiates than would otherwise be used. If the stimulant wears off first then the opiate may overcome the user and cause respiratory arrest.\n- Benzodiazepines - Central nervous system and/or respiratory-depressant effects may be additively or synergistically present. The two substances potentiate each other strongly and unpredictably, very rapidly leading to unconsciousness. While unconscious, vomit aspiration is a risk if not placed in the recovery position blackouts/memory loss likely.\n- DXM - Generally considered to be toxic. CNS depression, difficulty breathing, heart issues, and liver toxicity have been observed. Additionally if one takes DXM, their tolerance of opiates goes down slightly, thus causing additional synergistic effects.\n\n\n                    Context: \n                    This section discusses dangerous drug interactions involving codeine, specifically with stimulants, benzodiazepines, and DXM. It highlights the risks of combining these substances, such as respiratory depression, unconsciousness, and toxicity, emphasizing the importance of harm reduction. This information is critical for understanding the potential dangers of concomitant drug use with codeine.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_14", "document_index": 252, "latency_s": 1.4291999999986729, "prompt_toks": 6606, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - GHB / GBL - The two substances potentiate each other strongly and unpredictably, very rapidly leading to unconsciousness. While unconscious, vomit aspiration is a risk if not placed in the recovery position\n- Ketamine - Both substances bring a risk of vomiting and unconsciousness. If the user falls unconscious while under the influence there is a severe risk of vomit aspiration if they are not placed in the recovery position.\n- MAOIs - Coadministration of monoamine oxidase inhibitors (MAOIs) with certain opioids has been associated with rare reports of severe adverse reactions. There appear to be two types of interaction, an excitatory and a depressive one. Symptoms of the excitatory reaction may include agitation, headache, diaphoresis, hyperpyrexia, flushing, shivering, myoclonus, rigidity, tremor, diarrhea, hypertension, tachycardia, seizures, and coma. Death has occurred in some cases.\n\n\n                    Context: \n                    This section details dangerous drug interactions involving GHB/GBL, ketamine, and MAOIs, highlighting risks of unconsciousness, vomiting, and severe adverse reactions when combined with opioids like codeine. It emphasizes the potential for life-threatening complications, underscoring the importance of understanding these risks within the broader discussion of codeine's pharmacology, toxicity, and safety considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_15", "document_index": 252, "latency_s": 1.0495661000022665, "prompt_toks": 6558, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - MXE - MXE can potentiate the effects of opioids but also increases the risk of respiratory depression and organ toxicity.\n- Nitrous - Both substances potentiate the ataxia and sedation caused by the other and can lead to unexpected loss of consciousness at high doses. While unconscious, vomit aspiration is a risk if not placed in the recovery position. Memory blackouts are common.\n- PCP - PCP may reduce opioid tolerance, increasing the risk of overdose.\n- Tramadol - Increased risk of seizures. Tramadol itself is known to induce seizures and it may have additive effects on seizure threshold with other opioids. Central nervous system- and/or respiratory-depressant effects may be additively or synergistically present.\n\n\n                    Context: \n                    This section outlines dangerous drug interactions between codeine and various substances, including MXE, nitrous oxide, PCP, and tramadol, emphasizing increased risks such as respiratory depression, organ toxicity, loss of consciousness, overdose, and seizures. It highlights the importance of understanding combined effects to promote safety and harm reduction when using opioids like codeine.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_16", "document_index": 252, "latency_s": 1.1718513000087114, "prompt_toks": 6563, "completion_toks": 107}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Grapefruit - While grapefruit is not psychoactive, it may affect the metabolism of certain opioids. Tramadol, oxycodone, and fentanyl are all primarily metabolized by the enzyme CYP3A4, which is potently inhibited by grapefruit juice [11] . This may cause the drug to take longer to clear from the body. it may increase toxicity with repeated doses. Methadone may also be affected [11] .  Codeine and hydrocodone are metabolized by CYP2D6. People who are on medicines that inhibit CYP2D6, or that lack the enzyme due to a genetic mutation will not respond to codeine as it can not be metabolized into its active product: morphine.\n\n\n                    Context: \n                    This chunk explains the impact of grapefruit on opioid metabolism, highlighting how grapefruit inhibits CYP3A4 enzymes affecting drugs like tramadol, oxycodone, fentanyl, and methadone, leading to longer drug clearance and increased toxicity. It also details that codeine and hydrocodone are primarily metabolized by CYP2D6, which can be inhibited by certain medications or genetic variations, reducing their effectiveness. This information is relevant for understanding drug interactions and individual variability in opioid metabolism discussed throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_17", "document_index": 252, "latency_s": 0.6851545999961672, "prompt_toks": 6588, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Legal status: - Australia: In Australia, codeine preparations are Schedule 4 (Prescription Only) medications when combined with other substances [12] . Preparations containing pure codeine (e.g., codeine phosphate tablets or codeine phosphate linctus) are available on prescription and are considered Schedule 8 (Controlled Drug (Possession without authority illegal)) [13] . Schedule 8 drugs are drugs that are available to be prescribed but are heavily restricted to prevent abuse and dependence [14] . Possessing Schedule 8 drugs without authority is a criminal offense and can have varying punishments depending on the state of prosecution.\n- Austria: Codeine is legal for medical use under the AMG (Arzneimittelgesetz Österreich) and illegal when sold or possessed without a prescription under the SMG (Suchtmittelgesetz Österreich). [15]\n\n\n                    Context: \n                    This excerpt outlines the legal status of codeine in various countries, specifically highlighting regulations in Australia and Austria. It details whether codeine is available by prescription or over-the-counter, and emphasizes restrictions on pure or high-dose preparations to prevent misuse. This information is crucial for understanding the legal context and access restrictions related to codeine worldwide.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_18", "document_index": 252, "latency_s": 0.5743819000053918, "prompt_toks": 6632, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Austria: Codeine is legal for medical use under the AMG (Arzneimittelgesetz Österreich) and illegal when sold or possessed without a prescription under the SMG (Suchtmittelgesetz Österreich). [15]\n- Canada: In Canada, codeine is available over the counter in combination tablets with the following restrictions: no more than 8 mg per dosage unit and it must be combined with at least two other active ingredients. It is kept behind the counter, to be sold on request-- generally to those 18 and over-- after a brief consultation and at the pharmacist's discretion. The other active ingredients most commonly consist of another non-opioid analgesic (300 mg acetaminophen, as in Tylenol No. 1; or 325 mg aspirin, as in 222s) and 15 mg caffeine. OTC tablets containing ibuprofen are generally unavailable. Preparations with a codeine content higher than 8 mg per dosage unit, or fewer than two other active ingredients, are available on prescription. [ citation needed ]\n\n\n                    Context: \n                    This section details the legal status of codeine in Austria and Canada, highlighting Austria's strict prescription-based regulation and Canada's over-the-counter availability with specific dosage and combination restrictions. It provides key international legal distinctions relevant for understanding codeine's accessibility and regulatory framework worldwide.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_19", "document_index": 252, "latency_s": 0.7958500000095228, "prompt_toks": 6573, "completion_toks": 99}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Denmark: In Denmark, codeine is sold over the counter with max 9.6 mg in the mixture. The item is given over the counter, with no prescriptions. The strongest available over the counter preparation containing codeine has 9.6 mg (with aspirin, brand name Kodimagnyl); anything stronger requires a prescription for legal possession. [ citation needed ]\n- Finland: In Finland, codeine cough syrups with a maximum strength of 1mg/ml is sold in pharmacies over the counter. Codeine isn't available in pill form without a prescription. Any stronger cough syrup and combination painkillers (codeine with paracetamol or ibuprofen such as Panacod, Co-codamol, and Ardinex) require a prescription. [ citation needed ]\n\n\n                    Context: \n                    This segment provides information on the legal status and OTC availability of codeine in Denmark and Finland, specifying dosage limits and restrictions. It highlights that in Denmark, codeine is sold without prescription up to 9.6 mg per mixture, while in Finland, small-dose cough syrups with up to 1 mg/ml are available OTC, with stronger formulations requiring a prescription. These details complement the broader discussion of international legal classifications and forms of codeine use covered in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_20", "document_index": 252, "latency_s": 1.3265136999980314, "prompt_toks": 6586, "completion_toks": 108}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - France: In France, most preparations containing codeine do not require a doctor's prescription. Example products containing codeine include Néocodion (cough pills, and syrup), Codoliprane (codeine with paracetamol), Prontalgine and Migralgine (codeine, paracetamol, and caffeine). [16] Codeine is regulated/controlled substance (schedule 2) since 2017 after a decision of the \"Minister of Health\" Agnès Buzyn, it is therefore now under prescription only and raw pure codeine is not available altogether anymore. The most common prescribed codeine brands are Klipal and Codoliprane, both mixed with paracetamol heavily. Klipal being the strongest ratio, 50mg codeine for 600mg paracetamol.\n\n\n                    Context: \n                    This excerpt provides information on France's regulatory status of codeine-containing products, highlighting that most preparations are available over the counter without a prescription, but since 2017, codeine has been classified as a schedule 2 controlled substance requiring a prescription. It lists common products like Néocodion, Codoliprane, Prontalgine, and Migralgine, emphasizing that pure codeine is no longer available commercially. This detailed legal overview complements the document's broader discussion of codeine's legal status worldwide.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_21", "document_index": 252, "latency_s": 1.1112253000028431, "prompt_toks": 6620, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Germany: Codeine is a controlled substance under Anlage III of the BtMG. It can only be prescribed on a narcotic prescription form. There is an exception for preparations, containing up to 2,5% or 100mg codeine per unit, which can be prescribed on a regular prescription if not prescripted to an alcohol or drug dependent person. [17]\n- Greece: Codeine is classed as an illegal drug in Greece, and individuals possessing it could conceivably be arrested, even if they were legitimately prescribed it in another country. It is sold only with a doctor's prescription. [18]\n- Hong Kong: In Hong Kong, codeine is regulated under Laws of Hong Kong, Dangerous Drugs Ordinance, Chapter 134, Schedule 1. It can be used legally only by health professionals and for university research purposes. The substance can be given by pharmacists under a prescription. However, codeine is available without prescription from licensed pharmacists in doses up to 0.1% [19]\n\n\n                    Context: \n                    This excerpt details international legal restrictions on codeine, including regulations in Germany, Greece, and Hong Kong. It highlights differing legal classifications, prescription requirements, and availability limits, providing essential context for understanding global control measures for this opioid. These details are crucial for searches related to legal status and regulation of codeine worldwide.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_22", "document_index": 252, "latency_s": 0.643059699999867, "prompt_toks": 6578, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Iceland: Preparations of paracetamol and codeine require a prescription in Iceland. [ citation needed ]\n- India: Codeine preparations require a prescription in India. Preparation of paracetamol and codeine is available in India. Codeine is also present in various cough syrups as codeine phosphate. [ citation needed ]\n- Iran: Preparations of codeine in Iran normally comes with paracetamol, but can be purchased over-the-counter. Iran's deputy health minister reported that codeine is Iran's best selling OTC medication. The recreational use of codeine has also become widespread throughout Iran but authorities continue to let codeine be purchased without permission from a doctor, although the pharmacist may ask for the identification of the purchaser to verify they are 18 years or older to buy. [ citation needed ]\n\n\n                    Context: \n                    This section outlines the legal status and prescription requirements for codeine in specific countries, including Iceland, India, and Iran, emphasizing that preparations often require a prescription or are available over-the-counter with restrictions. It highlights variations in regulation and widespread OTC use, relevant for understanding international legal and medical contexts of codeine.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_23", "document_index": 252, "latency_s": 0.811682399988058, "prompt_toks": 6595, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Ireland: Codeine remains a semi non-prescriptive, over-the-counter drug up to a limit of 12.8 mg per pill, but codeine products must be out of the view of the public. Products containing more than 12.8 mg codeine are available on prescription only. [ citation needed ]\n- Italy: Codeine tablets or preparations require a prescription in Italy. Preparations of paracetamol and codeine are available in Italy as Co-Efferalgan and Tachidol. [ citation needed ]\n- Japan: Codeine and similar mid-level centrally acting agents in combination with non-opioid analgesics, antihistamines, vitamins, inert GI agents like kaolin & pectin, mild laxatives, antacids, and herbal preparations, can be purchased over the counter, with 10 mg being the ceiling for OTC dispensing. [ citation needed ]\n\n\n                    Context: \n                    This excerpt details the regulatory status of codeine across various countries, specifically focusing on Ireland, Italy, and Japan. It highlights differences in its OTC availability and prescription requirements, providing important legal and access-related information relevant to understanding international drug regulations within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_24", "document_index": 252, "latency_s": 0.5991157999960706, "prompt_toks": 6655, "completion_toks": 43}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Maldives: The Maldives takes an infamously strict line on medicines, with many common drugs, anything containing codeine is banned unless you have a notarized and authenticated doctor's prescription. Visitors breaking the rules, even inadvertently, have been deported or imprisoned. [ citation needed ]\n- Poland: Codeine is listed in \"Wykaz środków odurzających i substancji psychotropowych\" group \" II-N\" which means it's legal to use in scientific and medical pruposes, and  is available over the counter in doses of 15mg in combination with 500mg paracetamol (Antidol) or 300mg sulfogaiacol (Thiocodin). However a pharmacy worker can refuse to sell it if they believe the client is a minor or wants to use it for drug abuse purposes. [20] [21]\n- Romania: Codeine is sold OTC (when combined with another active ingredient), the limit being 12.8mg of codeine per pill, which is seen in Nurofen Plus. Any amount above 12.8mg/unit requires a prescription, whether it has another ingredient or not.\n\n\n                    Context: \n                    This section details country-specific regulations regarding codeine, highlighting strict bans in the Maldives unless prescribed, and legal over-the-counter sales with dosage limits in Poland and Romania, emphasizing varying legal statuses and purchase restrictions worldwide.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_25", "document_index": 252, "latency_s": 0.7723027000029106, "prompt_toks": 6584, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Russia: According to ITAR-Tass and Austria Presse-Agentur, OTC availability of codeine products was rescinded nationwide in 2012 because of the discovery of the Krokodil method of underground desomorphine synthesis. [ citation needed ]\n- Spain: Codeine tablets or preparations require a prescription in Spain, although this is often not enforced and many pharmacies will sell codeine products without the requirement of a prescription. [ citation needed ]\n- Sri Lanka: Codeine preparations are available as over the counter pharmacy medicines in Sri Lanka. The most common preparation is Panadeine, which contains 500 mg of Paracetamol and 8 mg of Codeine. [ citation needed ]\n- Sweden: Codeine is Schedule III under Swedish law, which means it is heavily regulated and sold only to those who have a prescription. [ citation needed ]\n\n\n                    Context: \n                    This section details the legal status and regulation of codeine in various countries, highlighting restrictions on OTC availability in Russia (rescinded in 2012 due to underground synthesis), Spain's prescription requirement with some non-enforcement, Sri Lanka's over-the-counter availability with specific formulations like Panadeine, and Sweden's Schedule III classification requiring prescriptions. These details are relevant for understanding international legal frameworks, access, and restrictions related to codeine use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_26", "document_index": 252, "latency_s": 1.0354344999941532, "prompt_toks": 6592, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sweden: Codeine is Schedule III under Swedish law, which means it is heavily regulated and sold only to those who have a prescription. [ citation needed ]\n- Switzerland : Codeine is a controlled substance specifically named under Verzeichnis A. Medicinal use is permitted. Some preparations containing codeine are included in Verzeichnis C, while certain ones are excluded. [22]\n- Turkey : Codeine is a 'red prescription' only substance [23] and illegal when sold or possessed without a prescription. [ citation needed ]\n- United Arabian Emirates: The UAE takes an exceptionally strict line on medicines, with many common drugs, notably anything with containing codeine being banned unless you have a notarized and authenticated doctor's prescription. Visitors breaking the rules, even inadvertently, have been deported or imprisoned. The US Embassy to the UAE maintains an unofficial list of what may not be imported. [ citation needed ]\n\n\n                    Context: \n                    This section details the legal status and regulatory classifications of codeine across various countries, including Sweden, Switzerland, Turkey, and the United Arab Emirates. It provides specific legal designations, restrictions, and enforcement notes, highlighting international variations in codeine control and accessibility, which are relevant for understanding legal risks and compliance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_27", "document_index": 252, "latency_s": 1.0841492000035942, "prompt_toks": 6548, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - United Kingdom: Under the Misuse of Drugs Act 1971 codeine is a Class B controlled substance or a Class A drug when prepared for injection. [24] The possession of controlled substances without a prescription is a criminal offense. [25] However, certain preparations of codeine are exempt from this restriction under Schedule 5 of the Misuse of Drugs Regulations 2001. It is thus legal to possess codeine without a prescription, provided that it is compounded with at least one other active or inactive ingredient and that the dosage of each tablet, capsule, etc does not exceed 100 mg or 2.5% concentration in the case of liquid preparations. [ citation needed ]\n\n\n                    Context: \n                    This excerpt details the legal status and regulations surrounding opioid codeine in the United Kingdom, specifying its classification under the Misuse of Drugs Act 1971 and exceptions under Schedule 5 of the Misuse of Drugs Regulations 2001. It highlights the conditions under which possession without a prescription is legal, including dosage limits and formulation requirements. This information is crucial for understanding the legal framework and restrictions on recreational and medicinal use of codeine in the UK.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_28", "document_index": 252, "latency_s": 1.1146003999892855, "prompt_toks": 6602, "completion_toks": 96}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - United States: In the United States, codeine is regulated by the Controlled Substances Act. Federal law dictates that codeine be a Schedule II controlled substance when used in products for pain-relief that contain codeine alone or more than 90 mg per dosage unit. Tablets of codeine in combination with aspirin or acetaminophen (paracetamol/Tylenol) made for pain relief are listed as Schedule III; and cough syrups are Schedule III or V, depending on the formula. [ citation needed ]\nSee also: - Responsible use\n- Extraction of opioids from painkiller products\n- Depressants\n- Oxycodone\n- Kratom\nExternal links: - Codeine (Wikipedia)\n- Codeine (Erowid Vault)\n- Codeine (Isomer Design)\n- Codeine (DrugBank)\n- Codeine (Drugs.com)\n- Codeine (Drugs-Forum)\nReferences:\n\n\n                    Context: \n                    This excerpt details the legal status and regulatory classification of codeine in the United States, explaining how it is regulated under the Controlled Substances Act with distinctions based on dosage and formulation, including specifics for pain-relief products and cough syrups. It is part of a comprehensive overview of codeine’s pharmacology, legal issues, and international regulations covered in the full document. This information is relevant for understanding legal controls and potential restrictions on codeine use and possession in the US.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_29", "document_index": 252, "latency_s": 0.7506373000069289, "prompt_toks": 6599, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - The general head space of codeine is described by many as one of euphoria, relaxation, anxiety suppression, and pain relief. Pain relief Physical euphoria - This particular substance can be considered as less intense in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin) due to the upper limit of how much can be converted into its active form through metabolism. The sensation itself can be described as extreme feelings of intense physical comfort, warmth and bliss which spreads throughout the body. Itchiness - This compound presents greater amounts of itchiness due to higher amounts of histamine release in comparison to other opioids . Respiratory depression - At low to moderate doses, this effect results in the sensation that the breath is slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal\n\n\n                    Context: \n                    This excerpt details the physical effects of codeine, including sensations of euphoria, relaxation, pain relief, and side effects like itchiness and respiratory depression. It is part of the comprehensive pharmacological profile provided in the full document, highlighting typical subjective and physical experiences associated with the substance. These details are essential for understanding codeine’s effects, risks, and safe use considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_30", "document_index": 252, "latency_s": 0.6855777000018861, "prompt_toks": 6555, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    breath is slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe overdoses can result in a coma or death without immediate medical attention. Sedation - At higher dosages, this compound can result in feelings of sedation and is considerably more sedating than that of oxycodone and hydrocodone . Appetite suppression Constipation Cough suppression Decreased libido Difficulty urinating Nausea - This effect is more likely to occur during high dosages and/or when the user doesn't adequately pace themselves. Orgasm suppression Pupil constriction\n\n\n                    Context: \n                    This excerpt summarizes the physical effects and risks associated with codeine use, including respiratory depression, sedation, and common side effects like nausea, constipation, and sexual effects. It highlights the dose-dependent nature of respiratory impairment and sedation, emphasizing the importance of responsible dosing. This information is crucial for understanding codeine’s pharmacological profile and safety considerations within the comprehensive drug profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_31", "document_index": 252, "latency_s": 1.1718816000066, "prompt_toks": 6518, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Pain relief\n- Physical euphoria - This particular substance can be considered as less intense in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin) due to the upper limit of how much can be converted into its active form through metabolism. The sensation itself can be described as extreme feelings of intense physical comfort, warmth and bliss which spreads throughout the body.\n- Itchiness - This compound presents greater amounts of itchiness due to higher amounts of histamine release in comparison to other opioids .\n\n\n                    Context: \n                    This section details the physical effects of codeine, including its analgesic properties, its capacity to induce physical euphoria with less intensity than morphine due to metabolic limits, and side effects like increased itchiness resulting from histamine release. It provides essential information on the drug’s subjective and physiological impact, crucial for understanding its pharmacology and user experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_32", "document_index": 252, "latency_s": 0.7583919999888167, "prompt_toks": 6610, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Itchiness - This compound presents greater amounts of itchiness due to higher amounts of histamine release in comparison to other opioids .\n- Respiratory depression - At low to moderate doses, this effect results in the sensation that the breath is slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe overdoses can result in a coma or death without immediate medical attention.\n- Sedation - At higher dosages, this compound can result in feelings of sedation and is considerably more sedating than that of oxycodone and hydrocodone .\n- Appetite suppression\n- Constipation\n- Cough suppression\n- Decreased libido\n- Difficulty urinating\n- Nausea - This effect is more likely to occur during high dosages and/or when the user doesn't adequately pace themselves.\n- Orgasm suppression\n\n\n                    Context: \n                    This section summarizes the physical and side effects of codeine, highlighting common opioid-related reactions such as itchiness from histamine release, respiratory depression at higher doses, sedation, and various reproductive and gastrointestinal effects including nausea, libido decrease, constipation, and orgasm suppression. It provides key details on the intensity and potential risks associated with different dosages, situating these effects within the broader pharmacology and toxicity profile of codeine discussed in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_33", "document_index": 252, "latency_s": 0.9034052999923006, "prompt_toks": 6595, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Decreased libido\n- Difficulty urinating\n- Nausea - This effect is more likely to occur during high dosages and/or when the user doesn't adequately pace themselves.\n- Orgasm suppression\n- Pupil constriction\nCognitive effects: - Cognitive euphoria - This particular substance can be considered as less intense in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin) due to the upper limit of how much can be converted into its active form through metabolism. It is still, however, capable of extreme intensity and overwhelming bliss at heavier dosages with a low tolerance. The sensation itself can be described as a powerful and overwhelming feeling of emotional bliss, contentment, and happiness. Anxiety suppression Thought deceleration Compulsive redosing - It is worth noting that redosing codeine will not amplify the intensity of its effects. Dream potentiation Sleepiness\n\n\n                    Context: \n                    This section details the physical and cognitive effects of codeine, including decreased libido, difficulty urinating, nausea at high doses, orgasm suppression, pupil constriction, and subjective experiences such as cognitive euphoria, anxiety suppression, thought deceleration, compulsive redosing, dream potentiation, and sleepiness, forming part of the drug's overall profile in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_34", "document_index": 252, "latency_s": 0.7838841000047978, "prompt_toks": 6637, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive euphoria - This particular substance can be considered as less intense in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin) due to the upper limit of how much can be converted into its active form through metabolism. It is still, however, capable of extreme intensity and overwhelming bliss at heavier dosages with a low tolerance. The sensation itself can be described as a powerful and overwhelming feeling of emotional bliss, contentment, and happiness.\n- Anxiety suppression\n- Thought deceleration\n- Compulsive redosing - It is worth noting that redosing codeine will not amplify the intensity of its effects.\n- Dream potentiation\n- Sleepiness\nHistory and culture: \nLiterature: - Friswell J, Phillips C, Holding J, Morgan CJ, Brandner B, Curran HV. (2008). Acute effects of opioids on memory functions of healthy men and women. Psychopharmacology (Berl.). 198 (2): 243–50. https://doi.org/10.1007/s00213-008-1123-x .\n\n\n                    Context: \n                    This excerpt details the subjective cognitive effects of codeine, including its potential to induce emotional bliss, anxiety suppression, and thought deceleration, with notes on redosing and sedative properties, as well as references to related research on opioid impacts on memory functions. It is relevant for understanding the mental and emotional influence of codeine within the broader discussion of its pharmacology and subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_35", "document_index": 252, "latency_s": 0.9908400999993319, "prompt_toks": 6725, "completion_toks": 98}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Schmidt, H., Vormfelde, S. V., Klinder, K., Gundert-Remy, U., Gleiter, C. H., Skopp, G., Aderjan, R. and Fuhr, U. (2002), Affinities of Dihydrocodeine and its Metabolites to Opioid Receptors. Pharmacology & Toxicology, 91: 57–63. https://doi.org/10.1034/j.1600-0773.2002.910203.x\n- Koch T, Höllt V. (2008). Role of receptor internalization in opioid tolerance and dependence. Pharmacol. Ther. 117 (2): 199–206. https://doi.org/10.1016/j.pharmthera.2007.10.003\n- Pert, C. B., Pasternak, G., & Snyder, S. H. (1973). Opiate Agonists and Antagonists Discriminated by Receptor Binding in Brain. Science, 182 (4119), 1359-1361. https://doi.org/10.1126/science.182.4119.1359\n- Stefano GB, Ptáček R, Kuželová H, Kream RM. (2012). Endogenous morphine: up-to-date review (2011). Folia Biol. (Praha). 58 (2): 49–56. PMID 22578954.\n\n\n                    Context: \n                    This chunk comprises scholarly references related to the pharmacology and receptor interactions of opioids like dihydrocodeine, receptor internalization in opioid tolerance, and endogenous morphine production, providing scientific sources that underpin the detailed pharmacological mechanisms discussed in the document. These references enhance understanding of codeine's receptor binding affinities, tolerance development, and endogenous opioid systems. They are essential for researchers seeking authoritative citations on opioid receptor pharmacodynamics and biochemistry within the broader context of the webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_36", "document_index": 252, "latency_s": 0.8008321999950567, "prompt_toks": 6632, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stefano GB, Ptáček R, Kuželová H, Kream RM. (2012). Endogenous morphine: up-to-date review (2011). Folia Biol. (Praha). 58 (2): 49–56. PMID 22578954.\nVisual effects: - Suppressions Double vision - At high doses, the eyes un-focus and re-focus uncontrollably. This creates a blurred effect and double vision that is present no matter where one focuses their eyes. This can be so intense it becomes impossible to read or drive. Hallucinatory States Internal Hallucination -One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery. This is often accompanied by ill-defined geometry.\n- Double vision - At high doses, the eyes un-focus and re-focus uncontrollably. This creates a blurred effect and double vision that is present no matter where one focuses their eyes. This can be so intense it becomes impossible to read or drive.\n\n\n                    Context: \n                    This excerpt cites the 2012 review by Stefano et al. on endogenous morphine, highlighting visual effects of codeine such as high-dose double vision and internal hallucinations, and emphasizes the experiment's relevance to codeine’s visual and perceptual impacts discussed in the broader pharmacology and effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_37", "document_index": 252, "latency_s": 0.7790588000061689, "prompt_toks": 6609, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal Hallucination -One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery. This is often accompanied by ill-defined geometry.\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther: Common forms:\nCodeine is available within pharmacies across the world in a variety of forms that combine it with other products that are dangerous or even fatal to consume at higher dosages. This is done to act as a deterrent to prevent their recreational use but can easily be circumvented with the use of a cold water extraction .\n- Co-codamol contain 500mg of paracetamol per 8mg of codeine. It is available behind the counter in any British pharmacy.\n\n\n                    Context: \n                    This excerpt discusses the subjective and perceptual effects of codeine, including hallucinations and sensory distortions, as well as its common pharmaceutical formulations. It highlights how codeine is often combined with other substances, sometimes dangerously, and mentions specific medical products like co-codamol and Nurofen Plus, emphasizing their recreational misuse potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 23, "doc_id": "doc_252", "num_chunks": 39, "chunk_id": "252::chunk_38", "document_index": 252, "latency_s": 0.7829376000008779, "prompt_toks": 6532, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Co-codamol contain 500mg of paracetamol per 8mg of codeine. It is available behind the counter in any British pharmacy.\n- Nurofen plus contain 12.8mg of codeine alongside ibuprofen. It is available behind the counter in any British pharmacy. Due to the higher codeine content than co-codamol, they are better for cold water extraction .\n- Many prescription-strength cough syrups contain codeine and promethazine - an antihistamine. When used recreationally they are commonly known as lean or purple drank .\n\n\n                    Context: \n                    This excerpt details common over-the-counter and prescription forms of codeine available in the UK, such as Co-codamol and Nurofen Plus, including their typical dosages and uses. It also highlights recreational preparation methods, referencing popular \"lean\" or \"purple drank\" mixtures containing codeine and promethazine. These details are relevant for understanding legal access, typical formulations, and potential misuse of codeine-containing products.\n                "}
