{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_0", "document_index": 256, "latency_s": 0.677481099992292, "prompt_toks": 4649, "completion_toks": 42}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Diphenhydramine\npsychonaut_name: Diphenhydramine\npsychonaut_url: https://psychonautwiki.org/wiki/Diphenhydramine\n\n\n                    Context: \n                    This chunk provides the fundamental identification details for Diphenhydramine, including its common names, systematic name, and official URL, serving as an introductory reference within the comprehensive psychedelic profile on PsychonautWiki.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_1", "document_index": 256, "latency_s": 1.0073171999974875, "prompt_toks": 4892, "completion_toks": 100}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Diphenhydramine | Chemical Nomenclature | Common names | DPH, Benadryl, Nytol, Sominex, Unisom SleepMelts, ZzzQuil | Substitutive name | Diphenhydramine | Systematic name | 2-(diphenylmethoxy)-N,N-dimethylethanamine | Class Membership | Psychoactive class | Deliriant | Chemical class | Ethanolamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 40-60% | Threshold | 25 mg | Light | 100 - 200 mg | Common | 200 - 400 mg | Strong | 400 - 700 mg | Heavy | 700 mg + | Duration | Total | 3 - 10 hours | Onset | 30 - 90 minutes | Come up | 45 - 90 minutes | Peak | 1 - 4 hours | Offset | 2 - 6 hours | After effects | up to 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be\n\n\n                    Context: \n                    This chunk is a structured infobox providing key pharmacological and usage data about diphenhydramine, including its chemical names, psychoactive classification as a deliriant, routes of administration, dosage ranges, and duration of effects. It serves as a quick reference summary within the comprehensive webpage detailing diphenhydramine’s physical, cognitive, visual, and auditory effects, as well as safety considerations. This section is essential for quick retrieval of essential technical and safety information about the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_2", "document_index": 256, "latency_s": 0.8997410000010859, "prompt_toks": 4663, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    hours | After effects | up to 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\n\n\n                    Context: \n                    This chunk provides details on the duration of aftereffects of Diphenhydramine use, indicating they can last up to 24 hours. It also includes a disclaimer emphasizing that dosage information is user-gathered, for educational purposes, and not a medical recommendation, highlighting the importance of responsible use. This information is relevant for understanding the substance's effects and safety considerations within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_3", "document_index": 256, "latency_s": 0.8448768999951426, "prompt_toks": 4652, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines key sections of the Diphenhydramine webpage, including summaries of its chemistry, pharmacology, subjective effects, toxicity, legal status, and references, serving as an organized overview of essential informational categories for users seeking detailed data on the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_4", "document_index": 256, "latency_s": 0.6462577000056626, "prompt_toks": 4809, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation - Diphenhydramine produces considerable sedation and low doses are commonly used as a sleep aid. This sense of sedation is accompanied by a heavy body load which can become overwhelmingly uncomfortable. However, higher doses of diphenhydramine also have a stimulating quality that can make actual rest difficult. Spontaneous bodily sensations - Users commonly report all-encompassing, sharp and painful jolts of electricity that spontaneously manifest themselves uncontrollably in a similar rhythm to hiccups. Perception of bodily heaviness - One of the most apparent effects is having a massive body as if the gravity has been multiplied tenfold. This makes it extremely tough and uncomfortable to move. Restless leg syndrome - Restless legs are very prominent and arguably one of the most uncomfortable side effects of diphenhydramine. It can also last for days after the experience and can even be chronic when it is abused repeatedly. Tactile enhancement - This\n\n\n                    Context: \n                    This excerpt summarizes the physical effects of diphenhydramine, including sedation, bodily sensations, heaviness, restless leg syndrome, and tactile changes, which are key aspects of its psychoactive profile detailed within the comprehensive document on its subjective and physiological impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_5", "document_index": 256, "latency_s": 0.8800096999912057, "prompt_toks": 4827, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    arguably one of the most uncomfortable side effects of diphenhydramine. It can also last for days after the experience and can even be chronic when it is abused repeatedly. Tactile enhancement - This results in increased feelings of touch, pain, warmth and orgasms. It is usually only present at the peak and not during the come up or come down. Tactile suppression - Diphenhydramine produces feelings of numbness throughout the body. This is attributed to its ability to block sodium channels within the nerves. [10] Tactile hallucination - This is often a direct result of visual hallucinations and they commonly feel and look as if insects are crawling on one's skin. Nausea or Nausea suppression - Depending on the dose, diphenhydramine can both suppress and cause nausea. Low doses effectively suppress nausea, which is why it is marketed and sold as a motion sickness suppressant, while high doses cause it in significant amounts. Abnormal heartbeat - Diphenhydramine is able to prolong the QT\n\n\n                    Context: \n                    This excerpt details various physical effects and side effects of diphenhydramine, including tactile sensations, nausea, and cardiac risks. It highlights the drug's impact on bodily sensations and potential health hazards, relevant for understanding its pharmacology and risks discussed in the full document. These effects are critical for evaluating diphenhydramine's physical and toxicological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_6", "document_index": 256, "latency_s": 0.9480927999975393, "prompt_toks": 4816, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    nausea, which is why it is marketed and sold as a motion sickness suppressant, while high doses cause it in significant amounts. Abnormal heartbeat - Diphenhydramine is able to prolong the QT interval, potentially leading to torsades de pointes, an abnormal heart rhythm that can cause sudden cardiac death. [11] Cough suppression [12] Dehydration [ citation needed ] - Diphenhydramine can be extremely dehydrating, which often leads to dry mouth and skin, chapped lips and nose bleeds. Users should drink plenty of water before and after an experience. Dizziness Frequent urination & Difficulty urinating - Diphenhydramine has the strange effect of making the user want to frequently urinate while making actual urination extremely difficult. This sensation is described as very uncomfortable. Gustatory hallucination - A foul metallic-like taste is present throughout the entire experience, which in combination with a dry mouth can be a very uncomfortable effect that can last for days after the\n\n\n                    Context: \n                    This excerpt details the physical toxicity and adverse health effects associated with diphenhydramine use, including cardiovascular risks like abnormal heartbeat and prolonged QT interval, as well as dehydration, gastrointestinal and urinary issues, and unpleasant sensory effects such as metallic taste and dry mouth. It highlights key physiological dangers relevant to understanding the safety profile within the broader discussion of diphenhydramine's effects and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_7", "document_index": 256, "latency_s": 1.195155599998543, "prompt_toks": 4806, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    hallucination - A foul metallic-like taste is present throughout the entire experience, which in combination with a dry mouth can be a very uncomfortable effect that can last for days after the experience. Eating or drinking flavored drinks will only make the taste go away temporarily. It can also appear as a sign of addiction, where it acts as a trigger for cravings. Hypotension [13] Increased heart rate [14] Increased bodily temperature Temperature regulation suppression - This effect can lead the user to experience shivers, especially during the come up phase. Increased perspiration Motor control loss Muscle cramps & Muscle spasms - Sudden muscle cramps and spasms can form unexpectedly. This is common at the beginning of the trip and usually passes quickly. Olfactory hallucination - It is common for users to smell a mild, thick and dull smell in the air that can easily be ignored most of the time. Some users also notice a smell enhancement [ citation needed ] Physical fatigue Pupil\n\n\n                    Context: \n                    This excerpt details various physical and sensory hallucinations associated with diphenhydramine, including metallic taste, dry mouth, hypotension, increased heart rate, temperature regulation issues, muscle spasms, and olfactory hallucinations. It highlights common sensations experienced during intoxication, emphasizing adverse effects like discomfort and dysregulation, and is relevant for understanding diphenhydramine's toxic and perceptual effects within the full psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_8", "document_index": 256, "latency_s": 0.6141858000046341, "prompt_toks": 4783, "completion_toks": 57}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    is common for users to smell a mild, thick and dull smell in the air that can easily be ignored most of the time. Some users also notice a smell enhancement [ citation needed ] Physical fatigue Pupil constriction or Pupil dilation - While it is known that diphenhydramine constricts pupils minimally [15] , many people also report that their pupils dilate, especially at high dosages when anti-cholinergic effects take place similar to substances like atropine or scopolamine . Rapid breathing Skin flushing - Flushed skin occurs mostly around the eyes, but can also be seen all over the body. Temporary erectile dysfunction Itchiness - This effect happens in high doses, however, it reduces itchiness in lower doses due to histamine antagonism.. Teeth grinding - Some users report jaw clenching. [ citation needed ]\n\n\n                    Context: \n                    This chunk details various physical effects of diphenhydramine, including sensory sensations like smell, pupil reactions, skin flushing, sexual function, and common side effects such as itchiness and teeth grinding, providing specific insights into its physiological impact discussed within the broader section on physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_9", "document_index": 256, "latency_s": 1.271671000009519, "prompt_toks": 4802, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - Diphenhydramine produces considerable sedation and low doses are commonly used as a sleep aid. This sense of sedation is accompanied by a heavy body load which can become overwhelmingly uncomfortable. However, higher doses of diphenhydramine also have a stimulating quality that can make actual rest difficult.\n- Spontaneous bodily sensations - Users commonly report all-encompassing, sharp and painful jolts of electricity that spontaneously manifest themselves uncontrollably in a similar rhythm to hiccups.\n- Perception of bodily heaviness - One of the most apparent effects is having a massive body as if the gravity has been multiplied tenfold. This makes it extremely tough and uncomfortable to move.\n- Restless leg syndrome - Restless legs are very prominent and arguably one of the most uncomfortable side effects of diphenhydramine. It can also last for days after the experience and can even be chronic when it is abused repeatedly.\n\n\n                    Context: \n                    This section details physical and tactile effects of diphenhydramine, including sedation, spontaneous sensations, perceived heaviness, and restless leg syndrome. These effects are critical for understanding its physical impact profile, especially at varying dosages, and are relevant for assessing its safety and side effects within the broader discussion of its psychoactive properties.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_10", "document_index": 256, "latency_s": 0.8034315999975661, "prompt_toks": 4827, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Tactile enhancement - This results in increased feelings of touch, pain, warmth and orgasms. It is usually only present at the peak and not during the come up or come down.\n- Tactile suppression - Diphenhydramine produces feelings of numbness throughout the body. This is attributed to its ability to block sodium channels within the nerves. [10]\n- Tactile hallucination - This is often a direct result of visual hallucinations and they commonly feel and look as if insects are crawling on one's skin.\n- Nausea or Nausea suppression - Depending on the dose, diphenhydramine can both suppress and cause nausea. Low doses effectively suppress nausea, which is why it is marketed and sold as a motion sickness suppressant, while high doses cause it in significant amounts.\n- Abnormal heartbeat - Diphenhydramine is able to prolong the QT interval, potentially leading to torsades de pointes, an abnormal heart rhythm that can cause sudden cardiac death. [11]\n- Cough suppression [12]\n\n\n                    Context: \n                    This section details the physical and physiological effects of diphenhydramine, including tactile sensations such as enhancement, suppression, and hallucinations, as well as side effects like nausea, abnormal heartbeat, and cough suppression. It highlights the drug's impact on bodily sensations and cardiovascular safety, making it essential for understanding its physical dangers and absorption characteristics within the broader discussion of its effects and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_11", "document_index": 256, "latency_s": 1.3765717999922344, "prompt_toks": 4808, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cough suppression [12]\n- Dehydration [ citation needed ] - Diphenhydramine can be extremely dehydrating, which often leads to dry mouth and skin, chapped lips and nose bleeds. Users should drink plenty of water before and after an experience.\n- Dizziness\n- Frequent urination & Difficulty urinating - Diphenhydramine has the strange effect of making the user want to frequently urinate while making actual urination extremely difficult. This sensation is described as very uncomfortable.\n- Gustatory hallucination - A foul metallic-like taste is present throughout the entire experience, which in combination with a dry mouth can be a very uncomfortable effect that can last for days after the experience. Eating or drinking flavored drinks will only make the taste go away temporarily. It can also appear as a sign of addiction, where it acts as a trigger for cravings.\n- Hypotension [13]\n- Increased heart rate [14]\n- Increased bodily temperature\n\n\n                    Context: \n                    This excerpt lists some common physical side effects and physiological interactions of diphenhydramine, including cough suppression, dehydration, dizziness, urinary issues, metallic taste, hypotension, increased heart rate, and elevated body temperature. These details are crucial for understanding the drug's physical impact and safety considerations discussed in the broader document on its effects and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_12", "document_index": 256, "latency_s": 1.276822700005141, "prompt_toks": 4816, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Hypotension [13]\n- Increased heart rate [14]\n- Increased bodily temperature\n- Temperature regulation suppression - This effect can lead the user to experience shivers, especially during the come up phase.\n- Increased perspiration\n- Motor control loss\n- Muscle cramps & Muscle spasms - Sudden muscle cramps and spasms can form unexpectedly. This is common at the beginning of the trip and usually passes quickly.\n- Olfactory hallucination - It is common for users to smell a mild, thick and dull smell in the air that can easily be ignored most of the time. Some users also notice a smell enhancement [ citation needed ]\n- Physical fatigue\n- Pupil constriction or Pupil dilation - While it is known that diphenhydramine constricts pupils minimally [15] , many people also report that their pupils dilate, especially at high dosages when anti-cholinergic effects take place similar to substances like atropine or scopolamine .\n- Rapid breathing\n\n\n                    Context: \n                    This chunk details the physical effects associated with diphenhydramine overdose or intense use, including cardiovascular, temperature regulation, muscular, sensory, and respiratory symptoms. It provides specific symptoms like hypotension, increased heart rate, temperature suppression, muscle spasms, olfactory hallucinations, and pupil changes, which are critical for understanding its toxicity profile and harm potential. These effects are important for identifying overdose risks and managing adverse reactions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_13", "document_index": 256, "latency_s": 0.9235277000116184, "prompt_toks": 4686, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Rapid breathing\n- Skin flushing - Flushed skin occurs mostly around the eyes, but can also be seen all over the body.\n- Temporary erectile dysfunction\n- Itchiness - This effect happens in high doses, however, it reduces itchiness in lower doses due to histamine antagonism..\n- Teeth grinding - Some users report jaw clenching. [ citation needed ]\n\n\n                    Context: \n                    This excerpt details various physical effects associated with diphenhydramine use, including respiratory, cardiovascular, and muscular responses such as rapid breathing, skin flushing, erectile dysfunction, itchiness, and teeth grinding. These effects are part of the comprehensive profile of diphenhydramine’s physical side effects outlined in the broader document, highlighting both common and high-dose reactions relevant for understanding its psychoactive and physiological impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_14", "document_index": 256, "latency_s": 0.7855108000076143, "prompt_toks": 4817, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - The head space of diphenhydramine is described by many as generally negative and dysphoric, often consisting of extreme paranoia and feelings of impending doom. It is extremely confusing and disorienting and often results in a complete inability to communicate or understand normal language. Analysis suppression - At higher dosages, a person could experience a complete halt of external information processing, which can make the user unable to perform simple tasks or make decisions. Anxiety & Paranoia - Anxiety and paranoia are more commonly reported on diphenhydramine than almost any other substance. However, there is a threshold dose (around 500mg) where it begins to disappear. Sleepiness - Diphenhydramine is reported to be extremely tiring. Low doses are often used and sold as a sleep aid. Wakefulness - Even though diphenhydramine is primarily a depressant and causes sleepiness, it has stimulant effects on the body, which can also keep the user awake. This effect\n\n\n                    Context: \n                    This segment details the cognitive and psychological effects of diphenhydramine, including its impact on mental state, paranoia, disorientation, and decision-making, as well as its contradictory sedative and stimulant properties. It contributes to the comprehensive overview of the drug's subjective mental effects within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_15", "document_index": 256, "latency_s": 0.8274024999991525, "prompt_toks": 4810, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    sold as a sleep aid. Wakefulness - Even though diphenhydramine is primarily a depressant and causes sleepiness, it has stimulant effects on the body, which can also keep the user awake. This effect predominates sleepiness at higher dosages. Dysphoria - The levels of dysphoria experienced, however, vary between people with a very small percentage of users reporting that they do not seem to experience them at all. Cognitive fatigue Confusion - Diphenhydramine causes significant confusion which can result in a complete inability to understand others' intentions, emotions, humor and even simple sentences. Creativity suppression Decreased libido - Interestingly, one's sex drive seems to have diminished, although sex and masturbation are considered more enjoyable in a unique way and often come with powerful orgasms. Delirium - Delirium may be experienced with extremely high doses which may necessitate hospitalization. Delusion Depression Derealization Disinhibition - Disinhibition on\n\n\n                    Context: \n                    This excerpt covers the psychological and cognitive effects of diphenhydramine, including sleep disturbances, wakefulness, dysphoria, confusion, reduced libido, and high-dose delirium, providing detailed insights into its mental and emotional impact within the comprehensive overview of the substance's physical and psychological properties.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_16", "document_index": 256, "latency_s": 0.8650508999999147, "prompt_toks": 4810, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    come with powerful orgasms. Delirium - Delirium may be experienced with extremely high doses which may necessitate hospitalization. Delusion Depression Derealization Disinhibition - Disinhibition on diphenhydramine is different from substances like alcohol , as it may not even be present in certain situations and is heavily influenced by anxiety and paranoia. Dream potentiation - Diphenhydramine is extremely effective at potentiating dreams. This can result in not just increased intensity but a change in dream content, leading to dreams that are both vivid and extremely bizarre. Dysarthria [ citation needed ] - Slurred speech and speaking with a different voice is common on DPH. Emotion suppression Feelings of impending doom Focus suppression Increased music appreciation Language suppression Memory suppression - Memory suppression on diphenhydramine is extremely strong. Short-term memory loss is affected in a manner similar to cannabis . Amnesia - At higher dosages, diphenhydramine\n\n\n                    Context: \n                    This excerpt details the psychological effects of diphenhydramine at high doses, including delirium, hallucinations, altered dream states, speech impairment, emotional suppression, and significant memory and cognition disruptions, highlighting its potential for intense and disorienting mental experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_17", "document_index": 256, "latency_s": 0.9907239000021946, "prompt_toks": 4749, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Memory suppression - Memory suppression on diphenhydramine is extremely strong. Short-term memory loss is affected in a manner similar to cannabis . Amnesia - At higher dosages, diphenhydramine can cause a complete halt of external information processing, which can make the user unable to perform simple tasks or make decisions. Motivation suppression - Diphenhydramine can cause a complete loss of motivation to do almost anything. This is often accompanied by depression and can make the user extremely bored and restless. Psychosis Thought deceleration Thought disorganization Time distortion - Although not extreme, time dilation is definitely felt and can be overwhelming if the user is having a difficult trip.\n\n\n                    Context: \n                    This excerpt details the cognitive and psychological effects of diphenhydramine, including strong memory suppression, amnesia at high doses, and effects on motivation such as loss of drive and emotional difficulties. It also covers additional effects like thought deceleration, disorganization, and time distortion, situating these as key mental impacts within the broader profile of diphenhydramine's psychoactive and sensory effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_18", "document_index": 256, "latency_s": 0.8348811000032583, "prompt_toks": 4811, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis suppression - At higher dosages, a person could experience a complete halt of external information processing, which can make the user unable to perform simple tasks or make decisions.\n- Anxiety & Paranoia - Anxiety and paranoia are more commonly reported on diphenhydramine than almost any other substance. However, there is a threshold dose (around 500mg) where it begins to disappear.\n- Sleepiness - Diphenhydramine is reported to be extremely tiring. Low doses are often used and sold as a sleep aid.\n- Wakefulness - Even though diphenhydramine is primarily a depressant and causes sleepiness, it has stimulant effects on the body, which can also keep the user awake. This effect predominates sleepiness at higher dosages.\n- Dysphoria - The levels of dysphoria experienced, however, vary between people with a very small percentage of users reporting that they do not seem to experience them at all.\n- Cognitive fatigue\n\n\n                    Context: \n                    This excerpt summarizes key cognitive and psychological effects of diphenhydramine, including analysis suppression at high doses, prevalent anxiety and paranoia, its sedative properties used for sleep, and paradoxical stimulant effects that can promote wakefulness at higher doses. These details are essential for understanding the drug’s complex mental state influences within the full profile of diphenhydramine’s physical and subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_19", "document_index": 256, "latency_s": 0.9329602999932831, "prompt_toks": 4801, "completion_toks": 101}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Dysphoria - The levels of dysphoria experienced, however, vary between people with a very small percentage of users reporting that they do not seem to experience them at all.\n- Cognitive fatigue\n- Confusion - Diphenhydramine causes significant confusion which can result in a complete inability to understand others' intentions, emotions, humor and even simple sentences.\n- Creativity suppression\n- Decreased libido - Interestingly, one's sex drive seems to have diminished, although sex and masturbation are considered more enjoyable in a unique way and often come with powerful orgasms.\n- Delirium - Delirium may be experienced with extremely high doses which may necessitate hospitalization.\n- Delusion\n- Depression\n- Derealization\n- Disinhibition - Disinhibition on diphenhydramine is different from substances like alcohol , as it may not even be present in certain situations and is heavily influenced by anxiety and paranoia.\n\n\n                    Context: \n                    This excerpt summarizes key cognitive and psychological effects of diphenhydramine, including dysphoria, confusion, delirium, delusion, depression, derealization, and disinhibition, highlighting variations in user experiences and severity at high doses. It provides detailed descriptions of mental states that can occur during intoxication, emphasizing the drug's potential to cause significant disorientation and mood disturbances. This information is relevant for understanding the psychoactive profile and risks associated with diphenhydramine use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_20", "document_index": 256, "latency_s": 0.9202682000031928, "prompt_toks": 4814, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Disinhibition - Disinhibition on diphenhydramine is different from substances like alcohol , as it may not even be present in certain situations and is heavily influenced by anxiety and paranoia.\n- Dream potentiation - Diphenhydramine is extremely effective at potentiating dreams. This can result in not just increased intensity but a change in dream content, leading to dreams that are both vivid and extremely bizarre.\n- Dysarthria [ citation needed ] - Slurred speech and speaking with a different voice is common on DPH.\n- Emotion suppression\n- Feelings of impending doom\n- Focus suppression\n- Increased music appreciation\n- Language suppression\n- Memory suppression - Memory suppression on diphenhydramine is extremely strong. Short-term memory loss is affected in a manner similar to cannabis . Amnesia - At higher dosages, diphenhydramine can cause a complete halt of external information processing, which can make the user unable to perform simple tasks or make decisions.\n\n\n                    Context: \n                    This chunk summarizes key cognitive and psychological effects of diphenhydramine, including disinhibition, dream potentiation, speech impairment, emotion and memory suppression, and feelings of impending doom. These effects are integral to understanding diphenhydramine's mental impact and are consistent with its classification as a deliriant psychoactive substance detailed throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_21", "document_index": 256, "latency_s": 0.8972431000001961, "prompt_toks": 4737, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Amnesia - At higher dosages, diphenhydramine can cause a complete halt of external information processing, which can make the user unable to perform simple tasks or make decisions.\n- Motivation suppression - Diphenhydramine can cause a complete loss of motivation to do almost anything. This is often accompanied by depression and can make the user extremely bored and restless.\n- Psychosis\n- Thought deceleration\n- Thought disorganization\n- Time distortion - Although not extreme, time dilation is definitely felt and can be overwhelming if the user is having a difficult trip.\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This section summarizes the cognitive and psychological effects of high doses of diphenhydramine, including amnesia, motivation loss, psychosis, thought disorganization, and time distortion. These effects are critical for understanding potential risks and mental impacts, situating them within the broader discussion of diphenhydramine’s physical and subjective effects detailed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_22", "document_index": 256, "latency_s": 0.8742829000111669, "prompt_toks": 4803, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - While diphenhydramine produces visual hallucinations, it does not enhance visual stimuli in the manner of psychedelics . Instead, it tends to degrade and decrease visual acuity and processing that results in increased hallucinations and degraded vision. This becomes more apparent in darker areas than in well-lit ones. Suppression Double vision - This effect is commonly present at moderate to high doses. Pattern recognition suppression Visual acuity suppression - This effect can result in blurry vision to the point of blindness. It sometimes can last for days after the experience itself. Distortions Drifting ( melting , breathing , morphing and flowing ) - Compared to hallucinogens, this effect can be described as intricate in complexity, jittery and flexible in motion, static in their permanence, realistic in believability, and interactive in plasticity. It is also very faint. Object alteration - The textures seen are described as transparent whirling lines and\n\n\n                    Context: \n                    This excerpt elaborates on the visual effects of diphenhydramine, detailing its tendency to degrade visual acuity, produce various distortions, and cause hallucinations without enhancing visual stimuli like psychedelics. It highlights phenomena such as double vision, pattern suppression, drifting imagery, and object alteration, providing specific insights into its visual hallucination profile relevant to the full pharmacological and experiential overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_23", "document_index": 256, "latency_s": 0.8379967999935616, "prompt_toks": 4804, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    static in their permanence, realistic in believability, and interactive in plasticity. It is also very faint. Object alteration - The textures seen are described as transparent whirling lines and swirls which move at changing speeds and jitter uncontrollably. They only appear slightly above surfaces, walls and ceilings and can not be felt. Brightness alteration - Diphenhydramine can cause one's vision to decrease in brightness and become dark and gloomy. Visual haze Hallucinatory states External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - Relative to other hallucinogens , this effect occurs more frequently at moderate to heavy doses and is the defining feature of the experience. It can be comprehensively described through its variations as delirious in believability, controllable or autonomous in controllability and solid in style. The most common themes for these hallucinations include those of\n\n\n                    Context: \n                    This excerpt details visual hallucinations induced by diphenhydramine, including effects like object alteration, brightness reduction, visual haze, and external hallucinations. It emphasizes that these visual effects are more common at moderate to heavy doses and form a key aspect of the drug's psychedelic profile, aligning with the document’s comprehensive description of its sensory and perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_24", "document_index": 256, "latency_s": 0.9306312999979127, "prompt_toks": 4788, "completion_toks": 98}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    described through its variations as delirious in believability, controllable or autonomous in controllability and solid in style. The most common themes for these hallucinations include those of both everyday occurrences such as smoking phantom cigarettes, talking to people who are not there, seeing and feeling insects and immersion in sinister or nightmarish experiences. Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - Relative to other hallucinogens , this effect occurs briefly and spontaneously at moderate doses but becomes progressively extended in its occurrence and duration proportional to dosage before eventually becoming all-encompassing. It can be comprehensively described through its variations as delirious in believability, interactive in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style. Internal hallucinations may occur\n\n\n                    Context: \n                    This excerpt details the nature of internal hallucinations induced by diphenhydramine, emphasizing their brief and spontaneous onset at moderate doses and their progression to all-encompassing experiences with increased dosage. It highlights how these hallucinations are characterized by themes like phantom cigarettes and nightmarish scenarios, and describes their variations in believability, controllability, and style, making it relevant to the document's comprehensive analysis of diphenhydramine's visual and perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_25", "document_index": 256, "latency_s": 0.9387338999949861, "prompt_toks": 4681, "completion_toks": 91}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    as delirious in believability, interactive in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style. Internal hallucinations may occur at lighter dosages than needed to cause external hallucinations and delirium . Peripheral information misinterpretation Shadow people Transformations Unspeakable horrors Object activation\n\n\n                    Context: \n                    This excerpt describes the characteristics of diphenhydramine-induced visual hallucinations, highlighting their delirious believability, interactivity, and variations in occurrence at different dosages. It details phenomena such as internal hallucinations, peripheral misinterpretations, shadow figures, transformations, and object activation, emphasizing the intense and immersive nature of the drug's visual effects. These details are relevant for understanding the drug's psychoactive visual spectrum and potential risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_26", "document_index": 256, "latency_s": 0.8576238000096055, "prompt_toks": 4796, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Double vision - This effect is commonly present at moderate to high doses.\n- Pattern recognition suppression\n- Visual acuity suppression - This effect can result in blurry vision to the point of blindness. It sometimes can last for days after the experience itself.\n- Drifting ( melting , breathing , morphing and flowing ) - Compared to hallucinogens, this effect can be described as intricate in complexity, jittery and flexible in motion, static in their permanence, realistic in believability, and interactive in plasticity. It is also very faint.\n- Object alteration - The textures seen are described as transparent whirling lines and swirls which move at changing speeds and jitter uncontrollably. They only appear slightly above surfaces, walls and ceilings and can not be felt.\n- Brightness alteration - Diphenhydramine can cause one's vision to decrease in brightness and become dark and gloomy.\n- Visual haze\n\n\n                    Context: \n                    This section summarizes key visual effects of diphenhydramine, including double vision, pattern recognition suppression, visual acuity loss, drifting imagery, object alteration, brightness reduction, and visual haze. These effects are characteristic of its hallucinogenic and sensory distortion profile, highlighting potential risks and perceptual changes associated with high doses. The details are essential for understanding its visual hallucination mechanisms described in the broader document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_27", "document_index": 256, "latency_s": 1.192743799998425, "prompt_toks": 4766, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Brightness alteration - Diphenhydramine can cause one's vision to decrease in brightness and become dark and gloomy.\n- Visual haze\n- External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - Relative to other hallucinogens , this effect occurs more frequently at moderate to heavy doses and is the defining feature of the experience. It can be comprehensively described through its variations as delirious in believability, controllable or autonomous in controllability and solid in style. The most common themes for these hallucinations include those of both everyday occurrences such as smoking phantom cigarettes, talking to people who are not there, seeing and feeling insects and immersion in sinister or nightmarish experiences.\n\n\n                    Context: \n                    This chunk details the visual effects of diphenhydramine, highlighting brightness alteration, visual haze, and external hallucinations. It emphasizes the prevalence and characteristics of hallucinations at moderate to heavy doses, including themes like phantom images and nightmarish scenarios. These effects are key aspects of diphenhydramine's psychoactive profile within the overall document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_28", "document_index": 256, "latency_s": 1.1613778000028105, "prompt_toks": 4761, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - Relative to other hallucinogens , this effect occurs briefly and spontaneously at moderate doses but becomes progressively extended in its occurrence and duration proportional to dosage before eventually becoming all-encompassing. It can be comprehensively described through its variations as delirious in believability, interactive in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style. Internal hallucinations may occur at lighter dosages than needed to cause external hallucinations and delirium .\n- Peripheral information misinterpretation\n- Shadow people\n- Transformations\n- Unspeakable horrors\n- Object activation\n\n\n                    Context: \n                    This section details the visual hallucination effects of diphenhydramine, focusing on internal hallucinations involving autonomous entities, landscapes, and scenarios that occur spontaneously and vary with dosage. It also describes related perceptual phenomena such as peripheral information misinterpretation, shadow people, transformations, horrors, and object activation, providing insights into the drug's complex visual distortions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_29", "document_index": 256, "latency_s": 0.8504518999980064, "prompt_toks": 4814, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Peripheral information misinterpretation\n- Shadow people\n- Transformations\n- Unspeakable horrors\n- Object activation\nAuditory effects: - Auditory hallucinations - Auditory hallucinations like voices and screams are commonly reported on diphenhydramine. Auditory suppression Auditory enhancement\n- Auditory hallucinations - Auditory hallucinations like voices and screams are commonly reported on diphenhydramine.\n- Auditory suppression\n- Auditory enhancement\nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: - Anxiety Brightness alteration Cognitive fatigue Dehydration Depression Gustatory hallucination Irritability Motivation suppression Physical fatigue Sleepiness Thought deceleration Visual acuity suppression\n- Anxiety\n- Brightness alteration\n- Cognitive fatigue\n- Dehydration\n- Depression\n- Gustatory hallucination\n- Irritability\n- Motivation suppression\n- Physical fatigue\n- Sleepiness\n- Thought deceleration\n- Visual acuity suppression\n\n\n                    Context: \n                    This excerpt details diphenhydramine's sensory effects, including peripheral misinterpretations, hallucinations (visual, auditory, and multisensory), and after effects such as anxiety, fatigue, dehydration, and mood changes, providing an overview of the compound's complex perceptual and emotional impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 27, "doc_id": "doc_256", "num_chunks": 31, "chunk_id": "256::chunk_30", "document_index": 256, "latency_s": 0.8652357999962987, "prompt_toks": 4685, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive fatigue\n- Dehydration\n- Depression\n- Gustatory hallucination\n- Irritability\n- Motivation suppression\n- Physical fatigue\n- Sleepiness\n- Thought deceleration\n- Visual acuity suppression\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt summarizes the after-effects and miscellaneous sections of the full diphenhydramine report, including cognitive fatigue, dehydration, depression, hallucinations, irritability, motivation suppression, physical fatigue, sleepiness, and visual impairments, along with placeholders for reagent results, preparation methods, research, legal issues, paradoxical effects, and other considerations relevant to its psychoactive profile.\n                "}
