{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_0", "document_index": 259, "latency_s": 0.7768197000114014, "prompt_toks": 1879, "completion_toks": 49}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Flubromazepam\npsychonaut_name: Flubromazepam\npsychonaut_url: https://psychonautwiki.org/wiki/Flubromazepam\nInfobox: Flubromazepam | Chemical Nomenclature | Common names | Flubromazepam | Systematic name | 7-Bromo-5-(2-fluorophenyl)-1,3-dihydro-1,4-benzodiazepin-2-one | Class Membership | Psychoactive class | Depressant | Chemical class | Benzodiazepine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 2 mg | Light | 3 - 5 mg | Common | 5 - 8 mg | Strong | 8 - 12 mg | Heavy | 12 - 16 mg + | Duration | Total | 6 - 12 hours | Onset | 40 - 90 minutes | After effects | 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\nSummary:\n\n\n                    Context: \n                    This section contains the detailed infobox and introductory details for Flubromazepam, including chemical nomenclature, dosing information, routes of administration, and legal disclaimers, serving as an overview within the full psychoactive substance profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_1", "document_index": 259, "latency_s": 0.8665168000006815, "prompt_toks": 1644, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This section provides an overview of key topics covered in the full webpage on Flubromazepam, including its chemistry, pharmacology, subjective effects, toxicity, legal status, and references, serving as a navigational summary for understanding the substance's properties and effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_2", "document_index": 259, "latency_s": 0.7335504999937257, "prompt_toks": 1793, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Pharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences: \nPhysical effects: - Sedation -  In terms of energy level alterations, this substance has the potential to become very sedating in a rapid-acting fashion. At higher doses, this can lead users to suddenly feel as if they are extremely sleep deprived and have not slept for days, forcing them to sit down and generally feel as if they are constantly on the verge of passing out. This sense of sleep deprivation increases proportional to dosage and eventually becomes powerful enough to force a person into complete unconsciousness. Muscle relaxation Physical euphoria Motor control loss Respiratory depression Increased libido Seizure suppression [ citation needed ] Appetite enhancement - This effect is not particularly prominent, but is reported to occur in some people. It can have a synergistic effect when combined with cannabis . Dizziness Temporary erectile dysfunction\n\n\n                    Context: \n                    This excerpt covers the physical effects and pharmacological profile of Flubromazepam, highlighting its sedative properties, muscle relaxation, and potential risks such as respiratory depression and sexual dysfunction. It provides essential details on dosage-related sedation and side effects, serving as a foundational section within the broader discussion of its effects, toxicity, and legal considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_3", "document_index": 259, "latency_s": 1.0708655000053113, "prompt_toks": 1773, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation -  In terms of energy level alterations, this substance has the potential to become very sedating in a rapid-acting fashion. At higher doses, this can lead users to suddenly feel as if they are extremely sleep deprived and have not slept for days, forcing them to sit down and generally feel as if they are constantly on the verge of passing out. This sense of sleep deprivation increases proportional to dosage and eventually becomes powerful enough to force a person into complete unconsciousness.\n- Muscle relaxation\n- Physical euphoria\n- Motor control loss\n- Respiratory depression\n- Increased libido\n- Seizure suppression [ citation needed ]\n- Appetite enhancement - This effect is not particularly prominent, but is reported to occur in some people. It can have a synergistic effect when combined with cannabis .\n- Dizziness\n- Temporary erectile dysfunction\n\n\n                    Context: \n                    This section summarizes the physical effects of Flubromazepam, highlighting its sedative properties, muscle relaxation, euphoria, motor control loss, respiratory depression, increased libido, and other physiological side effects. It is part of the detailed effects profile within the comprehensive document on the substance's subjective, physical, cognitive, and after-effects, providing key information for understanding its potency and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_4", "document_index": 259, "latency_s": 0.8402883999951882, "prompt_toks": 1796, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - Anxiety suppression Disinhibition Cognitive euphoria - This effect is generally produced only at high doses, and is thought to arise largely from the release of pre-existing anxiety in the user. Many users report not feeling any pleasurable or euphoric sensations from benzodiazepines at all. Compulsive redosing - This component is likely due to the rapid way in which the substance produces its anxiety-relieving, relaxing and sometimes euphoric effects before quickly dropping off. It can be made worse due to the memory suppression it produces which can lead the user forgetting they have taken any at all, which can lead to a cycle that leads to a dangerous amnesic blackout state. Memory suppression Amnesia Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at high to heavy dosages. Analysis\n\n\n                    Context: \n                    This section details the cognitive and psychological effects of Flubromazepam, including anxiety suppression, disinhibition, cognitive euphoria at high doses, compulsive redosing due to rapid onset and memory suppression, and delusions of sobriety at heavy dosages, highlighting potential risks associated with its use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_5", "document_index": 259, "latency_s": 0.6932715000002645, "prompt_toks": 1685, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at high to heavy dosages. Analysis suppression Ego inflation Thought deceleration Motivation suppression Emotionality suppression - Although this compound primarily suppresses anxiety, it also dulls other emotions in a manner which is distinct but less intensive than that of antipsychotics . Sleepiness\n\n\n                    Context: \n                    This excerpt discusses high-dose effects of Flubromazepam, including delusions of sobriety—where users mistakenly believe they are sober despite impairment—and various emotional and cognitive suppressions such as analysis suppression, ego inflation, and motivation suppression. It highlights the compound's tendency to dull emotions and induce sleepiness, emphasizing potential risks associated with heavy use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_6", "document_index": 259, "latency_s": 0.7180828999989899, "prompt_toks": 1803, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety suppression\n- Disinhibition\n- Cognitive euphoria - This effect is generally produced only at high doses, and is thought to arise largely from the release of pre-existing anxiety in the user. Many users report not feeling any pleasurable or euphoric sensations from benzodiazepines at all.\n- Compulsive redosing - This component is likely due to the rapid way in which the substance produces its anxiety-relieving, relaxing and sometimes euphoric effects before quickly dropping off. It can be made worse due to the memory suppression it produces which can lead the user forgetting they have taken any at all, which can lead to a cycle that leads to a dangerous amnesic blackout state.\n- Memory suppression Amnesia\n- Amnesia\n- Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at high to heavy dosages.\n\n\n                    Context: \n                    This excerpt details the cognitive and psychological effects of Flubromazepam, including anxiety suppression, disinhibition, high-dose euphoria, and tendencies for compulsive redosing and memory impairment, as well as rare paradoxical reactions such as delusions of sobriety. It is part of the broader discussion on the drug’s subjective effects and potential risks outlined in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_7", "document_index": 259, "latency_s": 0.916475599995465, "prompt_toks": 1785, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis suppression\n- Ego inflation\n- Thought deceleration\n- Motivation suppression\n- Emotionality suppression - Although this compound primarily suppresses anxiety, it also dulls other emotions in a manner which is distinct but less intensive than that of antipsychotics .\n- Sleepiness\nHistory and culture: \nLiterature: \nVisual effects: \nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: - Rebound anxiety - Rebound anxiety is a commonly observed effect with anxiety relieving substances like benzodiazepines . It typically corresponds to the total duration spent under the substance's influence along with the total amount consumed in a given period, an effect which can easily lend itself to cycles of dependence and addiction. Dream potentiation or Dream suppression Residual sleepiness Thought deceleration Thought disorganization Irritability\n\n\n                    Context: \n                    This excerpt details the cognitive and after-effects of Flubromazepam, highlighting effects such as analysis suppression, ego inflation, thought deceleration, motivation and emotionality suppression, and sleepiness. It is relevant to understanding the drug’s psychological impact and potential rebound effects like rebound anxiety, which are key for assessing its risks and user experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_8", "document_index": 259, "latency_s": 0.7106970000022557, "prompt_toks": 1714, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Rebound anxiety - Rebound anxiety is a commonly observed effect with anxiety relieving substances like benzodiazepines . It typically corresponds to the total duration spent under the substance's influence along with the total amount consumed in a given period, an effect which can easily lend itself to cycles of dependence and addiction.\n- Dream potentiation or Dream suppression\n- Residual sleepiness\n- Thought deceleration\n- Thought disorganization\n- Irritability\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues:\n\n\n                    Context: \n                    This section summarizes after-effects associated with Flubromazepam, highlighting rebound anxiety, changes in dream states, residual sleepiness, cognitive slowing, disorganization, and irritability. It relates to the broader discussion of Flubromazepam's subjective and after effects, providing key details on potential withdrawal and post-use symptoms important for understanding its psychoactive profile and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 30, "doc_id": "doc_259", "num_chunks": 10, "chunk_id": "259::chunk_9", "document_index": 259, "latency_s": 0.7067181000020355, "prompt_toks": 1751, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Residual sleepiness\n- Thought deceleration\n- Thought disorganization\n- Irritability\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: - Paradoxical reactions to benzodiazepines such as increased seizures (in epileptics), aggression, increased anxiety, violent behavior, loss of impulse control, irritability and suicidal behavior sometimes occur (although they are rare in the general population, with an incidence rate below 1%). [7] [8] These paradoxical effects occur with greater frequency in recreational abusers, individuals with mental disorders, children, and patients on high-dosage regimes. [9] [10]\nOther:\n\n\n                    Context: \n                    This chunk details the after-effects and paradoxical reactions associated with Flubromazepam, including residual sleepiness, cognitive disturbances, irritability, and rare adverse reactions such as increased seizures and aggression, highlighting potential risks with high doses or misuse. It provides critical information for understanding the drug's safety profile and side effects within the comprehensive overview.\n                "}
