{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_0", "document_index": 260, "latency_s": 0.7423797000083141, "prompt_toks": 1735, "completion_toks": 39}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Gabapentin\npsychonaut_name: Gabapentin\npsychonaut_url: https://psychonautwiki.org/wiki/Gabapentin\n\n\n                    Context: \n                    This chunk provides the basic identification details for Gabapentin, including its name and URL, serving as an introductory reference within the comprehensive webpage content that covers its pharmacology, effects, and usage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_1", "document_index": 260, "latency_s": 0.6123921999969753, "prompt_toks": 1969, "completion_toks": 50}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Gabapentin | Chemical Nomenclature | Common names | Gabapentin, Neurontin, Gabarone, Gralise | Substitutive name | Gabapentin | Systematic name | 1-(Aminomethyl)cyclohexaneacetic acid | Class Membership | Psychoactive class | Depressant | Chemical class | Gabapentinoid | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 27% - 60% | [2] | Threshold | 200 mg | Light | 200 - 900 mg | Common | 900 - 1500 mg | Strong | 1500 - 2400 mg | Heavy | 2400 mg + | Duration | Total | 6 - 10 hours | Onset | 30 - 120 minutes | Peak | 120 - 180 minutes | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\nSummary: \nContents: \nChemistry:\n\n\n                    Context: \n                    This infobox provides a concise overview of gabapentin's chemical properties, common names, dosage information, routes of administration, and safety warnings, serving as a quick reference within the larger detailed article on its pharmacology, effects, and legal status.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_2", "document_index": 260, "latency_s": 0.5064719000074547, "prompt_toks": 1747, "completion_toks": 50}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the key sections of the comprehensive analysis of gabapentin found in the full document, including its chemistry, pharmacology, subjective effects, toxicity, legal status, and references, serving as an overview of the drug's properties and effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_3", "document_index": 260, "latency_s": 0.8539203999971505, "prompt_toks": 1920, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation - Gabapentin is typically mildly sedating and can produce a lethargic state. At higher doses, it may lead to a moderately sedated state. Appetite enhancement - Appetite enhancement is not particularly prominent, but is sometimes reported. It can have a synergistic effect when combined with cannabis . Muscle relaxation - Muscle relaxation is present on gabapentin, although not to the extent of benzodiazepines , barbiturates , or GHB . Physical euphoria - Gabapentin is capable of producing weak to moderate states of physical euphoria in some users. However, it is very inconsistent compared to other depressants (e.g. benzodiazepines , opioids , and GHB ) and tolerance builds rapidly. As a result, it is considered to be a poor euphoriant. Decreased libido - Many users note a marked decrease in their sex drive when taking gabapentin. This can happen when it is taken both recreationally or as prescribed. Perception of bodily lightness - Some users report feeling\n\n\n                    Context: \n                    This excerpt summarizes the physical effects of gabapentin, including sedation, muscle relaxation, mild euphoria, appetite changes, decreased libido, and altered perception of bodily lightness. It provides key details on its depressant properties and side effects, situating within the broader discussion of its pharmacology, physical, and subjective effects on the full webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_4", "document_index": 260, "latency_s": 0.7528808999923058, "prompt_toks": 1899, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    note a marked decrease in their sex drive when taking gabapentin. This can happen when it is taken both recreationally or as prescribed. Perception of bodily lightness - Some users report feeling lighter at very high doses. Dizziness - Dizziness is prevalent at higher doses, although many users report that it is not necessarily distressing. However, users should be careful not to slip and fall when walking down slopes or stairs. Seizure suppression [ citation needed ] - Gabapentin is commonly used as an anticonvulsant. It is often combined with other anticonvulsants when used to treat epilepsy and other seizure disorders. Pain relief - Gabapentin is used to control pain, particularly fibromyalgic/neuropathic pain (nerve pain) and restless leg syndrome . [ citation needed ] It is generally considered to be not very effective for the management of acute pain, unlike opiates . Muscle twitching Motor control loss\n\n\n                    Context: \n                    This chunk summarizes key physical and therapeutic effects of gabapentin, including its impact on libido, perception, dizziness, seizure control, and pain management, highlighting its sedative, anticonvulsant, and analgesic properties within the broader pharmacological profile discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_5", "document_index": 260, "latency_s": 0.7985654999938561, "prompt_toks": 1910, "completion_toks": 52}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - Gabapentin is typically mildly sedating and can produce a lethargic state. At higher doses, it may lead to a moderately sedated state.\n- Appetite enhancement - Appetite enhancement is not particularly prominent, but is sometimes reported. It can have a synergistic effect when combined with cannabis .\n- Muscle relaxation - Muscle relaxation is present on gabapentin, although not to the extent of benzodiazepines , barbiturates , or GHB .\n- Physical euphoria - Gabapentin is capable of producing weak to moderate states of physical euphoria in some users. However, it is very inconsistent compared to other depressants (e.g. benzodiazepines , opioids , and GHB ) and tolerance builds rapidly. As a result, it is considered to be a poor euphoriant.\n- Decreased libido - Many users note a marked decrease in their sex drive when taking gabapentin. This can happen when it is taken both recreationally or as prescribed.\n\n\n                    Context: \n                    This chunk summarizes the physical and subjective effects of gabapentin, including sedation, appetite changes, muscle relaxation, physical euphoria, and libido decrease, providing key details on its depressant and psychoactive properties within the comprehensive effects section of the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_6", "document_index": 260, "latency_s": 1.012041699999827, "prompt_toks": 1913, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Decreased libido - Many users note a marked decrease in their sex drive when taking gabapentin. This can happen when it is taken both recreationally or as prescribed.\n- Perception of bodily lightness - Some users report feeling lighter at very high doses.\n- Dizziness - Dizziness is prevalent at higher doses, although many users report that it is not necessarily distressing. However, users should be careful not to slip and fall when walking down slopes or stairs.\n- Seizure suppression [ citation needed ] - Gabapentin is commonly used as an anticonvulsant. It is often combined with other anticonvulsants when used to treat epilepsy and other seizure disorders.\n- Pain relief - Gabapentin is used to control pain, particularly fibromyalgic/neuropathic pain (nerve pain) and restless leg syndrome . [ citation needed ] It is generally considered to be not very effective for the management of acute pain, unlike opiates .\n- Muscle twitching\n- Motor control loss\n\n\n                    Context: \n                    This excerpt summarizes key physical and therapeutic effects of gabapentin, including decreased libido, sensation of bodily lightness, dizziness, seizure suppression, pain relief, muscle twitching, and motor control loss. These points highlight its sedative, anticonvulsant, and pain management properties, making them relevant for understanding its effects, uses, and potential side effects discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_7", "document_index": 260, "latency_s": 1.083272299991222, "prompt_toks": 1909, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Muscle twitching\n- Motor control loss\nCognitive effects: - Analysis suppression Anxiety suppression Dream potentiation Thought deceleration Cognitive euphoria Emotion suppression Depersonalization and Derealization - At very high doses, gabapentin can induce a mild dissociative state. Amnesia -  Gabapentin induces a substantially lower amount of amnesia compared to other GABAergic drugs such as benzodiazepines . Sleepiness Suicidal ideation [21]\n- Analysis suppression\n- Anxiety suppression\n- Dream potentiation\n- Thought deceleration\n- Cognitive euphoria\n- Emotion suppression\n- Depersonalization and Derealization - At very high doses, gabapentin can induce a mild dissociative state.\n- Amnesia -  Gabapentin induces a substantially lower amount of amnesia compared to other GABAergic drugs such as benzodiazepines .\n- Sleepiness\n- Suicidal ideation [21]\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This chunk details the cognitive and physical effects of gabapentin, including muscle twitching, motor control loss, dissociative states at high doses, and low amnesic potential, providing specific insights into its neurological and psychological impact within the comprehensive profile of the drug.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_8", "document_index": 260, "latency_s": 0.5757335999951465, "prompt_toks": 1869, "completion_toks": 52}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sleepiness\n- Suicidal ideation [21]\nHistory and culture: \nLiterature: \nVisual effects: - Hallucinatory states Internal hallucination - At higher doses, some users report mild to strong closed eye visuals (CEVs). These can include but are not limited to psychedelic -like geometry and landscapes. It has been noted that smoking cannabis greatly potentiates these effects. Disconnective effects Visual disconnection - This effect is generally quite mild and appears inconsistently at very high doses. It results in feeling as if one's sense of vision is distant or vague and being viewed through a screen or window. However, it is not capable of higher levels of visual disconnection that produce holes, spaces, and voids or hallucinatory structures in the same way that traditional dissociatives can.\n\n\n                    Context: \n                    This chunk covers gabapentin's cognitive and visual effects, including sedation, potential for suicidal ideation, sleepiness, and visual hallucinations such as closed-eye visuals and mild visual disconnection, emphasizing its dissociative and perceptual impact at high doses.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 31, "doc_id": "doc_260", "num_chunks": 10, "chunk_id": "260::chunk_9", "document_index": 260, "latency_s": 0.9031585000047926, "prompt_toks": 1891, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucination - At higher doses, some users report mild to strong closed eye visuals (CEVs). These can include but are not limited to psychedelic -like geometry and landscapes. It has been noted that smoking cannabis greatly potentiates these effects.\n- Visual disconnection - This effect is generally quite mild and appears inconsistently at very high doses. It results in feeling as if one's sense of vision is distant or vague and being viewed through a screen or window. However, it is not capable of higher levels of visual disconnection that produce holes, spaces, and voids or hallucinatory structures in the same way that traditional dissociatives can.\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt details subjective visual effects of gabapentin, including closed-eye visuals (CEVs) and mild visual disconnection at high doses. It explains how dosing influences hallucinations and visual perception alterations, with notes on cannabis potentiation and the limits of visual disconnection compared to traditional dissociatives. This section is relevant for understanding gabapentin’s perceptual side effects.\n                "}
