{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_0", "document_index": 261, "latency_s": 0.6090226999949664, "prompt_toks": 1237, "completion_toks": 42}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Hydrocodone\npsychonaut_name: Hydrocodone\npsychonaut_url: https://psychonautwiki.org/wiki/Hydrocodone\n\n\n                    Context: \n                    This chunk provides the basic identification details, including the drug name Hydrocodone and its PsychonautWiki URL, serving as an entry point within the comprehensive document that covers its chemistry, effects, and legal status.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_1", "document_index": 261, "latency_s": 0.6865455999941332, "prompt_toks": 1478, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Hydrocodone | Chemical Nomenclature | Common names | Vicodin (with paracetamol), Zohydro ER (extended-release), Norco | Substitutive name | Hydrocodone | Systematic name | 4,5α-epoxy-3-methoxy-17-methylmorphinan-6-one | Class Membership | Psychoactive class | Opioid | Chemical class | Morphinan | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 3 mg | Light | 5 - 10 mg | Common | 10 - 25 mg | Strong | 25 - 40 mg | Heavy | 40 mg + | Duration | Total | 4 - 8 hours | Onset | 10 - 60 minutes | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine\n\n\n                    Context: \n                    This excerpt provides key chemical, dosage, and administration information about hydrocodone, including its chemical names, common formulations, recommended dosages, onset and duration, and potential interactions. It serves as a condensed reference within the full document, supporting understanding of hydrocodone's pharmacology, responsible use, and safety considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_2", "document_index": 261, "latency_s": 0.7735086000029696, "prompt_toks": 1272, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine | MXE | Tramadol | Grapefruit\n\n\n                    Context: \n                    This excerpt outlines potential substance interactions with hydrocodone, listing various drugs and substances such as MAOIs, alcohol, benzodiazepines, and others that can interact with it. It is part of the safety and usage section of the document, emphasizing the importance of responsible use and awareness of dangerous combinations. This information is crucial for understanding how hydrocodone may affect or be affected by other substances.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_3", "document_index": 261, "latency_s": 0.8386920000048121, "prompt_toks": 1249, "completion_toks": 45}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This snippet outlines the main sections of the webpage, including summary, chemistry, pharmacology, subjective effects, toxicity, legal status, and references, serving as an overview and navigation guide within the detailed information about hydrocodone.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_4", "document_index": 261, "latency_s": 0.700443699999596, "prompt_toks": 1397, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation - At higher dosages, this compound can result in feelings of sedation but is considerably less sedating than that of codeine , oxycodone or heroin . Pain relief Physical euphoria - Physical euphoria on hydrocodone is commonly described as less intense when compared with morphine or heroin . The sensation itself can be described as extreme feelings of intense physical comfort, warmth, pleasure and bliss which spreads throughout the body. Itchiness - This compound presents greater amounts of itchiness due to higher amounts of histamine release in comparison to other opioids . [ citation needed ] Respiratory depression - At low to moderate doses, this effect results in the sensation that breaths are slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe\n\n\n                    Context: \n                    This excerpt provides an overview of the physical effects of hydrocodone, including sedation, pain relief, euphoria, itchiness, and respiratory depression, highlighting dose-related differences and potential overdose risks. It serves as a detailed section within the full document’s discussion of hydrocodone’s pharmacological and physiological impacts.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_5", "document_index": 261, "latency_s": 0.5945781999907922, "prompt_toks": 1291, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe overdoses can result in a coma or death without immediate medical attention. Appetite suppression Constipation Cough suppression Decreased libido Decreased heart rate Difficulty urinating Nausea Stomach cramps Pupil constriction Orgasm suppression\n\n\n                    Context: \n                    This chunk details the physical side effects and toxicity risks associated with hydrocodone use, including respiratory depression at high doses and various adverse effects such as constipation, nausea, and pupil constriction. It is part of the broader discussion on the compound's physical effects and harm potential outlined in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_6", "document_index": 261, "latency_s": 0.7537326000019675, "prompt_toks": 1330, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - At higher dosages, this compound can result in feelings of sedation but is considerably less sedating than that of codeine , oxycodone or heroin .\n- Pain relief\n- Physical euphoria - Physical euphoria on hydrocodone is commonly described as less intense when compared with morphine or heroin . The sensation itself can be described as extreme feelings of intense physical comfort, warmth, pleasure and bliss which spreads throughout the body.\n- Itchiness - This compound presents greater amounts of itchiness due to higher amounts of histamine release in comparison to other opioids . [ citation needed ]\n\n\n                    Context: \n                    This excerpt details the physical effects of hydrocodone, including sedation levels at higher doses, its analgesic properties, and its characteristic physical euphoria and itchiness caused by histamine release. These effects are key aspects of its pharmacological profile, relevant to understanding its potency, subjective experience, and potential side effects within the broader discussion of hydrocodone’s effects and safety.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_7", "document_index": 261, "latency_s": 1.2216709000058472, "prompt_toks": 1373, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Itchiness - This compound presents greater amounts of itchiness due to higher amounts of histamine release in comparison to other opioids . [ citation needed ]\n- Respiratory depression - At low to moderate doses, this effect results in the sensation that breaths are slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe overdoses can result in a coma or death without immediate medical attention.\n- Appetite suppression\n- Constipation\n- Cough suppression\n- Decreased libido\n- Decreased heart rate\n- Difficulty urinating\n- Nausea\n- Stomach cramps\n- Pupil constriction\n- Orgasm suppression\n\n\n                    Context: \n                    This chunk summarizes the physical and physiological effects of hydrocodone, including side effects such as itchiness caused by histamine release, respiratory depression at higher doses, and various autonomic effects like constipation, nausea, pupil constriction, and sexual function suppression, providing essential information on the drug’s bodily impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_8", "document_index": 261, "latency_s": 0.570303700005752, "prompt_toks": 1351, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Appetite suppression\n- Constipation\n- Cough suppression\n- Decreased libido\n- Decreased heart rate\n- Difficulty urinating\n- Nausea\n- Stomach cramps\n- Pupil constriction\n- Orgasm suppression\nCognitive effects: - Cognitive euphoria - Cognitive euphoria on hydrocodone is described as less intense compared to morphine or diacetylmorphine (heroin). However, it is still capable of producing extreme intensity and overwhelming bliss at heavier dosages with a low tolerance. The sensation itself can be described as powerful and overwhelming feeling of emotional bliss, contentment, and happiness. Anxiety suppression Compulsive redosing Dream potentiation Sleepiness\n\n\n                    Context: \n                    This excerpt details the physical and cognitive effects associated with hydrocodone use, including side effects such as appetite suppression, constipation, respiratory and cardiovascular impacts, and psychological sensations like euphoria, anxiety suppression, and sleepiness, providing a comprehensive overview of its pharmacological profile within the larger document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 32, "doc_id": "doc_261", "num_chunks": 10, "chunk_id": "261::chunk_9", "document_index": 261, "latency_s": 0.9007907999912277, "prompt_toks": 1368, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive euphoria - Cognitive euphoria on hydrocodone is described as less intense compared to morphine or diacetylmorphine (heroin). However, it is still capable of producing extreme intensity and overwhelming bliss at heavier dosages with a low tolerance. The sensation itself can be described as powerful and overwhelming feeling of emotional bliss, contentment, and happiness.\n- Anxiety suppression\n- Compulsive redosing\n- Dream potentiation\n- Sleepiness\nHistory and culture: \nLiterature: \nVisual effects: \nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk details the cognitive effects of hydrocodone, highlighting its capacity to induce emotional bliss, suppression of anxiety, and drowsiness, while comparing its intensity to other opioids like morphine and heroin. It provides an essential overview of the psychological and subjective experiences associated with hydrocodone use, relevant for understanding its psychoactive profile within the broader document.\n                "}
