{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_0", "document_index": 263, "latency_s": 0.9569429000111995, "prompt_toks": 5119, "completion_toks": 44}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Ketamine\npsychonaut_name: Ketamine\npsychonaut_url: https://psychonautwiki.org/wiki/Ketamine\n\n\n                    Context: \n                    This chunk provides the basic identification details and external link for the Ketamine entry within the larger comprehensive overview, serving as a contextual header to locate the full detailed information about ketamine's effects, chemistry, and legal status.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_1", "document_index": 263, "latency_s": 0.7869459000066854, "prompt_toks": 5392, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Ketamine | Chemical Nomenclature | Common names | Ketamine, K, Ket, Kitty, Special K, Cat Tranquilizer, Ketaset, Ketalar, Ketanest, Vitamin K, Purple, Jet | Substitutive name | Ketamine | Systematic name | (RS)-2-(2-Chlorophenyl)-2-(methylamino)cyclohexanone | Class Membership | Psychoactive class | Dissociative | Chemical class | Arylcyclohexylamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 17% | [2] | Threshold | 50 mg | Light | 50 - 100 mg | Common | 100 - 300 mg | Strong | 300 - 450 mg | Heavy | 450 mg+ | Duration | Onset | 10 - 30 minutes | Come up | 5 - 20 minutes | Peak | 45 - 90 minutes | Offset | 3 - 6 hours | After effects | 4 - 8 hours | ⇣ | Sublingual | Dosage | Bioavailability | 20 | [3] | - 29% | [4] | Duration | ⇣ | Insufflated | Dosage | Bioavailability | 45% |\n\n\n                    Context: \n                    This chunk provides detailed chemical and pharmacokinetic information about ketamine, including its multiple common names, chemical structure, routes of administration, bioavailability, dosage thresholds, and timing of effects. It complements the broader document by offering specific data crucial for understanding the substance's properties, responsible use, and effects, making it essential for accurate reference and search retrieval within the comprehensive ketamine profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_2", "document_index": 263, "latency_s": 0.7360521000082372, "prompt_toks": 5354, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - 90 minutes | Offset | 3 - 6 hours | After effects | 4 - 8 hours | ⇣ | Sublingual | Dosage | Bioavailability | 20 | [3] | - 29% | [4] | Duration | ⇣ | Insufflated | Dosage | Bioavailability | 45% | [3] | Threshold | 5 mg | Light | 10 - 30 mg | Common | 30 - 75 mg | Strong | 75 - 150 mg | Heavy | 150 mg + | Duration | Total | 1 - 2 hours | Onset | 1 - 3 minutes | Come up | 5 - 15 minutes | Peak | 15 - 45 minutes | [1] | Offset | 30 - 60 minutes | After effects | 2 - 12 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Amphetamines | Cocaine | Benzodiazepines | MAOIs | Trazodone | Grapefruit | Tramadol | Alcohol | GHB | GBL | Opioids\n\n\n                    Context: \n                    This chunk provides detailed dosage, duration, and interaction information for insufflated and sublingual ketamine administration, including bioavailability percentages, recommended dose thresholds, onset, peak, offset times, and potential drug interactions. It is integral to the comprehensive overview of ketamine's pharmacology and responsible use guidelines within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_3", "document_index": 263, "latency_s": 1.2386185999930603, "prompt_toks": 5134, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk lists the main sections of the webpage related to ketamine, including chemistry, pharmacology, subjective effects, toxicity, legal status, and references. It provides an overview of the key topics covered in the full document, serving as a navigational summary for detailed information on ketamine's properties, effects, and legal considerations. Its relevance lies in organizing comprehensive data for users seeking in-depth understanding or research reference.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_4", "document_index": 263, "latency_s": 0.8436606999894138, "prompt_toks": 5299, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation - Ketamine is reported to have a moderate sedating effect. It discourages physical activity and can render the user immobile at higher doses. Spontaneous bodily sensations - The ketamine \"body high\" can be described as a sharp, pleasurable, tingling sensation that is location-specific to the hands, feet, and head. This manifests as an out-of-body sensation or a general disconnection between the mind and body, which can be accompanied by states of physical euphoria. Changes in felt bodily form & Changes in felt gravity - Ketamine can strongly alter the way the user perceives their bodily form in a dose-dependent manner. At k-hole doses, the user may feel as if they are entirely disconnected from their body and the earth. Physical euphoria - Physical euphoria may be present in some users. However, the effect occurs far less strongly and reliably than with opiates or MDMA . Perception of bodily lightness - The user may feel as if the body is floating and has\n\n\n                    Context: \n                    This excerpt details the physical effects of ketamine, including sedation, body high sensations, altered perceptions of bodily form and gravity, and feelings of lightness and euphoria. It is part of the comprehensive overview of ketamine’s subjective and physical effects, essential for understanding its impact on the body at various doses within the full psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_5", "document_index": 263, "latency_s": 0.8260435999982292, "prompt_toks": 5289, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    be present in some users. However, the effect occurs far less strongly and reliably than with opiates or MDMA . Perception of bodily lightness - The user may feel as if the body is floating and has become entirely weightless. At low doses, this effect is reported to be oddly stimulating, promoting physical activity by making the body feel effortless to move. Motor control loss - A loss of gross and fine motor control alongside balance and coordination is common and becomes pronounced at higher doses. Users are advised to be sitting during the onset in case they fall over and injure themselves. Increased blood pressure [26] - Shown to occur at higher doses. Dehydration - Minor to moderate. More of a risk in hot, high-activity settings such as dance floors. Tactile suppression - The sense of touch may be entirely suppressed, creating feelings of numbness within the extremities. Pain relief - Very prominent. Most physical sensations are suppressed on ketamine. Optical sliding - The\n\n\n                    Context: \n                    This excerpt details the physical effects of ketamine, including sensations of weightlessness, motor control loss, increased blood pressure, dehydration, tactile suppression, and pain relief, as well as visual phenomena like optical sliding. It complements the comprehensive effects overview by highlighting specific bodily and perceptual experiences at varying doses, essential for understanding ketamine’s unique dissociative profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_6", "document_index": 263, "latency_s": 0.8700227999943309, "prompt_toks": 5284, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    of touch may be entirely suppressed, creating feelings of numbness within the extremities. Pain relief - Very prominent. Most physical sensations are suppressed on ketamine. Optical sliding - The user's eyes may wiggle and shake (a condition known as nystagmus), particularly at higher doses. This effect is temporary and usually not a cause for concern unless it persists after other effects have worn off. Dizziness - Some users report dizziness while under the influence of ketamine. Increased salivation Nausea - Uncommon, but more likely at higher doses and near the peak of the experience. Gustatory hallucination Difficulty urinating Decreased libido - Unlike stimulants and many other substances, ketamine tends to strongly decreases libido, making sexual activity unappealing and difficult to perform; coincides with tactile suppression and orgasm suppression . Orgasm suppression - Strongly inhibits orgasms and the normal sexual arousal response at moderate to high doses. Physical\n\n\n                    Context: \n                    This section details the physical effects of ketamine, including sensory suppression, pain relief, visual disturbances such as optical sliding, and common side effects like dizziness, salivation, nausea, and urinary or sexual function disruptions at higher doses. It provides specific information on tactile numbness, eye wobbling, and sexual suppression, highlighting the range of physical sensations and impairments associated with its use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_7", "document_index": 263, "latency_s": 1.0658263999939663, "prompt_toks": 5170, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    to perform; coincides with tactile suppression and orgasm suppression . Orgasm suppression - Strongly inhibits orgasms and the normal sexual arousal response at moderate to high doses. Physical autonomy - Relatively uncommon, but may occur in some users. Users may feel as if their body is performing gestures and movements outside of their own control. However, these disturbances tend to be simple and short-lived.\n\n\n                    Context: \n                    This section details ketamine's physical effects, including sexual suppression features such as orgasm inhibition and potential experiences of physical autonomy, where users may feel unintentional movements. These effects are important for understanding ketamine's impact on physical and sexual functions, relevant to its overall profile of physical effects and safety considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_8", "document_index": 263, "latency_s": 1.4239891000033822, "prompt_toks": 5280, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - Ketamine is reported to have a moderate sedating effect. It discourages physical activity and can render the user immobile at higher doses.\n- Spontaneous bodily sensations - The ketamine \"body high\" can be described as a sharp, pleasurable, tingling sensation that is location-specific to the hands, feet, and head. This manifests as an out-of-body sensation or a general disconnection between the mind and body, which can be accompanied by states of physical euphoria.\n- Changes in felt bodily form & Changes in felt gravity - Ketamine can strongly alter the way the user perceives their bodily form in a dose-dependent manner. At k-hole doses, the user may feel as if they are entirely disconnected from their body and the earth.\n- Physical euphoria - Physical euphoria may be present in some users. However, the effect occurs far less strongly and reliably than with opiates or MDMA .\n\n\n                    Context: \n                    This chunk details ketamine's physical effects, including sedative properties, bodily sensations, alterations in body perception and gravity, and the occurrence of physical euphoria, providing specific insights into its sensory and motor impact as discussed within the broader pharmacological and subjective effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_9", "document_index": 263, "latency_s": 1.038571299999603, "prompt_toks": 5283, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria - Physical euphoria may be present in some users. However, the effect occurs far less strongly and reliably than with opiates or MDMA .\n- Perception of bodily lightness - The user may feel as if the body is floating and has become entirely weightless. At low doses, this effect is reported to be oddly stimulating, promoting physical activity by making the body feel effortless to move.\n- Motor control loss - A loss of gross and fine motor control alongside balance and coordination is common and becomes pronounced at higher doses. Users are advised to be sitting during the onset in case they fall over and injure themselves.\n- Increased blood pressure [26] - Shown to occur at higher doses.\n- Dehydration - Minor to moderate. More of a risk in hot, high-activity settings such as dance floors.\n- Tactile suppression - The sense of touch may be entirely suppressed, creating feelings of numbness within the extremities.\n\n\n                    Context: \n                    This excerpt details the physical effects of ketamine, including sensations like euphoria, lightness, motor control loss, increased blood pressure, dehydration, and tactile suppression. These effects are integral to understanding ketamine's overall subjective experience and harm potential, and are located within the broader discussion of physical and physiological impacts in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_10", "document_index": 263, "latency_s": 1.0897924000018975, "prompt_toks": 5279, "completion_toks": 96}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Tactile suppression - The sense of touch may be entirely suppressed, creating feelings of numbness within the extremities.\n- Pain relief - Very prominent. Most physical sensations are suppressed on ketamine.\n- Optical sliding - The user's eyes may wiggle and shake (a condition known as nystagmus), particularly at higher doses. This effect is temporary and usually not a cause for concern unless it persists after other effects have worn off.\n- Dizziness - Some users report dizziness while under the influence of ketamine.\n- Increased salivation\n- Nausea - Uncommon, but more likely at higher doses and near the peak of the experience.\n- Gustatory hallucination\n- Difficulty urinating\n- Decreased libido - Unlike stimulants and many other substances, ketamine tends to strongly decreases libido, making sexual activity unappealing and difficult to perform; coincides with tactile suppression and orgasm suppression .\n\n\n                    Context: \n                    This excerpt details ketamine's physical and sensory effects, including tactile suppression, pain relief, eye wobbling (nystagmus), dizziness, increased salivation, nausea, hallucinations, urination difficulty, and decreased libido. It highlights the drug’s prominent sedative and dissociative properties, critical for understanding its impairing physical effects and safety considerations. These effects are part of the comprehensive description of ketamine's physical and perceptual impact outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_11", "document_index": 263, "latency_s": 0.7232758000027388, "prompt_toks": 5160, "completion_toks": 56}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Orgasm suppression - Strongly inhibits orgasms and the normal sexual arousal response at moderate to high doses.\n- Physical autonomy - Relatively uncommon, but may occur in some users. Users may feel as if their body is performing gestures and movements outside of their own control. However, these disturbances tend to be simple and short-lived.\n\n\n                    Context: \n                    This section describes physical effects of ketamine, highlighting its impact on sexual function and bodily autonomy. Notably, it details how moderate to high doses can suppress orgasm and may cause users to experience involuntary movements, emphasizing the substance's dissociative and autonomic effects outlined throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_12", "document_index": 263, "latency_s": 0.8365787999937311, "prompt_toks": 5285, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - Analysis suppression - Users report that it is difficult to think normally or logically while under the influence of ketamine. Normal cognition and working memory are impaired in a dose-dependent manner. However, the trade-off is that creative or non-linear thinking faculties may become enhanced (see conceptual thinking ). Anxiety suppression - Anxiety suppression is notable at all doses but not as selective as the effect of benzodiazepines or other GABAergics . Cognitive euphoria - Users report moderate to strong states of cognitive euphoria which tend to occur during the come-up phase; however, appears to be less pronounced compared to stimulants , entactogens , and opioids . Compulsive redosing - Due to its euphoric effects, rapid onset, and short duration, ketamine can cause compulsive re-dosing in some individuals. It is strongly advised to employ strategies to limit intake and prevent abuse. Conceptual thinking - Ketamine produces conceptual or non-linear\n\n\n                    Context: \n                    This excerpt summarizes the cognitive effects of ketamine, including impairments in logical thinking and memory, as well as potential enhancements in creative and non-linear thought processes. It highlights notable effects such as analysis suppression, anxiety reduction, cognitive euphoria, compulsive redosing, and conceptual thinking, providing detailed insights into ketamine's mental impact within the broader discussion of its subjective and physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_13", "document_index": 263, "latency_s": 0.8232518000004347, "prompt_toks": 5279, "completion_toks": 51}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    can cause compulsive re-dosing in some individuals. It is strongly advised to employ strategies to limit intake and prevent abuse. Conceptual thinking - Ketamine produces conceptual or non-linear thinking in a manner that can stimulate one's artistic or creative faculties. Users commonly report entering dream-like, highly complex, and abstract mental spaces that frees them from the boundaries of normal cognition and promotes new insight into their lives and mental patterns. Déjà vu - The user may experience a powerful sensation of déjà vu. This effect is uncommon but less-so than with other substances. Delusion - Delusions appear to occur more commonly on ketamine than other substances (e.g. stimulants , psychedelics ). This effect often coincides with its ego inflation component. It is strongly advised to avoid ketamine if you are susceptible to mental disorders like schizophrenia or bipolar disorder as it may exacerbate delusions and trigger psychosis. Depersonalization &\n\n\n                    Context: \n                    This excerpt details ketamine's mental and cognitive effects, including risks of compulsive re-dosing, its ability to induce conceptual thinking and déjà vu, and its association with delusions and psychosis—highlighting important considerations for safe use and mental health impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_14", "document_index": 263, "latency_s": 0.7712635999923805, "prompt_toks": 5284, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    It is strongly advised to avoid ketamine if you are susceptible to mental disorders like schizophrenia or bipolar disorder as it may exacerbate delusions and trigger psychosis. Depersonalization & Derealization Depression reduction Disinhibition - Low doses produce disinhibition in a similar manner as alcohol. As a result, it is sometimes used for this purpose in parties and raves. Higher doses will result in the opposite effect: social withdrawal and inability to communicate normally. Dream potentiation Ego inflation - Lower doses may result in ego inflation similar to that observed on alcohol , benzodiazepines , or cocaine . Can also occur with k-hole doses, manifesting as delusions of grandeur. Focus suppression - The ability to focus on a single task or object may be strongly suppressed. Its mental effect can be described as \"scattering\" and \"non-linear\"; occurs alongside analysis suppression. Immersion enhancement - The user's sense of immersion may be significantly enhanced,\n\n\n                    Context: \n                    This excerpt summarizes key cognitive and psychological effects of ketamine, such as disinhibition, ego inflation, and focus suppression, and highlights precautions for individuals with mental disorders. It provides a concise overview of ketamine's mental and perceptual impacts, aligning with the detailed effects described throughout the full document for safe use and understanding of its risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_15", "document_index": 263, "latency_s": 1.0621765999967465, "prompt_toks": 5279, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Its mental effect can be described as \"scattering\" and \"non-linear\"; occurs alongside analysis suppression. Immersion enhancement - The user's sense of immersion may be significantly enhanced, particularly when viewing visual media. It is considered to be one of the most immersion-enhancing substances known. Increased music appreciation - Ketamine may increase one's appreciation of music depending on dose and setting. However, this effect is generally less consistent than the effect of psychedelics or entactogens . Sometimes the opposite effect occurs, causing music to sound alien and unpleasant. Introspection - Some user reports suggest ketamine may enhance introspection; however, this effect appears to be much less consistent and robust than psychedelics and entactogens . It should be noted that there is limited evidence showing ketamine has psychotherapeutic benefits. Memory suppression - Strongly suppresses short and long-term memory (in a dose-dependent manner) for the duration\n\n\n                    Context: \n                    This paragraph summarizes ketamine's cognitive and perceptual subjective effects, including mental \"scattering,\" immersion benefits, music appreciation variability, introspection potential, and memory suppression. It is part of the broader section detailing ketamine's physical, cognitive, visual, auditory, multisensory, transpersonal, and disconnection effects, highlighting its complex impact on perception and cognition.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_16", "document_index": 263, "latency_s": 1.019114199996693, "prompt_toks": 5286, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    noted that there is limited evidence showing ketamine has psychotherapeutic benefits. Memory suppression - Strongly suppresses short and long-term memory (in a dose-dependent manner) for the duration of the experience. Heavy doses appear to be able to temporarily turn off one's memory altogether and produce amnesia. Amnesia Personal bias suppression - Some user reports suggest ketamine may suppress one's personal bias; however, this effect appears to be much less consistent and robust than the effect of psychedelics or entactogens . Mania Psychosis - Psychosis appear to be more common on ketamine than other substances (e.g. stimulants , psychedelics ) and appears to coincide with the delusion effect. It is strongly advised to avoid ketamine if you are susceptible to mental disorders like schizophrenia or bipolar disorder as it may exacerbate delusions and trigger psychosis. Spatial disorientation - Spatial orientation is very prominent and occurs in a dose-dependent manner. As a\n\n\n                    Context: \n                    This excerpt covers ketamine's limited evidence for psychotherapeutic benefits, its effects on memory suppression and amnesia at high doses, and the risk of psychosis and delusions, particularly in individuals susceptible to mental disorders. It also notes significant spatial disorientation in a dose-dependent manner. These details are part of a comprehensive overview of ketamine's subjective, cognitive, and safety effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_17", "document_index": 263, "latency_s": 0.6453520000068238, "prompt_toks": 5278, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    like schizophrenia or bipolar disorder as it may exacerbate delusions and trigger psychosis. Spatial disorientation - Spatial orientation is very prominent and occurs in a dose-dependent manner. As a result, the user should carefully analyze any environment in which they are taking ketamine to avoid becoming lost or injuring themselves. Suggestibility enhancement - The user may be rendered significantly more suggestible during and after ketamine administration. This may be a result of ketamine's effect on cognition and susceptibility to delusions and psychosis. Thought deceleration - Thoughts may be perceived by the user as if they are stiff, frozen, or in slow-motion. Dissociatives are known to produce this effect more strongly than other substances. Time distortion - Ketamine prominently alters the subjective experience of time, particularly at the k-hole threshold. In this state, the user is rendered unable to tell how much time has passed; some users report that it can feel like\n\n\n                    Context: \n                    This chunk covers ketamine's cognitive and perceptual effects, including susceptibility to delusions and psychosis, spatial disorientation, suggestibility enhancement, thought deceleration, and time distortion, emphasizing risks during its use. It is relevant for understanding ketamine's mental state alterations and safety considerations detailed later in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_18", "document_index": 263, "latency_s": 0.6302254000038374, "prompt_toks": 5187, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    alters the subjective experience of time, particularly at the k-hole threshold. In this state, the user is rendered unable to tell how much time has passed; some users report that it can feel like an entire lifetime in the span of half an hour. Others report being transported to a dimension seemingly beyond time and space until the effects wear off. Addiction suppression - Ketamine is actively studied as a possible treatment for alcohol use disorder with promising early results. [27] [28]\n\n\n                    Context: \n                    This excerpt discusses the subjective effects of ketamine, focusing on time perception alterations at the k-hole threshold, where users experience significant disorientation and time distortion. It also highlights ketamine's potential therapeutic use in treating alcohol use disorder, emphasizing its relevance to its psychological and medical effects detailed in the broader document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_19", "document_index": 263, "latency_s": 0.6831923999998253, "prompt_toks": 5273, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis suppression - Users report that it is difficult to think normally or logically while under the influence of ketamine. Normal cognition and working memory are impaired in a dose-dependent manner. However, the trade-off is that creative or non-linear thinking faculties may become enhanced (see conceptual thinking ).\n- Anxiety suppression - Anxiety suppression is notable at all doses but not as selective as the effect of benzodiazepines or other GABAergics .\n- Cognitive euphoria - Users report moderate to strong states of cognitive euphoria which tend to occur during the come-up phase; however, appears to be less pronounced compared to stimulants , entactogens , and opioids .\n- Compulsive redosing - Due to its euphoric effects, rapid onset, and short duration, ketamine can cause compulsive re-dosing in some individuals. It is strongly advised to employ strategies to limit intake and prevent abuse.\n\n\n                    Context: \n                    This excerpt summarizes ketamine's cognitive and psychological effects, highlighting its impact on thought processes, anxiety reduction, euphoric states, and risk of compulsive redosing. It is part of the larger document's detailed review of ketamine's physical, perceptual, and mental effects, providing key information for understanding its subjective experience and potential risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_20", "document_index": 263, "latency_s": 0.7667600999993738, "prompt_toks": 5265, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Conceptual thinking - Ketamine produces conceptual or non-linear thinking in a manner that can stimulate one's artistic or creative faculties. Users commonly report entering dream-like, highly complex, and abstract mental spaces that frees them from the boundaries of normal cognition and promotes new insight into their lives and mental patterns.\n- Déjà vu - The user may experience a powerful sensation of déjà vu. This effect is uncommon but less-so than with other substances.\n- Delusion - Delusions appear to occur more commonly on ketamine than other substances (e.g. stimulants , psychedelics ). This effect often coincides with its ego inflation component. It is strongly advised to avoid ketamine if you are susceptible to mental disorders like schizophrenia or bipolar disorder as it may exacerbate delusions and trigger psychosis.\n- Depersonalization & Derealization\n- Depression reduction\n\n\n                    Context: \n                    This section summarizes ketamine's psychological effects, including its capacity to induce conceptual or non-linear thinking, feelings of déjà vu, delusions—especially in susceptible individuals—depersonalization, derealization, and potential depression reduction. These effects are important for understanding ketamine's impact on cognition and mental state within the broader context of its subjective and neuropharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_21", "document_index": 263, "latency_s": 0.7555936999997357, "prompt_toks": 5284, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Depersonalization & Derealization\n- Depression reduction\n- Disinhibition - Low doses produce disinhibition in a similar manner as alcohol. As a result, it is sometimes used for this purpose in parties and raves. Higher doses will result in the opposite effect: social withdrawal and inability to communicate normally.\n- Dream potentiation\n- Ego inflation - Lower doses may result in ego inflation similar to that observed on alcohol , benzodiazepines , or cocaine . Can also occur with k-hole doses, manifesting as delusions of grandeur.\n- Focus suppression - The ability to focus on a single task or object may be strongly suppressed. Its mental effect can be described as \"scattering\" and \"non-linear\"; occurs alongside analysis suppression.\n- Immersion enhancement - The user's sense of immersion may be significantly enhanced, particularly when viewing visual media. It is considered to be one of the most immersion-enhancing substances known.\n\n\n                    Context: \n                    This chunk details the subjective and mental effects of ketamine, including depersonalization, derealization, ego inflation, focus suppression, and immersion enhancement. It is relevant for understanding ketamine’s psychological impact, highlighting its dissociative and perceptual alterations, and fits within the broader discussion of its subjective effects and safety considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_22", "document_index": 263, "latency_s": 1.1216198000038275, "prompt_toks": 5254, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased music appreciation - Ketamine may increase one's appreciation of music depending on dose and setting. However, this effect is generally less consistent than the effect of psychedelics or entactogens . Sometimes the opposite effect occurs, causing music to sound alien and unpleasant.\n- Introspection - Some user reports suggest ketamine may enhance introspection; however, this effect appears to be much less consistent and robust than psychedelics and entactogens . It should be noted that there is limited evidence showing ketamine has psychotherapeutic benefits.\n- Memory suppression - Strongly suppresses short and long-term memory (in a dose-dependent manner) for the duration of the experience. Heavy doses appear to be able to temporarily turn off one's memory altogether and produce amnesia. Amnesia\n- Amnesia\n\n\n                    Context: \n                    This excerpt details ketamine's cognitive and perceptual effects, including its impact on music appreciation, introspection, and memory suppression, highlighting dose-dependent variations and potential for temporary amnesia. It is integral to understanding ketamine's subjective mental influence within the broader discussion of its physical, psychological, and perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_23", "document_index": 263, "latency_s": 0.8717343000025721, "prompt_toks": 5256, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Amnesia\n- Personal bias suppression - Some user reports suggest ketamine may suppress one's personal bias; however, this effect appears to be much less consistent and robust than the effect of psychedelics or entactogens .\n- Mania\n- Psychosis - Psychosis appear to be more common on ketamine than other substances (e.g. stimulants , psychedelics ) and appears to coincide with the delusion effect. It is strongly advised to avoid ketamine if you are susceptible to mental disorders like schizophrenia or bipolar disorder as it may exacerbate delusions and trigger psychosis.\n- Spatial disorientation - Spatial orientation is very prominent and occurs in a dose-dependent manner. As a result, the user should carefully analyze any environment in which they are taking ketamine to avoid becoming lost or injuring themselves.\n\n\n                    Context: \n                    This excerpt summarizes key physical and psychological effects of ketamine, including amnesia, suppression of personal bias, mania, psychosis, and spatial disorientation. It highlights potential mental health risks and disorienting sensory effects, making it relevant for understanding ketamine's impact on cognition and perception within the broader discussion of its subjective, visual, and dissociative effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_24", "document_index": 263, "latency_s": 0.8326803999952972, "prompt_toks": 5286, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Suggestibility enhancement - The user may be rendered significantly more suggestible during and after ketamine administration. This may be a result of ketamine's effect on cognition and susceptibility to delusions and psychosis.\n- Thought deceleration - Thoughts may be perceived by the user as if they are stiff, frozen, or in slow-motion. Dissociatives are known to produce this effect more strongly than other substances.\n- Time distortion - Ketamine prominently alters the subjective experience of time, particularly at the k-hole threshold. In this state, the user is rendered unable to tell how much time has passed; some users report that it can feel like an entire lifetime in the span of half an hour. Others report being transported to a dimension seemingly beyond time and space until the effects wear off.\n- Addiction suppression - Ketamine is actively studied as a possible treatment for alcohol use disorder with promising early results. [27] [28]\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This excerpt summarizes ketamine's cognitive and perceptual effects, including suggestibility enhancement, thought deceleration, time distortion, and its potential use in treating alcohol use disorder, situated within the broader discussion of physical, perceptual, and psychological impacts in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_25", "document_index": 263, "latency_s": 0.7378732000070158, "prompt_toks": 5278, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - The visual effects of ketamine are highly suppressive and distortive. This is one of the many reasons one should never drive or operate machinery while under the influence of ketamine! Suppression Double vision - Prevalent at moderate to heavy doses and can make reading text impossible unless closing one eye. Pattern recognition suppression - Generally occurs at higher doses and makes one unable to recognize and interpret perceivable visual data. Acuity suppression Frame rate suppression - Dose-dependent and prominent at higher doses. Distortions Perspective distortion Environmental cubism Environmental orbism Scenery slicing Geometry The visual geometry produced by ketamine can be described as very brightly colored in scheme when compared to that of other, less visually disconnecting dissociatives like MXE and PCP , but not as complex as the geometry evoked by DXM or any psychedelic . It does not extend beyond level 4 and can be comprehensively described in its\n\n\n                    Context: \n                    This excerpt details the visual effects of ketamine, highlighting its suppressive and distortive impact on vision, including phenomena like suppression, double vision, pattern recognition issues, and geometric distortions. It explains how high doses alter visual perception and describes the characteristic geometric hallucinations, situating these effects within the broader discussion of ketamine's physical and perceptual impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_26", "document_index": 263, "latency_s": 1.2193068000051426, "prompt_toks": 5295, "completion_toks": 98}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    disconnecting dissociatives like MXE and PCP , but not as complex as the geometry evoked by DXM or any psychedelic . It does not extend beyond level 4 and can be comprehensively described in its variations as: simplistic in complexity, algorithmic in style, synthetic in feel, unstructured in organization, dimly lit in lighting, multicoloured in scheme, glossy in shading, soft in edges, large in size, fast in speed, smooth in motion, equal in rounded and angular corners, immersive in its depth and consistent in its intensity. Beyond simple geometric shape hallucinations, high doses of ketamine that enter the \"hole\" can yield a white glow and other low complexity hallucinations like ghosts of people formed of white strings. Hallucinatory states Higher doses of ketamine can produce a full range of high-level hallucinatory states in a fashion that is less consistent and reproducible than that of many common psychedelics. These effects include: Machinescapes Internal hallucination (\n\n\n                    Context: \n                    This excerpt details ketamine's visual hallucinations and geometric visual effects at various doses, describing the complexity, style, and characteristics of visual distortions such as shape, color, motion, and hallucinated environments. It highlights the differences between ketamine’s visual effects and those of other dissociatives and psychedelics, emphasizing the less complex geometric patterns and high-dose hallucinations like ghosts and internal scenes, which are crucial for understanding ketamine's visual phenomenology discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_27", "document_index": 263, "latency_s": 0.7080315999919549, "prompt_toks": 5274, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    range of high-level hallucinatory states in a fashion that is less consistent and reproducible than that of many common psychedelics. These effects include: Machinescapes Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) -  This effect can be comprehensively described through its variations as delirious in believability, fixed in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style. External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. The most common theme for this effect to follow is one of experiencing and talking to friends when they are not actually present.\n\n\n                    Context: \n                    This excerpt details high-level visual hallucinations associated with ketamine use, specifically \"machinescapes\" and internal and external autonomous entity hallucinations, describing their characteristics and common themes. It is relevant to the document's section on visual effects and hallucinations, providing in-depth descriptions of ketamine-induced perceptual distortions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_28", "document_index": 263, "latency_s": 0.7482211000024108, "prompt_toks": 5252, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Double vision - Prevalent at moderate to heavy doses and can make reading text impossible unless closing one eye.\n- Pattern recognition suppression - Generally occurs at higher doses and makes one unable to recognize and interpret perceivable visual data.\n- Acuity suppression\n- Frame rate suppression - Dose-dependent and prominent at higher doses.\n- Perspective distortion\n- Environmental cubism\n- Environmental orbism\n- Scenery slicing\n- Machinescapes\n- Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) -  This effect can be comprehensively described through its variations as delirious in believability, fixed in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style.\n\n\n                    Context: \n                    This section details ketamine's visual hallucinations and distortions, including phenomena like double vision, pattern recognition suppression, perspective distortion, environmental cubism and orbism, scenery slicing, and machinescapes. It also describes internal hallucinations involving autonomous entities, landscapes, and scenarios with fixed styles and controllability. These visual effects are crucial for understanding ketamine's perceptual impact and dangers associated with its use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_29", "document_index": 263, "latency_s": 0.87506370000483, "prompt_toks": 5203, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. The most common theme for this effect to follow is one of experiencing and talking to friends when they are not actually present.\nAuditory effects: - Auditory suppression Auditory distortion Auditory hallucinations\n- Auditory suppression\n- Auditory distortion\n- Auditory hallucinations\n\n\n                    Context: \n                    This chunk details ketamine's visual and auditory hallucinations, specifically focusing on external hallucinations involving autonomous entities, scenery, and scenery plots, often perceived as talking to non-present friends. It also summarizes auditory effects such as suppression, distortion, and hallucinations. These perceptual distortions are key components of ketamine's dissociative sensory effects outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_30", "document_index": 263, "latency_s": 0.7505498999962583, "prompt_toks": 5222, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Auditory effects: - Auditory suppression Auditory distortion Auditory hallucinations\n- Auditory suppression\n- Auditory distortion\n- Auditory hallucinations\nMulti-sensory effects: - Synaesthesia - Synaesthesia is sometimes reported on ketamine, especially at higher doses. Some users have reported the experience of being able to \"hear colors\" or \"see sounds\" in the k-hole state. However, it is not clear if ketamine is capable of producing synaesthesia as a normal effect or if it is merely eliciting it in predisposed individuals. More research is needed to understand the etiology of this reported effect.\n\n\n                    Context: \n                    This section details ketamine's auditory and multisensory effects, including auditory suppression, distortion, hallucinations, and the potential for synaesthesia, primarily at higher doses. It is part of the broader sensory and subjective effects overview, highlighting how ketamine alters perception across multiple sensory modalities. These effects are important for understanding ketamine's dissociative and perceptual impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_31", "document_index": 263, "latency_s": 1.1389170000038575, "prompt_toks": 5286, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Synaesthesia - Synaesthesia is sometimes reported on ketamine, especially at higher doses. Some users have reported the experience of being able to \"hear colors\" or \"see sounds\" in the k-hole state. However, it is not clear if ketamine is capable of producing synaesthesia as a normal effect or if it is merely eliciting it in predisposed individuals. More research is needed to understand the etiology of this reported effect.\nTranspersonal effects: - Transpersonal effects are sometimes reported on ketamine and other dissociatives. However, these effects appear to occur with far less consistency and robustness than those observed on psychedelics and entactogens . It should be noted that there is currently limited clinical evidence that ketamine has psychotherapeutic benefits and some evidence that it promotes disordered thinking. [ citation needed ] Existential self-realization Identity alteration Near-death experience [29] Spirituality enhancement\n- Existential self-realization\n\n\n                    Context: \n                    This excerpt discusses the sensory and psychological effects of ketamine, specifically focusing on synaesthesia—where users report hearing colors or seeing sounds at higher doses—and transpersonal effects such as self-realization, identity alteration, near-death experiences, and spirituality enhancement, highlighting their limited consistency and current lack of clinical evidence.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 34, "doc_id": "doc_263", "num_chunks": 33, "chunk_id": "263::chunk_32", "document_index": 263, "latency_s": 0.8461028000019724, "prompt_toks": 5277, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Existential self-realization\n- Identity alteration\n- Near-death experience [29]\n- Spirituality enhancement\nDisconnective effects: - Ketamine is widely known for its disconnective effects, which together can be referred to as \"dissociation\". The following lists a breakdown of the different forms of sensory and mental disconnection reported on ketamine. Cognitive disconnection Physical disconnection Visual disconnection - This eventually results in the experience of the notorious \"k-hole\" or, more specifically, holes, spaces and voids alongside of structures .\n- Cognitive disconnection\n- Physical disconnection\n- Visual disconnection - This eventually results in the experience of the notorious \"k-hole\" or, more specifically, holes, spaces and voids alongside of structures .\nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk discusses the existential and spiritual effects of ketamine, including self-realization and identity alteration, as well as its dissociative or disconnective effects such as cognitive, physical, and visual disconnection, often linked to the \"k-hole\" experience. These effects are key to understanding ketamine’s psychological and sensory impact, making this section relevant for inquiries into its subjective and transpersonal influences.\n                "}
