{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_0", "document_index": 265, "latency_s": 0.6145854999922449, "prompt_toks": 5893, "completion_toks": 47}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: LSD\npsychonaut_name: LSD\npsychonaut_url: https://psychonautwiki.org/wiki/LSD\n\n\n                    Context: \n                    This snippet provides the basic identifiers for the LSD drug profile, including the name and link to the detailed page, and serves as an entry point for the comprehensive information on LSD's chemistry, effects, and legal status within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_1", "document_index": 265, "latency_s": 0.9738874999893596, "prompt_toks": 6180, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: LSD | Chemical Nomenclature | Common names | LSD, LSD-25, Lucy, L, Acid, Cid, Tabs, Blotter | Substitutive name | d-Lysergic acid diethylamide | Systematic name | (6aR,9R)-N,N-Diethyl-7-methyl-4,6,6a,7,8,9-hexahydroindolo-[4,3-fg]quinoline-9-carboxamide | Class Membership | Psychoactive class | Psychedelic | Chemical class | Lysergamide | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Sublingual | Dosage | Bioavailability | 71% - 71% | [1] | Threshold | 15 µg | Light | 15 - 75 µg | Common | 75 - 150 µg | Strong | 150 - 300 µg | Heavy | 300 µg + | Duration | Total | 8 - 12 hours | Onset | 15 - 30 minutes | Come up | 45 - 90 minutes | Peak | 3 - 5 hours | Offset | 3 - 5 hours | After effects | 12 - 48 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes\n\n\n                    Context: \n                    This chunk is an infobox summarizing key information about LSD, including its chemical nomenclature, common names, pharmacokinetics, dosages, and safety advice. It provides essential reference data that contextualizes the detailed effects, pharmacology, and legal status discussed elsewhere in the full document. Its structured format aids quick retrieval of fundamental LSD properties.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_2", "document_index": 265, "latency_s": 0.7690689000010025, "prompt_toks": 5972, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    90 minutes | Peak | 3 - 5 hours | Offset | 3 - 5 hours | After effects | 12 - 48 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Cannabis | Stimulants | Tramadol | Deliriants | Tricyclic antidepressants | Ritonavir | Lithium\n\n\n                    Context: \n                    This chunk summarizes key timing and dosage considerations for LSD's effects, including onset, peak, offset, and after effects durations. It also contains a disclaimer clarifying that dosage information is user-reported and for educational use, along with a list of substances that may interact with LSD. This information is essential for understanding the pharmacokinetics and safe use practices discussed throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_3", "document_index": 265, "latency_s": 0.7708764999988489, "prompt_toks": 5911, "completion_toks": 48}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the main sections found within the comprehensive LSD webpage, including topics like chemistry, pharmacology, subjective effects, toxicity, legal status, and references, serving as an overview of key content areas for users seeking detailed information about LSD.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_4", "document_index": 265, "latency_s": 0.9207903000060469, "prompt_toks": 6068, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Neurogenesis Stimulation - LSD is usually described as very energetic and stimulating without being forced. For example, it tends to encourage physical activities such as walking, climbing, or dancing. In comparison, other common psychedelics such as psilocybin or LSA are generally sedating and sedentary. Spontaneous bodily sensations - The \"body high\" of LSD behaves as a euphoric, fast-moving, sharp and location specific or generalized tingling sensation. [lower-alpha 1] Physical euphoria - A unique form of physical euphoria may occur at certain points of the trip. However, it is limited and inconsistent compared to the effect of entactogens or opioids , and can just as easily manifest as physical discomfort without any apparent reason. Perception of bodily lightness - The stimulation and energy LSD produces can cause the user to feel as if they are moving weightlessly. Tactile enhancement - Feelings of enhanced tactile sensations are consistently present at\n\n\n                    Context: \n                    This excerpt details the physical effects of LSD, including neurogenesis stimulation, bodily sensations, euphoria, and increased energy, highlighting its energetic and stimulating profile compared to other psychedelics. It covers sensations like the \"body high,\" feelings of lightness, tactile enhancement, and the unpredictable nature of physical euphoria, providing essential information for understanding LSD's physical impact within the broader pharmacology and effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_5", "document_index": 265, "latency_s": 0.6673378999985289, "prompt_toks": 6066, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - The stimulation and energy LSD produces can cause the user to feel as if they are moving weightlessly. Tactile enhancement - Feelings of enhanced tactile sensations are consistently present at moderate levels throughout most LSD trips. [lower-alpha 2] Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually near the peak of the experience. Users can feel as if they are physically part of or conjoined with other objects. [lower-alpha 3] Pain relief - LSD can greatly reduce or distort the perception of pain. This is likely due to a variety of factors as the hallucinogenic effects mean that pain can be interpreted as a different sensation (i.e. a tickling sensation from a painful stimulus). LSD also possesses potent anti-inflammatory properties that likely contribute to this effect. [note 2] Temperature regulation suppression [4] - LSD appears to cause the body to lose some of its ability to regulate its temperature. While usually\n\n\n                    Context: \n                    This section describes the physical effects of LSD on the body, including sensations of weightlessness, tactile enhancement, altered perception of bodily form, pain relief, and temperature regulation suppression. It provides detailed insights into how LSD influences physical sensations and bodily functions during use, supporting the document’s comprehensive overview of LSD's subjective and physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_6", "document_index": 265, "latency_s": 0.7874086999945575, "prompt_toks": 6059, "completion_toks": 51}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    that likely contribute to this effect. [note 2] Temperature regulation suppression [4] - LSD appears to cause the body to lose some of its ability to regulate its temperature. While usually harmless, users should be careful when taking LSD in conditions of extreme hot or cold. Increased bodily temperature [45] - Potentially dangerous states of overheating have been reported to occur in certain conditions, particularly with higher doses due to the fact that LSD raises body serotonin. [lower-alpha 4] Nausea - Mild nausea is occasionally reported on moderate to high doses and either passes after the user vomits or gradually fades by itself as the peak sets in. Bodily control enhancement Stamina enhancement - The user's stamina for physical activities may be enhanced. Some users have also reported using small doses to improve athletic performance. However, this effect is generally mild compared to the effect of stimulants . Appetite suppression - LSD can suppress appetite in a manner\n\n\n                    Context: \n                    This excerpt details LSD's physical effects related to temperature regulation, including potential overheating and body temperature rise, as well as side effects like mild nausea, stamina enhancement, and appetite suppression, providing key information on physiological responses and safety considerations associated with LSD use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_7", "document_index": 265, "latency_s": 0.6581681000097888, "prompt_toks": 6079, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    reported using small doses to improve athletic performance. However, this effect is generally mild compared to the effect of stimulants . Appetite suppression - LSD can suppress appetite in a manner similar to (although not as strong as) stimulants, especially for fatty foods. [lower-alpha 5] Dehydration - Mild to moderate dehydration may occur. Not as extreme as with stimulants or opioids . Difficulty urinating Increased blood pressure [4] - Due to the vasoconstrictive properties of the substance, blood pressure is consequently raised. Increased heart rate [4] Increased perspiration Muscle contractions Muscle spasms Excessive yawning - Excessive yawning is frequently reported, especially during the come up phase. Pupil dilation [4] - Anisocoria, i.e. significant difference in pupil dilation grade between the two eyes, can also be present.  In the context of hallucinogen usage, this phenomenon has been regarded as harmless. [ citation needed ] Increased salivation Seizure [46] - Very\n\n\n                    Context: \n                    This excerpt details the physical and physiological effects of LSD at various doses, including cardiovascular, gastrointestinal, and autonomic responses. It highlights side effects such as increased blood pressure, heart rate, pupil dilation, and yawning, providing essential information on LSD's impact on bodily functions relevant to its toxicity and harm potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_8", "document_index": 265, "latency_s": 0.7872772999980953, "prompt_toks": 6007, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    grade between the two eyes, can also be present.  In the context of hallucinogen usage, this phenomenon has been regarded as harmless. [ citation needed ] Increased salivation Seizure [46] - Very rare but can occur in those who are predisposed to them, particularly while in physically taxing conditions such as being dehydrated, undernourished, overheated, or fatigued. Teeth grinding - Mild to moderate. Not as intense as on MDMA . Vasoconstriction - Dose-dependent, but weaker compared to stimulants , 25x-NBOMe , or DOx . Some users report feeling cold, especially in the extremities.\n\n\n                    Context: \n                    This section details LSD's physical effects, including autonomic responses like pupil dilation, increased salivation, and rare seizures in predisposed individuals. It describes vasoconstriction, temperature sensations, and muscular effects such as teeth grinding, highlighting safety considerations and dose-dependent responses within the broader pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_9", "document_index": 265, "latency_s": 0.9216783000010764, "prompt_toks": 6054, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Neurogenesis\n- Stimulation - LSD is usually described as very energetic and stimulating without being forced. For example, it tends to encourage physical activities such as walking, climbing, or dancing. In comparison, other common psychedelics such as psilocybin or LSA are generally sedating and sedentary.\n- Spontaneous bodily sensations - The \"body high\" of LSD behaves as a euphoric, fast-moving, sharp and location specific or generalized tingling sensation. [lower-alpha 1]\n- Physical euphoria - A unique form of physical euphoria may occur at certain points of the trip. However, it is limited and inconsistent compared to the effect of entactogens or opioids , and can just as easily manifest as physical discomfort without any apparent reason.\n- Perception of bodily lightness - The stimulation and energy LSD produces can cause the user to feel as if they are moving weightlessly.\n\n\n                    Context: \n                    This section details the physical and neurogenesis-related effects of LSD, including its stimulating properties, unique bodily sensations, and euphoric experiences. It highlights LSD’s energetic nature, contrasting it with sedative psychedelics, and describes sensations such as the \"body high\" and feeling of weightlessness, supporting the broader overview of LSD's physical effects in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_10", "document_index": 265, "latency_s": 0.7077613000001293, "prompt_toks": 6048, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Perception of bodily lightness - The stimulation and energy LSD produces can cause the user to feel as if they are moving weightlessly.\n- Tactile enhancement - Feelings of enhanced tactile sensations are consistently present at moderate levels throughout most LSD trips. [lower-alpha 2]\n- Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually near the peak of the experience. Users can feel as if they are physically part of or conjoined with other objects. [lower-alpha 3]\n- Pain relief - LSD can greatly reduce or distort the perception of pain. This is likely due to a variety of factors as the hallucinogenic effects mean that pain can be interpreted as a different sensation (i.e. a tickling sensation from a painful stimulus). LSD also possesses potent anti-inflammatory properties that likely contribute to this effect. [note 2]\n\n\n                    Context: \n                    This section details LSD's physical effects related to bodily perception and sensations, including lightness, tactile enhancement, changes in bodily felt form, and pain relief. These effects are part of the comprehensive overview of LSD's physical and perceptual impacts, emphasizing its stimulation, bodily integration, and analgesic properties within the broader discussion of LSD's psychological and physiological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_11", "document_index": 265, "latency_s": 0.8237165000027744, "prompt_toks": 6041, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Temperature regulation suppression [4] - LSD appears to cause the body to lose some of its ability to regulate its temperature. While usually harmless, users should be careful when taking LSD in conditions of extreme hot or cold.\n- Increased bodily temperature [45] - Potentially dangerous states of overheating have been reported to occur in certain conditions, particularly with higher doses due to the fact that LSD raises body serotonin. [lower-alpha 4]\n- Nausea - Mild nausea is occasionally reported on moderate to high doses and either passes after the user vomits or gradually fades by itself as the peak sets in.\n- Bodily control enhancement\n- Stamina enhancement - The user's stamina for physical activities may be enhanced. Some users have also reported using small doses to improve athletic performance. However, this effect is generally mild compared to the effect of stimulants .\n\n\n                    Context: \n                    This section details the physical effects of LSD, focusing on temperature regulation suppression, risk of overheating due to increased body temperature, nausea, and bodily control enhancements such as stamina improvement. These effects are part of the broader discussion on LSD's physical and physiological impacts, providing important safety information and potential performance benefits.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_12", "document_index": 265, "latency_s": 0.8529417000099784, "prompt_toks": 6061, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Appetite suppression - LSD can suppress appetite in a manner similar to (although not as strong as) stimulants, especially for fatty foods. [lower-alpha 5]\n- Dehydration - Mild to moderate dehydration may occur. Not as extreme as with stimulants or opioids .\n- Difficulty urinating\n- Increased blood pressure [4] - Due to the vasoconstrictive properties of the substance, blood pressure is consequently raised.\n- Increased heart rate [4]\n- Increased perspiration\n- Muscle contractions\n- Muscle spasms\n- Excessive yawning - Excessive yawning is frequently reported, especially during the come up phase.\n- Pupil dilation [4] - Anisocoria, i.e. significant difference in pupil dilation grade between the two eyes, can also be present.  In the context of hallucinogen usage, this phenomenon has been regarded as harmless. [ citation needed ]\n- Increased salivation\n\n\n                    Context: \n                    This chunk lists physical effects of LSD related to autonomic and physiological responses, including appetite suppression, dehydration, blood pressure, heart rate, pupillary dilation, and muscle spasms. It provides detailed information on common bodily reactions and side effects encountered during LSD use, relevant for understanding its physical impact within the comprehensive effects profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_13", "document_index": 265, "latency_s": 0.8751084999967134, "prompt_toks": 5979, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased salivation\n- Seizure [46] - Very rare but can occur in those who are predisposed to them, particularly while in physically taxing conditions such as being dehydrated, undernourished, overheated, or fatigued.\n- Teeth grinding - Mild to moderate. Not as intense as on MDMA .\n- Vasoconstriction - Dose-dependent, but weaker compared to stimulants , 25x-NBOMe , or DOx . Some users report feeling cold, especially in the extremities.\n\n\n                    Context: \n                    This excerpt details some of LSD's physical effects on the body, including increased salivation, rare seizure risk in predisposed individuals, tooth grinding of mild to moderate intensity, and dose-dependent vasoconstriction which may cause feeling cold, especially in extremities; these effects are crucial for understanding LSD's safety profile and physical impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_14", "document_index": 265, "latency_s": 0.8232324999989942, "prompt_toks": 6060, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - Analysis enhancement - Some users report gaining the ability to analyze situations in novel and relatively objective ways. It is not clear if this is actually the case, or just a feeling generated by the substance. Anxiety & Paranoia - Not typically observed at low to common doses and are less likely to occur when the basic rules of set and setting are taken into account. [note 3] Conceptual thinking - A signature effect. LSD may allow the user to bypass normal cognitive patterns (and their associated limitations). Manifests as lateral or abstract thinking patterns. Cognitive euphoria - Cognitive euphoria is limited and inconsistent compared to that of MDMA , cocaine , and opioids . Unlike the aforementioned substances, mental euphoria on psychedelics is \"unforced\", meaning it requires a pre-existing positive emotional state. Euthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy\n\n\n                    Context: \n                    This section details LSD's cognitive effects, including analysis enhancement, conceptual thinking, and limited cognitive euphoria, emphasizing their variable nature and potential therapeutic implications. It also notes the rarity of anxiety and paranoia at typical doses and mentions the concept of euthymia when combined with psychotherapy. These effects are part of the broader discussion on LSD's subjective mental impacts.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_15", "document_index": 265, "latency_s": 0.9340493000054266, "prompt_toks": 6059, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    meaning it requires a pre-existing positive emotional state. Euthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for several mental health problems. Introspection - Present at most doses. May occur alongside personal bias suppression. Personal bias suppression - The user may feel they have the ability to analyze their lives or relationships in a more objective way. It is not clear if this is actually the case, or just a feeling generated by the substance. Creativity enhancement - LSD is well-known for its ability to enhance creativity and out-of-the-box thinking. A large number of artists, musicians, scientists, and other intellectuals have used it, dating to the 1950s. [ citation needed ] Novelty enhancement - Very prominent on LSD compared to other substances. Focus enhancement -\n\n\n                    Context: \n                    This chunk discusses subjective psychological effects of LSD, including mood-related benefits like euphoria, introspection, and bias suppression, as well as enhancements in creativity, novelty, and focus. It details LSD's potential therapeutic use in psychedelic psychotherapy and highlights key mental states experienced during use, providing insight into LSD's influence on cognition and emotional processing within the broader pharmacological and experiential context.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_16", "document_index": 265, "latency_s": 0.931294500012882, "prompt_toks": 6062, "completion_toks": 88}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    musicians, scientists, and other intellectuals have used it, dating to the 1950s. [ citation needed ] Novelty enhancement - Very prominent on LSD compared to other substances. Focus enhancement - Occurs mostly on low or threshold dosages and feels less forced or sharp than it does with stimulants . Immersion enhancement - Very prominent on LSD compared to other substances, second only to dissociative immersion enhancement. Personal meaning enhancement - The user may feel as if their experience has special meaning, which may or may not last after the trip. Appears to depend on the user's set and setting . Emotion enhancement - The user's ability to experience emotion may be strongly enhanced. This is thought to contribute to its therapeutic effect. Consequently, it is advised to not take LSD when in a low or unstable mood and to follow the principles of set and setting . Empathy, affection and sociability enhancement - Can be prominent but also unreliable compared to MDMA. More\n\n\n                    Context: \n                    This excerpt summarizes LSD's subjective effects related to creativity, focus, immersion, personal meaning, emotion, and social qualities, highlighting its prominent influence on these psychological experiences. It emphasizes LSD's ability to enhance novelty, emotional connection, and sociality while stressing the importance of set and setting. This section contributes to the detailed description of LSD’s effects on cognition, perception, and emotional states within the broader document on its pharmacology and subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_17", "document_index": 265, "latency_s": 0.9028338999924017, "prompt_toks": 6056, "completion_toks": 84}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    take LSD when in a low or unstable mood and to follow the principles of set and setting . Empathy, affection and sociability enhancement - Can be prominent but also unreliable compared to MDMA. More dose-dependent; higher doses are more likely to cause introspection and social withdrawal. Delusion - Mild delusions can occur at common doses. Serious, persisting delusions are typically limited to higher doses or individual susceptibility. Déjà vu - Unreliable and usually at higher doses. May indicate an overdose and the beginning of delusions and psychosis . Increased libido - Generally inconsistent compared to stimulants and cannabis . Mild to moderate when it does occur. Increased music appreciation - Extremely prominent for many users. Likely a part of its therapeutic effect. Sublime or mystical experiences on LSD are often linked to music. Increased sense of humor - Very common on LSD, particularly during the come up and peak phases. Users report suddenly finding mundane situations\n\n\n                    Context: \n                    This excerpt summarizes subjective psychological and emotional effects of LSD, including mood considerations, social and perceptual phenomena, and common experiences such as increased music appreciation and humor. It complements detailed sections on LSD's physical, cognitive, visual, and auditory effects by focusing on the mental states and interpersonal impacts associated with its use. These insights are relevant for understanding LSD's influence on mood, perception, and social behavior during a trip.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_18", "document_index": 265, "latency_s": 1.019463699994958, "prompt_toks": 6069, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    mystical experiences on LSD are often linked to music. Increased sense of humor - Very common on LSD, particularly during the come up and peak phases. Users report suddenly finding mundane situations and actions inexplicably hilarious. [note 4] Laughter fits - Laughter fits are common, particularly during the come up phase. It can manifest as uncontrollable giggles and laughter that can form a feedback loop if around others who are also under the influence. Memory suppression - Present at all dose levels past low-common. Stronger than phenethylamines like mescaline or 2C-B but weaker than tryptamines like psilocybin or DMT . Ego loss - A signature effect. May be accompanied by euphoria or dysphoria depending on set and setting . Also accompanied by time distortion and potentially thought loops . Motivation enhancement - LSD produces stimulant-like motivation enhancement at low and microdoses, although in a much less prominent or reliable manner. Multiple thought streams Ego\n\n\n                    Context: \n                    This chunk discusses subjective effects of LSD, highlighting its tendency to produce mystical experiences often linked to music, as well as common psychological effects such as increased humor, laughter fits, memory suppression, ego loss, and motivation enhancement. These effects are important for understanding LSD's impact on perception and cognition, and they complement the broader sections on physical, visual, auditory, and transpersonal effects within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_19", "document_index": 265, "latency_s": 0.8425335000065388, "prompt_toks": 6052, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    thought loops . Motivation enhancement - LSD produces stimulant-like motivation enhancement at low and microdoses, although in a much less prominent or reliable manner. Multiple thought streams Ego replacement - Ego replacement is very rare and occurs in an unpredictable manner. This effect usually coincides with delusions and may indicate the beginnings of psychosis . It is more likely to occur with high doses. Personality regression - True personality regression on LSD is very rare. More commonly, it takes the milder form of the user having strong feelings of early childhood, including repressed memories. Simultaneous emotions Suggestibility enhancement - Suggestibility to external influences may be strongly enhanced. While potentially beneficial for psychotherapy, this property can be abused by nefarious individuals (e.g. cult leaders). Users are advised to be discerning about who they take LSD with. Thought acceleration Thought connectivity - A signature effect. Thoughts may feel\n\n\n                    Context: \n                    This excerpt from the LSD webpage summarizes the drug's subjective cognitive effects, including thought loops, motivation and thought connectivity enhancements, ego replacement rarity, personality feelings, and suggestibility. It highlights LSD's influence on mental processes, potential for delusions, and its use in psychotherapy, fitting within the broader discussion of LSD's physical, perceptual, and psychological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_20", "document_index": 265, "latency_s": 0.8321004000026733, "prompt_toks": 6063, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    abused by nefarious individuals (e.g. cult leaders). Users are advised to be discerning about who they take LSD with. Thought acceleration Thought connectivity - A signature effect. Thoughts may feel more fluid and interconnected than usual. May occur alongside conceptual thinking and creativity enhancement . Thought loops - Typically occurs at higher doses, and at the peak of the experience. Often accompanied by ego loss . This effect may become exacerbated or triggered by cannabis or stimulants. Time distortion - A signature effect. The user's perception of time may be strongly altered. Typically takes the form of time dilation, or the experience of time slowing down and passing much slower than it does while sober. Wakefulness - Users report that it is difficult or impossible to go to sleep for up to 10 hours (or more) after LSD ingestion. Addiction suppression [47] - Some research suggests LSD can be used to treat addiction. Anecdotally, many users report that psychedelics are\n\n\n                    Context: \n                    This excerpt covers LSD's psychological effects such as thought connectivity, loops, and time distortion, along with behavioral impacts like wakefulness and potential for addiction suppression. It highlights cautions about social interactions and the therapeutic potential of LSD, situating these effects within the broader discussion of LSD's subjective and neurochemical profile. These details are crucial for understanding LSD's mental states and safety considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_21", "document_index": 265, "latency_s": 0.9866963999957079, "prompt_toks": 5920, "completion_toks": 56}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    to sleep for up to 10 hours (or more) after LSD ingestion. Addiction suppression [47] - Some research suggests LSD can be used to treat addiction. Anecdotally, many users report that psychedelics are helpful for this purpose.\n\n\n                    Context: \n                    This section discusses the after-effects of LSD, highlighting its duration of wakefulness, with users remaining awake for up to 10 hours or more after ingestion. It also mentions research indicating LSD's potential in addiction treatment and includes anecdotal reports of its helpfulness in such therapeutic contexts.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_22", "document_index": 265, "latency_s": 1.1300125999987358, "prompt_toks": 6031, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis enhancement - Some users report gaining the ability to analyze situations in novel and relatively objective ways. It is not clear if this is actually the case, or just a feeling generated by the substance.\n- Anxiety & Paranoia - Not typically observed at low to common doses and are less likely to occur when the basic rules of set and setting are taken into account. [note 3]\n- Conceptual thinking - A signature effect. LSD may allow the user to bypass normal cognitive patterns (and their associated limitations). Manifests as lateral or abstract thinking patterns.\n- Cognitive euphoria - Cognitive euphoria is limited and inconsistent compared to that of MDMA , cocaine , and opioids . Unlike the aforementioned substances, mental euphoria on psychedelics is \"unforced\", meaning it requires a pre-existing positive emotional state.\n\n\n                    Context: \n                    This section outlines the cognitive effects of LSD, including analysis enhancement, conceptual thinking, and mental euphoria, highlighting both their subjective nature and variability. It discusses how LSD can influence thought patterns, emotional states, and potential for anxiety or paranoia, providing insight into its impact on mental functions within the broader discussion of LSD's subjective and physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_23", "document_index": 265, "latency_s": 0.8292273999977624, "prompt_toks": 6051, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Euthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for several mental health problems.\n- Introspection - Present at most doses. May occur alongside personal bias suppression.\n- Personal bias suppression - The user may feel they have the ability to analyze their lives or relationships in a more objective way. It is not clear if this is actually the case, or just a feeling generated by the substance.\n- Creativity enhancement - LSD is well-known for its ability to enhance creativity and out-of-the-box thinking. A large number of artists, musicians, scientists, and other intellectuals have used it, dating to the 1950s. [ citation needed ]\n- Novelty enhancement - Very prominent on LSD compared to other substances.\n\n\n                    Context: \n                    This excerpt details the subjective psychological effects of LSD, including mood stabilization (euthymia), increased introspection, personal bias suppression, and enhancements in creativity and novelty perception. These effects are key aspects of LSD's influence on mental states and are relevant for understanding its therapeutic and cognitive impacts as described throughout the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_24", "document_index": 265, "latency_s": 0.7240533000003779, "prompt_toks": 6060, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Novelty enhancement - Very prominent on LSD compared to other substances.\n- Focus enhancement - Occurs mostly on low or threshold dosages and feels less forced or sharp than it does with stimulants .\n- Immersion enhancement - Very prominent on LSD compared to other substances, second only to dissociative immersion enhancement.\n- Personal meaning enhancement - The user may feel as if their experience has special meaning, which may or may not last after the trip. Appears to depend on the user's set and setting .\n- Emotion enhancement - The user's ability to experience emotion may be strongly enhanced. This is thought to contribute to its therapeutic effect. Consequently, it is advised to not take LSD when in a low or unstable mood and to follow the principles of set and setting .\n- Empathy, affection and sociability enhancement - Can be prominent but also unreliable compared to MDMA. More dose-dependent; higher doses are more likely to cause introspection and social withdrawal.\n\n\n                    Context: \n                    This chunk summarizes key subjective effects of LSD related to cognitive and emotional enhancements, including novelty, focus, immersion, personal meaning, emotion, and sociability. It highlights how these effects influence user experience and therapeutic potential, and underscores their dependency on dose and set and setting, making it relevant for understanding LSD's psychotropic profile within the broader document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_25", "document_index": 265, "latency_s": 0.7709512000001268, "prompt_toks": 6060, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Delusion - Mild delusions can occur at common doses. Serious, persisting delusions are typically limited to higher doses or individual susceptibility.\n- Déjà vu - Unreliable and usually at higher doses. May indicate an overdose and the beginning of delusions and psychosis .\n- Increased libido - Generally inconsistent compared to stimulants and cannabis . Mild to moderate when it does occur.\n- Increased music appreciation - Extremely prominent for many users. Likely a part of its therapeutic effect. Sublime or mystical experiences on LSD are often linked to music.\n- Increased sense of humor - Very common on LSD, particularly during the come up and peak phases. Users report suddenly finding mundane situations and actions inexplicably hilarious. [note 4] Laughter fits - Laughter fits are common, particularly during the come up phase. It can manifest as uncontrollable giggles and laughter that can form a feedback loop if around others who are also under the influence.\n\n\n                    Context: \n                    This chunk covers various subjective effects of LSD, including psychological and emotional phenomena such as delusions, déjà vu, increased libido, enhanced music appreciation, and heightened humor and laughter. It provides specific details on doses, individual susceptibility, and the experiential significance of these effects, contributing to the comprehensive overview of LSD's subjective impact within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_26", "document_index": 265, "latency_s": 0.6520330000057584, "prompt_toks": 6059, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Laughter fits - Laughter fits are common, particularly during the come up phase. It can manifest as uncontrollable giggles and laughter that can form a feedback loop if around others who are also under the influence.\n- Memory suppression - Present at all dose levels past low-common. Stronger than phenethylamines like mescaline or 2C-B but weaker than tryptamines like psilocybin or DMT . Ego loss - A signature effect. May be accompanied by euphoria or dysphoria depending on set and setting . Also accompanied by time distortion and potentially thought loops .\n- Ego loss - A signature effect. May be accompanied by euphoria or dysphoria depending on set and setting . Also accompanied by time distortion and potentially thought loops .\n- Motivation enhancement - LSD produces stimulant-like motivation enhancement at low and microdoses, although in a much less prominent or reliable manner.\n- Multiple thought streams\n\n\n                    Context: \n                    This chunk summarizes LSD's psychological effects, including involuntary laughter (laughter fits), memory suppression, ego loss, motivation enhancement, and multiple thought streams. These effects are key to understanding LSD's subjective experience and are part of the detailed effects section within the full psychedelic profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_27", "document_index": 265, "latency_s": 0.8941058999917004, "prompt_toks": 6048, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Motivation enhancement - LSD produces stimulant-like motivation enhancement at low and microdoses, although in a much less prominent or reliable manner.\n- Multiple thought streams\n- Ego replacement - Ego replacement is very rare and occurs in an unpredictable manner. This effect usually coincides with delusions and may indicate the beginnings of psychosis . It is more likely to occur with high doses.\n- Personality regression - True personality regression on LSD is very rare. More commonly, it takes the milder form of the user having strong feelings of early childhood, including repressed memories.\n- Simultaneous emotions\n- Suggestibility enhancement - Suggestibility to external influences may be strongly enhanced. While potentially beneficial for psychotherapy, this property can be abused by nefarious individuals (e.g. cult leaders). Users are advised to be discerning about who they take LSD with.\n- Thought acceleration\n\n\n                    Context: \n                    This section summarizes LSD's subjective psychological effects, including motivation enhancement, multiple thought streams, ego replacement (a rare and potentially psychosis-related effect), personality regression, simultaneous emotions, suggestibility enhancement, and thought acceleration. These effects are key to understanding LSD's impact on cognition and consciousness, complementing the broader discussion of its physical, perceptual, and emotional effects within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_28", "document_index": 265, "latency_s": 0.5939297000004444, "prompt_toks": 6056, "completion_toks": 41}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Thought acceleration\n- Thought connectivity - A signature effect. Thoughts may feel more fluid and interconnected than usual. May occur alongside conceptual thinking and creativity enhancement .\n- Thought loops - Typically occurs at higher doses, and at the peak of the experience. Often accompanied by ego loss . This effect may become exacerbated or triggered by cannabis or stimulants.\n- Time distortion - A signature effect. The user's perception of time may be strongly altered. Typically takes the form of time dilation, or the experience of time slowing down and passing much slower than it does while sober.\n- Wakefulness - Users report that it is difficult or impossible to go to sleep for up to 10 hours (or more) after LSD ingestion.\n- Addiction suppression [47] - Some research suggests LSD can be used to treat addiction. Anecdotally, many users report that psychedelics are helpful for this purpose.\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This section details LSD's cognitive and psychological effects, including thought processes, perception of time, wakefulness, and potential therapeutic uses like addiction treatment, fitting within the broader discussion of its subjective and mental effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_29", "document_index": 265, "latency_s": 0.8670788000017637, "prompt_toks": 6061, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - Enhancements Visual acuity enhancement Colour enhancement - Compared to other psychedelics, this effect is often reported to be brighter and more \"radiant\" in character. Pattern recognition enhancement Magnification Frame rate enhancement Distortions Drifting ( melting , breathing , morphing and flowing ) - Compared to other psychedelics, this effect can be described as highly detailed yet cartoon-like in its appearance. The distortions are slow and smooth in motion and fleeting in their appearance. Colour shifting Tracers After images Depth perception distortions Environmental patterning Perspective distortions Recursion Symmetrical texture repetition Scenery slicing Geometry The visual geometry of LSD can be described as more similar in appearance to that of 2C-B or 2C-I than psilocybin , LSA or DMT . It can be exhaustively described as primarily intricate in complexity, algorithmic in form, unstructured in organization, brightly lit, colourful in scheme, synthetic\n\n\n                    Context: \n                    This chunk provides a detailed overview of the visual effects associated with LSD, including enhancements in acuity, color, pattern recognition, and various distortions like drifting and geometry. It highlights comparisons to other psychedelics and describes the characteristic visual geometry, making it relevant for understanding LSD's perceptual impact within the comprehensive effects profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_30", "document_index": 265, "latency_s": 1.4895426999864867, "prompt_toks": 6081, "completion_toks": 95}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    than psilocybin , LSA or DMT . It can be exhaustively described as primarily intricate in complexity, algorithmic in form, unstructured in organization, brightly lit, colourful in scheme, synthetic in feel, multicoloured in scheme, flat in shading, sharp in edges, large in size, fast in speed, smooth in motion, angular in its corners, non-immersive in-depth and consistent in intensity. At higher doses, it tends to produce states of Level 8A visual geometry over Level 8B .  Very high doses saturating serotonin receptors tend to saturate one's visual perception from rainbow geometry to a white void. Hallucinatory states LSD is capable of producing a full range of low and high-level hallucinatory states; however, they are significantly less consistent and reproducible than that of other psychedelic tryptamines such as DMT or psilocybin mushrooms . These effects include: Transformations Machinescapes - A rare effect that typically only occurs at very strong to heavy doses, and not as\n\n\n                    Context: \n                    This excerpt describes the visual hallucination characteristics of LSD, highlighting its intricate, algorithmic, and brightly colored geometric patterns. It details the progression of visual states at different doses, noting the less consistent nature of LSD's hallucinations compared to other psychedelics like DMT or psilocybin, and mentions rare effects such as transformations and machinescapes occurring at high doses. This information is essential for understanding the visual phenomenology associated with LSD in the broader effects summary.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_31", "document_index": 265, "latency_s": 0.7860450000007404, "prompt_toks": 6079, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    psychedelic tryptamines such as DMT or psilocybin mushrooms . These effects include: Transformations Machinescapes - A rare effect that typically only occurs at very strong to heavy doses, and not as consistently as with certain psychedelics such as DMT , psilocybin mushrooms , 2C-P , and atypical psychedelics like salvia . Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - Although some users report that LSD is capable of producing hallucinatory states with the same intensity and vividness as psilocybin mushrooms or DMT , it is much rarer and less consistent. While traditional psychedelics such as LSA , ayahuasca and mescaline will induce internal hallucinations near consistently at level 5 geometry and above, some users claim that LSD tends to go straight into Level 8A visual geometry. This lack of consistently induced hallucinatory breakthroughs means that for most, LSD is relatively limited in\n\n\n                    Context: \n                    This excerpt discusses the visual hallucination effects of LSD in comparison to other psychedelic tryptamines like DMT and psilocybin mushrooms. It highlights that LSD less frequently produces intense internal hallucinations or consistent visual breakthroughs, often reaching higher-level geometries directly, which is relevant for understanding its distinct perceptual impact within the psychedelic repertoire.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_32", "document_index": 265, "latency_s": 0.7488301999983378, "prompt_toks": 5945, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    above, some users claim that LSD tends to go straight into Level 8A visual geometry. This lack of consistently induced hallucinatory breakthroughs means that for most, LSD is relatively limited in depth, at doses that do not come with excessive side effects. External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots )\n\n\n                    Context: \n                    This excerpt discusses LSD's visual hallucination characteristics, noting that while some users report advanced Level 8A geometries, consistent deep hallucinations are less common at typical doses. It highlights LSD's tendency for vivid visual effects and outlines the limitations in hallucination depth without excessive side effects, situating this information within the broader description of LSD's visual and perceptual effects in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_33", "document_index": 265, "latency_s": 1.018823100006557, "prompt_toks": 6070, "completion_toks": 88}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Visual acuity enhancement\n- Colour enhancement - Compared to other psychedelics, this effect is often reported to be brighter and more \"radiant\" in character.\n- Pattern recognition enhancement\n- Magnification\n- Frame rate enhancement\n- Drifting ( melting , breathing , morphing and flowing ) - Compared to other psychedelics, this effect can be described as highly detailed yet cartoon-like in its appearance. The distortions are slow and smooth in motion and fleeting in their appearance.\n- Colour shifting\n- Tracers\n- After images\n- Depth perception distortions\n- Environmental patterning\n- Perspective distortions\n- Recursion\n- Symmetrical texture repetition\n- Scenery slicing\n- Transformations\n- Machinescapes - A rare effect that typically only occurs at very strong to heavy doses, and not as consistently as with certain psychedelics such as DMT , psilocybin mushrooms , 2C-P , and atypical psychedelics like salvia .\n\n\n                    Context: \n                    This excerpt details the visual effects profile of LSD, including enhancements in visual perception such as color, acuity, and pattern recognition, as well as distortions like drifting and scenery slicing. It highlights the characteristic appearance of LSD-induced visuals and notes that some effects, like machinescapes, occur only at high doses with less consistency than other psychedelics. This information is part of the document’s comprehensive description of LSD’s perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_34", "document_index": 265, "latency_s": 0.7789976000058232, "prompt_toks": 6042, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - Although some users report that LSD is capable of producing hallucinatory states with the same intensity and vividness as psilocybin mushrooms or DMT , it is much rarer and less consistent. While traditional psychedelics such as LSA , ayahuasca and mescaline will induce internal hallucinations near consistently at level 5 geometry and above, some users claim that LSD tends to go straight into Level 8A visual geometry. This lack of consistently induced hallucinatory breakthroughs means that for most, LSD is relatively limited in depth, at doses that do not come with excessive side effects.\n- External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots )\n\n\n                    Context: \n                    This excerpt discusses LSD's visual hallucination effects, highlighting that LSD can produce internal hallucinations with vividness comparable to psilocybin or DMT, though these are less consistent and often limited in depth compared to other psychedelics. It also briefly touches on external hallucinations involving autonomous entities and environments.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_35", "document_index": 265, "latency_s": 0.8425881000002846, "prompt_toks": 6026, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots )\nAuditory effects: - Auditory enhancement - Some users report an enhanced sense of hearing on LSD. However, there is currently no clinical evidence supporting this claim. Auditory distortion - Sounds may appear \"tinny\" or \"alien\". More likely at higher doses.  Certain subjective reports mention flanging, delays/echoing, reverb -like effects, similar to those found in music. Auditory hallucination - Typically present at higher doses. Not as common as visual hallucinations, but may occur alongside them.\n- Auditory enhancement - Some users report an enhanced sense of hearing on LSD. However, there is currently no clinical evidence supporting this claim.\n\n\n                    Context: \n                    This excerpt details LSD's auditory and multi-sensory effects, including potential enhancements and distortions in hearing, hallucinations, and synesthetic experiences. It fits within the larger section on visual, auditory, and multi-sensory hallucinations, highlighting how LSD influences sensory perception at higher doses. Key points include reports of increased hearing sensitivity, sounds appearing \"tinny\" or \"alien,\" and auditory hallucinations that may occur alongside visual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_36", "document_index": 265, "latency_s": 0.9838981999928365, "prompt_toks": 6039, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Auditory enhancement - Some users report an enhanced sense of hearing on LSD. However, there is currently no clinical evidence supporting this claim.\n- Auditory distortion - Sounds may appear \"tinny\" or \"alien\". More likely at higher doses.  Certain subjective reports mention flanging, delays/echoing, reverb -like effects, similar to those found in music.\n- Auditory hallucination - Typically present at higher doses. Not as common as visual hallucinations, but may occur alongside them.\nMulti-sensory effects: - Synaesthesia - True synesthesia is rare and non-reproducible, although users often describe the feeling of being able to \"hear colors\" and \"see sounds\". Increasing the dosage can increase the likelihood of occurrence, but seems to primarily occur in those who are already predisposed to synesthetic states.\n\n\n                    Context: \n                    This section details LSD's auditory and multi-sensory effects, including reports of enhanced hearing, distortions such as \"tinny\" sounds and reverb, as well as higher-dose hallucinations. It also discusses true synesthesia, where users may \"hear colors\" or \"see sounds,\" highlighting its rarity and dose dependence. These sensory effects are part of LSD's broader profile of perceptual alterations described in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 36, "doc_id": "doc_265", "num_chunks": 38, "chunk_id": "265::chunk_37", "document_index": 265, "latency_s": 1.033906399999978, "prompt_toks": 6067, "completion_toks": 96}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Synaesthesia - True synesthesia is rare and non-reproducible, although users often describe the feeling of being able to \"hear colors\" and \"see sounds\". Increasing the dosage can increase the likelihood of occurrence, but seems to primarily occur in those who are already predisposed to synesthetic states.\nTranspersonal effects: - Transpersonal states are frequently reported at common to high doses of LSD. They appear to be stronger than most phenethylamines (e.g. mescaline , 2C-B ) but weaker than tryptamines (e.g. psilocybin , DMT ). Strongly dependent on set and setting . Existential self-realization Spirituality enhancement Unity and interconnectedness\n- Existential self-realization\n- Spirituality enhancement\n- Unity and interconnectedness\nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt covers LSD's psychological and perceptual effects, including synesthesia—described as rare and non-reproducible but sometimes experienced as \"hearing colors\" or \"seeing sounds\"—and its transpersonal effects such as spiritual insights, feelings of interconnectedness, and self-realization. It emphasizes that these effects are strongly dependent on set and setting and occur more frequently at common to high doses. The section also briefly references other potential effects like disconnective states and after-effects.\n                "}
