{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_0", "document_index": 266, "latency_s": 0.8734743999957573, "prompt_toks": 4859, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: MDA\npsychonaut_name: MDA\npsychonaut_url: https://psychonautwiki.org/wiki/MDA\n\n\n                    Context: \n                    This snippet provides basic identification details for MDA, including its name and URL, within the broader comprehensive document that covers its chemistry, effects, toxicity, and legal status. It serves as an introductory reference point, linking to the detailed psychonautic profile and essential identifiers.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_1", "document_index": 266, "latency_s": 0.850721099996008, "prompt_toks": 5120, "completion_toks": 91}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: MDA | Chemical Nomenclature | Common names | MDA, Sass, Sally, Tenamfetamine | Substitutive name | 3,4-Methylenedioxyamphetamine | Systematic name | (R) 1-(benzo[1,3]dioxol-5-yl)propan-2-amine | Class Membership | Psychoactive class | Entactogen | / | Stimulant | / | Psychedelic | Chemical class | Amphetamine | / | MDxx | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 20 mg | Light | 40 - 60 mg | Common | 60 - 100 mg | Strong | 100 - 145 mg | Heavy | 145 mg + | Duration | Total | 5 - 8 hours | Onset | 30 - 90 minutes | Come up | 15 - 45 minutes | Peak | 2.5 - 4 hours | Offset | 2 - 3 hours | After effects | 4 - 48 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with\n\n\n                    Context: \n                    This infobox provides key chemical, dosage, and safety information about MDA, summarizing its drug classification, common names, chemical structure, routes of administration, dosage ranges, duration, and legal considerations. It serves as a quick reference within the broader detailed discussion of MDA's physical, cognitive, visual, and psychological effects, as well as safety and legal aspects. Including essential data, it enhances quick understanding and searchability of core MDA characteristics.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_2", "document_index": 266, "latency_s": 0.8762217000039527, "prompt_toks": 4941, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    effects | 4 - 48 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Alcohol | MXE | Dissociatives | DXM | MDMA | Stimulants | 25x-NBOMe | 25x-NBOH | Tramadol | SNRIs | MAOIs | Serotonin releasers | SSRIs | 5-HTP\n\n\n                    Context: \n                    This chunk summarizes key information regarding MDA's duration (effects lasting 4 to 48 hours), dosage considerations, and potential drug interactions, including alcohol, dissociatives, stimulants, and serotonergic substances. It is a crucial reference within the broader document on MDA, providing essential safety and interaction guidelines for responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_3", "document_index": 266, "latency_s": 0.58614949999901, "prompt_toks": 4874, "completion_toks": 51}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the primary sections of the detailed information about MDA provided in the full document, including chemistry, pharmacology, subjective effects, toxicity, legal status, and references, serving as a navigational guide for comprehensive understanding and research on the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_4", "document_index": 266, "latency_s": 0.9476029999932507, "prompt_toks": 5027, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Stimulation & Sedation - In terms of its effects on the user's physical energy levels, MDA is commonly considered to have the paradoxical ability to both be stimulating as well as sedating and relaxing. While MDA is described as being more \"speedy\" than MDMA , as attributed of its higher dopamine transporter affinity. [16] it can also produce a pronounced sedating stoning or couch-locking effect depending on one's set and setting . Unlike MDMA, this can both discourage or encourage activities such as group socializing and dancing in a way that makes it a popular substance for musical events such as festivals and raves. Perception of bodily heaviness - This component typically accompanies any feelings of sedation that this compound can produce. Perception of bodily lightness - This component typically accompanies any feelings of stimulation that this compound can produce. Spontaneous physical sensations - The \"body high\" of MDA can be described as a moderate to\n\n\n                    Context: \n                    This section details the physical effects of MDA, highlighting its paradoxical ability to induce both stimulation and sedation, influenced by set and setting. It describes sensory perceptions like heaviness and lightness, and sensations such as the \"body high,\" providing specific effects relevant to users and harm reduction. This information supports the broader discussion of MDA's subjective and physical impact within the full pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_5", "document_index": 266, "latency_s": 0.8429776999983005, "prompt_toks": 5027, "completion_toks": 58}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    lightness - This component typically accompanies any feelings of stimulation that this compound can produce. Spontaneous physical sensations - The \"body high\" of MDA can be described as a moderate to extreme euphoric tingling sensation that radiates throughout the entire body. It is capable of becoming overwhelmingly pleasurable at higher doses and capable of immobilizing the user. This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Physical euphoria - The physical euphoria MDA has been noted to produce is often described as intensely pleasurable and all-encompassing at its peak. Tactile enhancement - One may find surfaces such as rugs, carpets, blankets, or skin to be softer and more pleasant to the touch while under the influence of this subject's effects. Bodily control enhancement Vibrating vision - At high doses, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion,\n\n\n                    Context: \n                    This excerpt details MDA's physical effects, including sensations of lightness or heaviness, body high, physical euphoria, tactile enhancement, and visual phenomena such as vibrating vision at high doses, highlighting its paradoxical stimulating and sedating properties within the comprehensive description of MDA's effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_6", "document_index": 266, "latency_s": 0.7273344999994151, "prompt_toks": 5022, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    under the influence of this subject's effects. Bodily control enhancement Vibrating vision - At high doses, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion, causing the vision to become blurry and temporarily out of focus. This is a condition known as nystagmus . Temperature regulation suppression Increased bodily temperature - As MDA is a serotonin releasing agent, a rise in core body and brain temperature tends to be high and consistent throughout the experience. Caution must be taken as too high of a dose can result in the dysregulation of the brain's ability to regulate its internal core temperature, which can result in serotonin syndrome , a condition which can be fatal if left untreated. Increased blood pressure Increased heart rate Increased perspiration Dehydration - Feelings of dry mouth and dehydration are a universal experience with this class of compounds; this effect is a product of an increased heart rate and metabolism. While it is\n\n\n                    Context: \n                    This excerpt details the physical effects of MDA under its influence, including visual phenomena like nystagmus and temperature regulation issues such as increased body temperature and risk of serotonin syndrome. It is part of a comprehensive overview of MDA's physical and physiological impact, highlighting safety concerns and dose-related responses.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_7", "document_index": 266, "latency_s": 0.9294100000115577, "prompt_toks": 5030, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Dehydration - Feelings of dry mouth and dehydration are a universal experience with this class of compounds; this effect is a product of an increased heart rate and metabolism. While it is important to avoid becoming dehydrated (especially when out dancing in a hot environment), there have been some notable cases of users suffering from water intoxication through over-drinking (to compensate). It is therefore advised that users simply sip on their water and avoid over-drinking. Difficulty urinating - Higher doses of MDA result in an overall difficulty when it comes to urination. This is an effect that is completely temporary and harmless. It is due to MDA’s promotion of the release of anti-diuretic hormone (ADH); ADH is responsible for regulating urination. This effect can be lessened by simply relaxing, but can be significantly relieved by placing a hot flannel over the genitals to warm them up and encourage blood flow to the region. Appetite suppression Pupil dilation Excessive\n\n\n                    Context: \n                    This excerpt details the physical side effects of MDA, including dehydration, difficulty urinating, appetite suppression, pupil dilation, and excessive yawning. It highlights the importance of hydration management and describes temporary, harmless effects such as urinary difficulties caused by anti-diuretic hormone release. These effects are crucial for understanding MDA's safety profile and harm reduction considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_8", "document_index": 266, "latency_s": 1.099884800001746, "prompt_toks": 4955, "completion_toks": 96}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    by simply relaxing, but can be significantly relieved by placing a hot flannel over the genitals to warm them up and encourage blood flow to the region. Appetite suppression Pupil dilation Excessive yawning Stamina enhancement Teeth grinding - This is usually only present at moderate to higher doses and is similar to what one might experience from MDMA . Temporary erectile dysfunction Seizure - This is a rare effect but can happen in people predisposed to them, especially when taking heavier-than-recommended doses or while in physically taxing conditions, such as being dehydrated, fatigued or undernourished. [ citation needed ]\n\n\n                    Context: \n                    This section details the physical side effects and risks associated with MDA use, including symptoms such as appetite suppression, pupil dilation, yawning, stamina enhancement, teeth grinding, temporary erectile dysfunction, and the rare risk of seizures, especially at higher doses or in physically taxing conditions. It emphasizes the importance of managing side effects, such as relieving genital discomfort with a hot flannel. This information is crucial for understanding MDA's physiological impact and safety considerations outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_9", "document_index": 266, "latency_s": 0.9718771000043489, "prompt_toks": 5002, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stimulation & Sedation - In terms of its effects on the user's physical energy levels, MDA is commonly considered to have the paradoxical ability to both be stimulating as well as sedating and relaxing. While MDA is described as being more \"speedy\" than MDMA , as attributed of its higher dopamine transporter affinity. [16] it can also produce a pronounced sedating stoning or couch-locking effect depending on one's set and setting . Unlike MDMA, this can both discourage or encourage activities such as group socializing and dancing in a way that makes it a popular substance for musical events such as festivals and raves. Perception of bodily heaviness - This component typically accompanies any feelings of sedation that this compound can produce. Perception of bodily lightness - This component typically accompanies any feelings of stimulation that this compound can produce.\n\n\n                    Context: \n                    This excerpt details the physical effects of MDA, highlighting its paradoxical ability to both stimulate and sedate. It explains how higher dopamine affinity contributes to its speediness compared to MDMA and describes the variable sensation of bodily heaviness or lightness, which influences user activity levels. This section is essential for understanding MDA's complex physical profile and its impact on physical energy and perception.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_10", "document_index": 266, "latency_s": 0.9027207999897655, "prompt_toks": 5017, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Perception of bodily heaviness - This component typically accompanies any feelings of sedation that this compound can produce.\n- Perception of bodily lightness - This component typically accompanies any feelings of stimulation that this compound can produce.\n- Spontaneous physical sensations - The \"body high\" of MDA can be described as a moderate to extreme euphoric tingling sensation that radiates throughout the entire body. It is capable of becoming overwhelmingly pleasurable at higher doses and capable of immobilizing the user. This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Physical euphoria - The physical euphoria MDA has been noted to produce is often described as intensely pleasurable and all-encompassing at its peak.\n- Physical euphoria - The physical euphoria MDA has been noted to produce is often described as intensely pleasurable and all-encompassing at its peak.\n\n\n                    Context: \n                    This section details MDA's physical effects, including sensations of bodily heaviness or lightness, and the characteristic \"body high\" condition marked by euphoric tingling and immobilizing sensations. It emphasizes the duality of sedation and stimulation, highlighting the intense, pleasurable physical euphoria experienced at peak doses. These effects are crucial for understanding MDA's physical profile within the broader discussion of its effects and toxicity.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_11", "document_index": 266, "latency_s": 0.8747559000039473, "prompt_toks": 4960, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria - The physical euphoria MDA has been noted to produce is often described as intensely pleasurable and all-encompassing at its peak.\n- Tactile enhancement - One may find surfaces such as rugs, carpets, blankets, or skin to be softer and more pleasant to the touch while under the influence of this subject's effects.\n- Bodily control enhancement\n- Vibrating vision - At high doses, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion, causing the vision to become blurry and temporarily out of focus. This is a condition known as nystagmus .\n\n\n                    Context: \n                    This section details the physical effects of MDA, including sensations of intense physical euphoria, tactile enhancement, bodily control, and visual disturbances such as vibrating vision or nystagmus at high doses. These effects contribute to the overall profile of MDA's psychoactive impact and are crucial for understanding its physical side effects and user experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_12", "document_index": 266, "latency_s": 0.8409646000072826, "prompt_toks": 5008, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Temperature regulation suppression Increased bodily temperature - As MDA is a serotonin releasing agent, a rise in core body and brain temperature tends to be high and consistent throughout the experience. Caution must be taken as too high of a dose can result in the dysregulation of the brain's ability to regulate its internal core temperature, which can result in serotonin syndrome , a condition which can be fatal if left untreated.\n- Increased bodily temperature - As MDA is a serotonin releasing agent, a rise in core body and brain temperature tends to be high and consistent throughout the experience. Caution must be taken as too high of a dose can result in the dysregulation of the brain's ability to regulate its internal core temperature, which can result in serotonin syndrome , a condition which can be fatal if left untreated.\n- Increased blood pressure\n- Increased heart rate\n- Increased perspiration\n\n\n                    Context: \n                    This excerpt outlines the physical risks associated with MDA, emphasizing its effects on thermoregulation and cardiovascular activity. It highlights the importance of caution due to potential overheating, increased blood pressure, heart rate, and sweating, all of which are critical for understanding the drug's toxicity and harm potential sections within the comprehensive information about MDA.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_13", "document_index": 266, "latency_s": 0.875429499996244, "prompt_toks": 4939, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased blood pressure\n- Increased heart rate\n- Increased perspiration\n- Dehydration - Feelings of dry mouth and dehydration are a universal experience with this class of compounds; this effect is a product of an increased heart rate and metabolism. While it is important to avoid becoming dehydrated (especially when out dancing in a hot environment), there have been some notable cases of users suffering from water intoxication through over-drinking (to compensate). It is therefore advised that users simply sip on their water and avoid over-drinking.\n\n\n                    Context: \n                    This section details the physical effects of MDA, emphasizing cardiovascular responses such as increased blood pressure, heart rate, and perspiration, along with dehydration risks. It highlights the importance of proper hydration to prevent complications like water intoxication, making it essential for understanding MDA's health and safety considerations within the broader discussion of its effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_14", "document_index": 266, "latency_s": 0.8024105999938911, "prompt_toks": 5036, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Difficulty urinating - Higher doses of MDA result in an overall difficulty when it comes to urination. This is an effect that is completely temporary and harmless. It is due to MDA’s promotion of the release of anti-diuretic hormone (ADH); ADH is responsible for regulating urination. This effect can be lessened by simply relaxing, but can be significantly relieved by placing a hot flannel over the genitals to warm them up and encourage blood flow to the region.\n- Appetite suppression\n- Pupil dilation\n- Excessive yawning\n- Stamina enhancement\n- Teeth grinding - This is usually only present at moderate to higher doses and is similar to what one might experience from MDMA .\n- Temporary erectile dysfunction\n- Seizure - This is a rare effect but can happen in people predisposed to them, especially when taking heavier-than-recommended doses or while in physically taxing conditions, such as being dehydrated, fatigued or undernourished. [ citation needed ]\n\n\n                    Context: \n                    This section details the physical side effects of MDA, including difficulties in urination, appetite suppression, pupil dilation, and other physiological responses such as teeth grinding and temporary erectile dysfunction, highlighting potential adverse effects and risks associated with higher doses. It is integral for understanding MDA's physical toxicity and safety considerations within the broader discussion of its pharmacology and effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_15", "document_index": 266, "latency_s": 0.7434515000059037, "prompt_toks": 4907, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - The cognitive effects of MDA can be broken down into several components which progressively intensify proportional to dosage. The headspace of MDA is described by many as one of moderate to extreme mental stimulation, feelings of love, openness or empathy, and powerful euphoria. It displays a large number of typical psychedelic , entactogenic and stimulant cognitive effects.\n\n\n                    Context: \n                    This section details the cognitive effects of MDA, including mental stimulation, empathy, euphoria, and typical psychedelic and stimulant effects, and discusses how these effects vary with dosage. It is a key part of the comprehensive overview of MDA's subjective experiences, relevant for understanding its mental and emotional impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_16", "document_index": 266, "latency_s": 0.8279955000034533, "prompt_toks": 5011, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The most prominent of these cognitive effects generally include: Anxiety suppression Cognitive euphoria - Strong cognitive euphoria and feelings of happiness can be produced by MDA and are likely a direct result of serotonin and dopamine release. [ citation needed ] Empathy, affection, and sociability enhancement - This particular effect is more consistent, pronounced, powerful and therapeutic with MDA than any other known substance. It is the most obvious and noticeable effect within any MDA experience and dominates the head space. With time, repeated use, and improper spacing, however, this effect becomes severely diminished as the perspective it instills becomes fully imprinted, making it, so users feel merely speedy and scattered with no new found urges to communicate or bond with others. Emotion enhancement Time distortion - Strong feelings of time compression or dilation are common within MDA and alter the experience of time quite noticeably. Disinhibition Increased music\n\n\n                    Context: \n                    This excerpt summarizes key cognitive effects of MDA, highlighting its influence on anxiety, happiness, empathy, emotional enhancement, and perception of time. It emphasizes MDA's strong sociability-promoting properties and describes how repeated use can diminish these effects. This section provides detailed insights into MDA's mental and emotional impact within the broader discussion of its subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_17", "document_index": 266, "latency_s": 0.8457800000032876, "prompt_toks": 4999, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    others. Emotion enhancement Time distortion - Strong feelings of time compression or dilation are common within MDA and alter the experience of time quite noticeably. Disinhibition Increased music appreciation Increased sense of humor Laughter fits Compulsive redosing - Due to its potential euphoria-inducing effects, there is the potential for MDA to encourage compulsive redosing, much like with MDMA. Due to the length of the experience, many find this less of an issue. Novelty enhancement Creativity enhancement Focus enhancement - This component is most effective at low to moderate doses as anything higher will usually impair concentration. Immersion enhancement Motivation enhancement Increased libido Mindfulness Thought acceleration Wakefulness - This component is present, but to a noticeably lesser degree than MDMA . Users often report being heavily sedated or \"floored\" compared to typical stimulants.\n\n\n                    Context: \n                    This excerpt summarizes the cognitive and perceptual effects of MDA, including emotion enhancement, time distortion, sociability, and redosing tendencies. It highlights how dose-dependent focus and immersion are affected, and notes the typically reduced wakefulness compared to MDMA. This information is essential for understanding MDA's psychological profile and user experience within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_18", "document_index": 266, "latency_s": 0.8932916999910958, "prompt_toks": 5021, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety suppression\n- Cognitive euphoria - Strong cognitive euphoria and feelings of happiness can be produced by MDA and are likely a direct result of serotonin and dopamine release. [ citation needed ]\n- Empathy, affection, and sociability enhancement - This particular effect is more consistent, pronounced, powerful and therapeutic with MDA than any other known substance. It is the most obvious and noticeable effect within any MDA experience and dominates the head space. With time, repeated use, and improper spacing, however, this effect becomes severely diminished as the perspective it instills becomes fully imprinted, making it, so users feel merely speedy and scattered with no new found urges to communicate or bond with others.\n- Emotion enhancement\n- Time distortion - Strong feelings of time compression or dilation are common within MDA and alter the experience of time quite noticeably.\n- Disinhibition\n- Increased music appreciation\n- Increased sense of humor Laughter fits\n\n\n                    Context: \n                    This excerpt summarizes key cognitive and emotional effects of MDA, including anxiety suppression, euphoria, empathy enhancement, emotion intensification, and perceptual distortions like time dilation. These effects are central to understanding MDA's psychological profile and are part of the broader discussion on its subjective experiences, effects, and potential risks documented in the full report.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_19", "document_index": 266, "latency_s": 1.1325233000097796, "prompt_toks": 5006, "completion_toks": 94}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Disinhibition\n- Increased music appreciation\n- Increased sense of humor Laughter fits\n- Laughter fits\n- Compulsive redosing - Due to its potential euphoria-inducing effects, there is the potential for MDA to encourage compulsive redosing, much like with MDMA. Due to the length of the experience, many find this less of an issue.\n- Novelty enhancement\n- Creativity enhancement\n- Focus enhancement - This component is most effective at low to moderate doses as anything higher will usually impair concentration.\n- Immersion enhancement\n- Motivation enhancement\n- Increased libido\n- Mindfulness\n- Thought acceleration\n- Wakefulness - This component is present, but to a noticeably lesser degree than MDMA . Users often report being heavily sedated or \"floored\" compared to typical stimulants.\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This excerpt details the cognitive and behavioral effects of MDA, including disinhibition, increased music appreciation, laughter, compulsive redosing tendencies, and various enhancement effects such as creativity, focus, motivation, and libido, as well as wakefulness. It fits within the broader discussion of MDA's subjective and psychological effects, providing specific insights into its impact on mental states and behaviors. These effects are essential for understanding MDA’s psychoactive profile and potential influence during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_20", "document_index": 266, "latency_s": 0.7019222999952035, "prompt_toks": 4948, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    History and culture: \nLiterature: \nVisual effects: - The visual effects of MDA have an occurrence rating that is more selective and less consistent than any of the traditional psychedelics . The effects can never be guaranteed to manifest themselves, but are the most likely to occur with chemically pure, high dose MDA experiences, towards the end of the experience and particularly if the user has been smoking cannabis . They are also more likely to occur if the user has prior experience with psychedelics , but also remain entirely possible for those who have never tried them as well.\n\n\n                    Context: \n                    This section discusses the visual effects of MDA, highlighting their unpredictable and variable nature compared to traditional psychedelics. It explains that visual phenomena are more likely with pure, high-dose MDA, especially towards the end of the experience, and are influenced by factors such as cannabis use and prior psychedelic experience, making them less consistent and less guaranteed.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_21", "document_index": 266, "latency_s": 1.0683350000035716, "prompt_toks": 5017, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Unlike MDMA , MDA can directly induce mild to moderate psychedelic visual effects due to its ability to partially agonize the 5HT 2A receptor, which means it has the ability to induce moderate psychedelic visual effects. Enhancements MDA presents an array of visual enhancements which are mild in comparison to traditional psychedelics, but still distinctively present. These generally include: Visual acuity enhancement Colour enhancement Pattern recognition enhancement Distortions Tracers After images Symmetrical texture repetition Geometry The visual geometry that is present throughout this experience can be described as more similar in appearance to that of psilocin than LSD . It can be comprehensively described through its variations as primarily intricate in complexity, abstract in form, organic in style, structured in organization, dimly lit in lighting, mostly monotone in colour with blues and greys, glossy in shading, sharp in edges, small in size, fast in speed, smooth in\n\n\n                    Context: \n                    This excerpt details MDA's visual effects and enhancements, highlighting its capacity to produce mild psychedelic visuals through partial 5HT 2A receptor agonism. It describes specific visual phenomena such as geometry, distortions, and color changes, and compares MDA's visual experience to other psychedelics like psilocin and LSD. This information is relevant for understanding MDA’s subjective psychedelic effects and differentiates it from other substances.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_22", "document_index": 266, "latency_s": 0.7119884999992792, "prompt_toks": 5030, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    form, organic in style, structured in organization, dimly lit in lighting, mostly monotone in colour with blues and greys, glossy in shading, sharp in edges, small in size, fast in speed, smooth in motion, equal in round and angular corners, non-immersive in-depth and consistent in intensity. At higher doses, they are significantly more likely to result in states of level 8A visual geometry over level 8B . Hallucinatory states At high to heavy doses, MDA is capable of producing a unique range of low and high-level hallucinatory states in a fashion that is significantly less consistent and reproducible than that of many other commonly used psychedelics . These effects are far more common during the offset of the experience and commonly include: Peripheral information misinterpretation Transformations External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very similar to the same\n\n\n                    Context: \n                    This segment describes the visual and hallucinatory effects of MDA at high doses, highlighting the characteristic geometric visuals, patterns, and hallucinations that can occur during intense experiences. It details the visual styles, potential for autonomous entity hallucinations, and variations in visual geometry, making it relevant to the comprehensive overview of MDA's subjective and perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_23", "document_index": 266, "latency_s": 0.9330871999991359, "prompt_toks": 5014, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Transformations External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very similar to the same experience found within deliriants , but does not manifest itself consistently and usually happens only at high doses. It can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. They usually follow themes of memory replays and semi-realistic or expected events. For example, people could be casually holding objects or performing actions which one would expect them to be in real life before disappearing and dissolving under further inspection. Common examples of this include seeing people wearing glasses or hats when they are not and mistaking faces of friends for random people, and objects as human beings or animals. Internal hallucination - The internal hallucinations which MDA induce are mostly only present as\n\n\n                    Context: \n                    This excerpt details MDA's visual hallucination effects, specifically describing high-dose-induced transformations into autonomous entities, sceneries, and plots akin to deliriant experiences, as well as internal hallucinations occurring at extreme doses. It is relevant for understanding MDA's associated psychedelic visual phenomena, their thematic patterns, controllability, and believability, which are key to comprehensively assessing its perceptual effects and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_24", "document_index": 266, "latency_s": 0.9000940999976592, "prompt_toks": 5008, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    they are not and mistaking faces of friends for random people, and objects as human beings or animals. Internal hallucination - The internal hallucinations which MDA induce are mostly only present as spontaneous breakthroughs at extremely high doses. This effect's variations are delirious in believability, interactive in style, new experiences in content, autonomous in controllability and solid in appearance. The most common way in which they manifest themselves is through hypnagogic scenarios which the user may experience as they are drifting off to sleep after a night of use; these can usually be described as memory replay from the previous several hours. These are short and fleeting, but frequent and completely believable and convincing as they happen. In terms of the theme, they often take the form of conversations with the people who were with you or instead manifest themselves as bizarre and extremely nonsensical plots.\n\n\n                    Context: \n                    This excerpt details MDA's visual and internal hallucination effects, emphasizing high-dose-induced internal hallucinations characterized by delusional, autonomous, and vivid hypnagogic scenarios resembling memory replays and bizarre plots, which are key components of its psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_25", "document_index": 266, "latency_s": 1.2835869999980787, "prompt_toks": 4872, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Visual acuity enhancement\n- Colour enhancement\n- Pattern recognition enhancement\n- Tracers\n- After images\n- Symmetrical texture repetition\n- Peripheral information misinterpretation\n- Transformations\n\n\n                    Context: \n                    This excerpt lists specific visual effects associated with MDA, including enhancements to visual perception such as acuity, color, and pattern recognition, as well as phenomena like tracers, after images, and visual misinterpretations. These effects are part of the visual and psychedelic experiences detailed in the full document, highlighting the compound’s capacity to induce mild to moderate visual alterations and hallucinations, especially at higher doses or in pure, high-dose contexts.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_26", "document_index": 266, "latency_s": 0.7281625999894459, "prompt_toks": 5016, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - After images\n- Symmetrical texture repetition\n- Peripheral information misinterpretation\n- Transformations\n- External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very similar to the same experience found within deliriants , but does not manifest itself consistently and usually happens only at high doses. It can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. They usually follow themes of memory replays and semi-realistic or expected events. For example, people could be casually holding objects or performing actions which one would expect them to be in real life before disappearing and dissolving under further inspection. Common examples of this include seeing people wearing glasses or hats when they are not and mistaking faces of friends for random people, and objects as human beings or animals.\n\n\n                    Context: \n                    This chunk details MDA's visual hallucination effects, including phenomena like after images, symmetrical texture repetition, and perceptual distortions such as transformations and external hallucinations involving autonomous entities and scenery. These descriptions highlight the potential for high-dose visual experiences characteristic of MDA's psychedelic and deliriant-like effects, relevant to understanding its visual component within the broader pharmacology and effects profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_27", "document_index": 266, "latency_s": 0.737218499998562, "prompt_toks": 5022, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucination - The internal hallucinations which MDA induce are mostly only present as spontaneous breakthroughs at extremely high doses. This effect's variations are delirious in believability, interactive in style, new experiences in content, autonomous in controllability and solid in appearance. The most common way in which they manifest themselves is through hypnagogic scenarios which the user may experience as they are drifting off to sleep after a night of use; these can usually be described as memory replay from the previous several hours. These are short and fleeting, but frequent and completely believable and convincing as they happen. In terms of the theme, they often take the form of conversations with the people who were with you or instead manifest themselves as bizarre and extremely nonsensical plots.\nAuditory effects: - Enhancements Hallucinations Distortions\n- Enhancements\n- Hallucinations\n- Distortions\nMulti-sensory effects:\n\n\n                    Context: \n                    This excerpt details the internal hallucinations induced by MDA at high doses, including their characteristics such as believability, autonomy, and common manifestations like hypnagogic scenes and memory replay. It also briefly mentions the associated auditory effects, hallucinations, distortions, and multisensory phenomena related to MDA's psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_28", "document_index": 266, "latency_s": 0.8757965999975568, "prompt_toks": 5021, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Auditory effects: - Enhancements Hallucinations Distortions\n- Enhancements\n- Hallucinations\n- Distortions\nMulti-sensory effects: \nTranspersonal effects: - Existential self-realization - Although this effect is present, it is not quite as pronounced or as consistent when compared to other hallucinogens such as mescaline , LSD or MXE . Due to the relative calmness and lack of chaotic energy that MDA possesses relative to MDMA, however, this combined with its extended duration may make it a better therapeutic agent and can be thought of as being more similar to mescaline than MDMA . Unity and interconnectedness - Experiences of unity, oneness, and interconnectedness between level 2 - 3 are common within MDA. This component most consistently manifests itself at high doses within large crowds at raves and musical  events in the form of \"becoming one with the crowd.\"\n\n\n                    Context: \n                    This excerpt details MDA's auditory and multisensory effects, highlighting hallucination and distortion enhancements, as well as transpersonal experiences such as self-realization and interconnectedness. It emphasizes MDA's potential for therapeutic use and its sociocultural significance in rave settings, aligning with the broader discussion of its subjective effects and psychedelic properties.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_29", "document_index": 266, "latency_s": 0.6555622000014409, "prompt_toks": 4987, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Existential self-realization - Although this effect is present, it is not quite as pronounced or as consistent when compared to other hallucinogens such as mescaline , LSD or MXE . Due to the relative calmness and lack of chaotic energy that MDA possesses relative to MDMA, however, this combined with its extended duration may make it a better therapeutic agent and can be thought of as being more similar to mescaline than MDMA .\n- Unity and interconnectedness - Experiences of unity, oneness, and interconnectedness between level 2 - 3 are common within MDA. This component most consistently manifests itself at high doses within large crowds at raves and musical  events in the form of \"becoming one with the crowd.\"\nDisconnective effects:\n\n\n                    Context: \n                    This excerpt covers the psycho-spiritual effects of MDA, specifically \"existential self-realization\" and \"unity and interconnectedness,\" highlighting their presence and variability compared to other hallucinogens and their prominence at high doses during social or rave settings. It provides insight into the compound’s potential for therapeutic and communal experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_30", "document_index": 266, "latency_s": 0.9588722000044072, "prompt_toks": 5014, "completion_toks": 91}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    After effects: - The effects which occur during the offset of a stimulant experience generally feel negative and uncomfortable in comparison to the effects which occurred during its peak . This is often referred to as a \"comedown\" and occurs because of neurotransmitter depletion. The comedown of MDA is generally considered harsher compared to that of MDMA . Its effects commonly include: Anxiety Appetite suppression Brain zaps - This effect is known to happen slightly more consistently than with MDMA , but does generally not occur if the user is practicing proper spacing and safe dosing practices. Cognitive fatigue Depression Derealization - This effect can occur temporarily after a strong MDA experience and persist in cases of misuse. Dream suppression or Dream potentiation - Although this substance have been known to suppress dreaming, some users note extremely strange and sometimes scary dreams for several nights after taking large doses of MDA. Sleep paralysis - Some users report a\n\n\n                    Context: \n                    This excerpt details the after effects of MDA, including negative and uncomfortable symptoms such as anxiety, cognitive fatigue, depression, derealization, and sleep disturbances, often occurring during the comedown phase due to neurotransmitter depletion. It emphasizes that MDA's comedown is generally harsher than MDMA's and highlights specific effects like brain zaps, dreams, and sleep paralysis, making it a crucial section for understanding MDA’s post-use risks and recovery.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_31", "document_index": 266, "latency_s": 0.691888100001961, "prompt_toks": 4932, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    substance have been known to suppress dreaming, some users note extremely strange and sometimes scary dreams for several nights after taking large doses of MDA. Sleep paralysis - Some users report a higher incidence of experiencing sleep paralysis after consuming MDA. Irritability Motivation suppression Thought deceleration Thought disorganization Suicidal ideation -  This effect is known to happen slightly more consistently than with MDMA , but does generally not occur if the user is practicing proper spacing and safe dosing practices. Wakefulness\n\n\n                    Context: \n                    This excerpt summarizes the after-effects and potential risks following MDA use, including sleep disturbances such as suppressed dreaming and sleep paralysis, as well as psychological effects like irritability, motivation suppression, thought deceleration, disorganization, and increased suicidal ideation, which are more pronounced compared to MDMA and can be mitigated with proper dosing.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_32", "document_index": 266, "latency_s": 0.8220771000051172, "prompt_toks": 5027, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety\n- Appetite suppression\n- Brain zaps - This effect is known to happen slightly more consistently than with MDMA , but does generally not occur if the user is practicing proper spacing and safe dosing practices.\n- Cognitive fatigue\n- Depression\n- Derealization - This effect can occur temporarily after a strong MDA experience and persist in cases of misuse.\n- Dream suppression or Dream potentiation - Although this substance have been known to suppress dreaming, some users note extremely strange and sometimes scary dreams for several nights after taking large doses of MDA.\n- Sleep paralysis - Some users report a higher incidence of experiencing sleep paralysis after consuming MDA.\n- Irritability\n- Motivation suppression\n- Thought deceleration\n- Thought disorganization\n- Suicidal ideation -  This effect is known to happen slightly more consistently than with MDMA , but does generally not occur if the user is practicing proper spacing and safe dosing practices.\n- Wakefulness\n\n\n                    Context: \n                    This excerpt summarizes the after effects and negative psychological impacts associated with MDA use, including symptoms like anxiety, depression, derealization, sleep paralysis, and suicidal ideation. It applies to sections detailing MDA's comedown and after effects, highlighting potential mental health risks and side effects that can persist following use. These details are crucial for understanding MDA’s neuropsychological toxicity and harm potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 37, "doc_id": "doc_266", "num_chunks": 34, "chunk_id": "266::chunk_33", "document_index": 266, "latency_s": 0.6871253999997862, "prompt_toks": 4864, "completion_toks": 56}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Wakefulness\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This section outlines various aspects related to MDA's usage and research, including effects on wakefulness, reagent testing results, preparation methods, scientific research, example compounds, legal considerations, paradoxical effects, and additional relevant information, providing a comprehensive overview relevant to users and researchers.\n                "}
