{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_0", "document_index": 267, "latency_s": 1.1087459999980638, "prompt_toks": 8122, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: MDMA\npsychonaut_name: MDMA\npsychonaut_url: https://psychonautwiki.org/wiki/MDMA\n\n\n                    Context: \n                    This chunk provides basic identification details for MDMA, including its common names, chemical nomenclature, and relevant links, serving as an introductory reference within the comprehensive drug profile. It is essential for search queries related to MDMA’s identity, terminology, and external resources. Its succinct nature aids quick retrieval of fundamental identification information from the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_1", "document_index": 267, "latency_s": 1.0494887000095332, "prompt_toks": 8394, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: MDMA | Chemical Nomenclature | Common names | MDMA, Molly, Mandy, Emma, MD, Ecstasy, E, X, XTC, Rolls, Beans, Pingers | Substitutive name | 3,4-Methylenedioxy-N-methylamphetamine | Systematic name | (RS)-1-(Benzo[d][1,3]dioxol-5-yl)-N-methylpropan-2-amine | Class Membership | Psychoactive class | Stimulant | / | Entactogen | Chemical class | Amphetamine | / | MDxx | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 20 mg | Light | 20 - 80 mg | Common | 80 - 120 mg | Strong | 120 - 150 mg | Heavy | 150 mg + | Duration | Total | 3 - 6 hours | Onset | 30 - 45 minutes | Come up | 15 - 30 minutes | Peak | 1.5 - 2.5 hours | Offset | 1 - 1.5 hours | After effects | 12 - 48 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It\n\n\n                    Context: \n                    This chunk provides the detailed infobox overview of MDMA, including its chemical names, common aliases, chemical class, routes of administration, dosage guidelines, and duration of effects. It complements the full document by summarizing key drug characteristics, safety warnings, and usage parameters essential for quick reference and search retrieval. Its structured format enhances accessibility to core information about MDMA for educational, harm reduction, and informational purposes.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_2", "document_index": 267, "latency_s": 1.0297226999973645, "prompt_toks": 8253, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    | 1.5 - 2.5 hours | Offset | 1 - 1.5 hours | After effects | 12 - 48 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | 5-MeO-xxT | Alcohol | Cocaine | DOx | GHB | GBL | MXE | ΑMT | Protease Inhibitors | SSRIs | SNRIs | 25x-NBOMe | PCP | Serotonin releasers | 2C-T-x | 5-HTP | Tramadol | MAOIs | DXM\n\n\n                    Context: \n                    This chunk summarizes key timing information about MDMA's effects, including onset, offset, and after-effects duration, alongside a disclaimer on dosage accuracy. It also lists notable drug interactions such as SSRIs, alcohol, and psychedelics, highlighting safety considerations discussed throughout the full content. Its placement supports understanding of MDMA’s pharmacokinetics and safety precautions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_3", "document_index": 267, "latency_s": 0.9248254999984056, "prompt_toks": 8139, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the key sections of the MDMA webpage, including summary, contents, chemistry, pharmacology, subjective effects, toxicity, legal status, related topics, external resources, and references. It serves as a structured overview of the comprehensive information provided in the full document, aiding in targeted search and navigation of MDMA-related data.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_4", "document_index": 267, "latency_s": 0.9104912000038894, "prompt_toks": 8298, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Abnormal heartbeat [ citation needed ] Appetite suppression Bodily control enhancement Bronchodilation [ citation needed ] Dehydration -- It is advised to avoid over-hydration from drinking excessive amounts of water, see the water intoxication and electrolyte imbalance section. Difficulty urinating -  Like with other stimulants; this can happen to a mild or moderate degree and is once again a recommended reason to avoid drinking too much water, see the water intoxication and electrolyte imbalance section. Dry mouth - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section. Chewing gum may help increase moisture and reverse dryness. Excessive yawning -  Occasional yawning is thought to occur as a result of serotoninergic activity which can make people more sedated or sleepy. It is more likely to occur with lower doses and/or due to purer MDMA. Therefore, it is sometimes used as an indicator of a batch's quality. Increased blood\n\n\n                    Context: \n                    This excerpt details the physical effects of MDMA, including cardiovascular, respiratory, digestive, and dehydration-related symptoms, emphasizing common issues like abnormal heartbeat, dry mouth, dehydration, difficulty urinating, and yawning. It highlights the importance of hydration management and notes that these effects are relevant for harm reduction and understanding MDMA's physiological impact within the comprehensive effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_5", "document_index": 267, "latency_s": 1.0167184000019915, "prompt_toks": 8298, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    can make people more sedated or sleepy. It is more likely to occur with lower doses and/or due to purer MDMA. Therefore, it is sometimes used as an indicator of a batch's quality. Increased blood pressure [30] [31] Increased bodily temperature [32] - As MDMA is a serotonin releasing agent, a rise in core body temperature tends to be a significant and consistent part of the experience. Caution must be taken as too high of a dose in a dangerously hot environment can result in serotonin toxicity and related oxidative stress, which can be fatal or very damaging if left untreated. Avoid drinking too much water, see the water intoxication and electrolyte imbalance section. Increased heart rate [30] Increased perspiration [33] - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section. Muscle contractions Nausea - This effect is most commonly present during the come up phase of the experience, and at higher doses, but has been reported to occur\n\n\n                    Context: \n                    This excerpt details MDMA's physical effects related to cardiovascular and thermoregulatory responses, including increased blood pressure, body temperature, heart rate, perspiration, muscle contractions, and nausea, primarily during the onset and at higher doses. It emphasizes the importance of hydration management to prevent water intoxication and serotonin toxicity. These effects are central to understanding MDMA's risk profile and safety considerations outlined in the toxicity and harm potential section of the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_6", "document_index": 267, "latency_s": 1.0655888999899616, "prompt_toks": 8307, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    and electrolyte imbalance section. Muscle contractions Nausea - This effect is most commonly present during the come up phase of the experience, and at higher doses, but has been reported to occur spontaneously in those who seem to be susceptible to it. This is likely due to the large number of serotonin receptors occurring in the gut. Neurotoxicity - Long-term use can lead to a significant degree of neurotoxicity. Consequences like this are the primary reason the use of MDMA should be delegated to only several times a year at most. Protracted symptoms of depression or anhedonia are fairly common with excessively frequent use. Pain relief - This effect is generally not as powerful as it is with opioids . [34] [35] [36] Pupil dilation - This component can be very prominent compared to other stimulants and is oftentimes almost identical to that of genuine psychedelics . Environments and level of lighting can factor in too however. Seizure - Seizures are rare but may occur in those who\n\n\n                    Context: \n                    This chunk details the physical effects of MDMA, focusing on dehydration and electrolyte imbalance, muscle contractions, nausea, neurotoxicity, pupil dilation, and seizure risk. It highlights the importance of managing hydration and the potential long-term neurotoxic consequences of frequent use, providing key information relevant to the drug's safety profile within the broader discussion of MDMA's effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_7", "document_index": 267, "latency_s": 1.0939572000061162, "prompt_toks": 8298, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    stimulants and is oftentimes almost identical to that of genuine psychedelics . Environments and level of lighting can factor in too however. Seizure - Seizures are rare but may occur in those who are susceptible to them, especially when taking higher doses or redosing while in physically taxing conditions such as being dehydrated, fatigued, undernourished, or overheated. [ citation needed ] Temporary erectile dysfunction & Orgasm suppression [37] [38] Spontaneous bodily sensations - The \"body high\" of MDMA can be characterized as a moderate to extreme euphoric and highly pleasurable tingling sensation of smoothness that encompasses the entire body. This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak occurs. Physical euphoria - Physical euphoria is a prominent aspect of the MDMA experience and occurs reliably when MDMA is used responsibly (i.e. reasonable dosing and spacing between experiences) and can lead to profound\n\n\n                    Context: \n                    This excerpt details the physical and sensory effects of MDMA, including its stimulation of the nervous system, risk of seizures in susceptible individuals, and phenomena such as spontaneous bodily sensations, euphoric tingling, and physical euphoria, highlighting key aspects of the drug’s impact on the body during responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_8", "document_index": 267, "latency_s": 0.8999457000027178, "prompt_toks": 8283, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria is a prominent aspect of the MDMA experience and occurs reliably when MDMA is used responsibly (i.e. reasonable dosing and spacing between experiences) and can lead to profound feelings of social and physical disinhibition and hyperactivity or a profoundly pleasure feeling in the body which can also be characterized by a lack of mobility but with a substantial level of comfort. However, euphoria is quick to fade as one builds tolerance to MDMA's effects, colloquially known as \"losing the magic\". Stamina enhancement Stimulation - MDMA is popularly known for being stimulating and energetic. This encourages activities such as running, walking, climbing and dancing in a way that makes MDMA a popular choice for musical events such as festivals and raves or general nightlife activities. The distinct style of stimulation which MDMA presents can be described as forced. This means that at higher doses, it becomes difficult or impossible to keep still as jaw clenching,\n\n\n                    Context: \n                    This excerpt details the physical and stimulating effects of MDMA, highlighting its capacity to induce profound euphoria, social disinhibition, and increased physical activity, especially when used responsibly. It emphasizes that euphoria diminishes with tolerance, and describes MDMA's characteristic forced stimulation, including jaw clenching, making it relevant for understanding MDMA's physical effects and behavioral impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_9", "document_index": 267, "latency_s": 2.8503327000071295, "prompt_toks": 8285, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    activities. The distinct style of stimulation which MDMA presents can be described as forced. This means that at higher doses, it becomes difficult or impossible to keep still as jaw clenching, involuntarily body shakes and vibrations become present, resulting in an unsteadiness of the hands and a general lack of motor control. Unlike most other stimulants, however, the stimulating effects of MDMA can also paradoxically be accompanied by persistent or wave-like feelings of deep sedation and relaxation , depending on the dose, with lower doses exemplifying a more relaxing or sedative quality. However in moderate to high doses it acts more similar to traditional stimulants; resulting in a nearly invariable desire to move around and engage in various kinds of mobile activities. This encouraged style of stimulation for some individuals is well reputed for resulting  very physically active behaviors such as dancing if said user is inclined or open to such activities. However, it is also\n\n\n                    Context: \n                    This excerpt discusses the physical stimulation effects of MDMA, highlighting its unique paradoxical combination of forces such as jaw clenching, involuntary body movements, and vibrations, which impair motor control at higher doses. It emphasizes how MDMA's stimulation can also induce feelings of relaxation at lower doses and how these effects influence behaviors like dancing and physical activity, making it relevant to its comprehensive profile of physical and behavioral effects in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_10", "document_index": 267, "latency_s": 0.8520573999994667, "prompt_toks": 8283, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    style of stimulation for some individuals is well reputed for resulting  very physically active behaviors such as dancing if said user is inclined or open to such activities. However, it is also not uncommon for people with general social prejudices against dance behavior to suddenly become much more openminded to the idea once under the influence of a sufficient (moderate) dose of MDMA. Tactile enhancement - MDMA produces distinct enhancements to tactile sensations. Users commonly report a sense of softness and fuzziness draping over their skin. Likewise, touching soft and fuzzy objects such as shag rugs can become irresistibly pleasurable and satisfying. MDMA-type tactile enhancement appears to be an effect unique to the entactogen class and may be a serotonin-related effect. Although it is also worth noting that many experimenters of the drug find that the tactile effects (especially in regards to pleasure) have often been notably exaggerated by other users, with some of these\n\n\n                    Context: \n                    This excerpt discusses MDMA's stimulating effects on physical activity and its distinctive tactile enhancements, highlighting increased enjoyment of touch and potential changes in social behavior related to dance. It emphasizes MDMA's unique serotonin-related tactile effects and notes user experiences comparing exaggerated perceptions of tactile pleasure. This information contributes to the comprehensive overview of MDMA's physical and perceptual effects detailed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_11", "document_index": 267, "latency_s": 1.0470330999960424, "prompt_toks": 8287, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    it is also worth noting that many experimenters of the drug find that the tactile effects (especially in regards to pleasure) have often been notably exaggerated by other users, with some of these proponents even claiming borderline “orgasmic” sensations associated with physical touch. Teeth grinding [39] - This effect when experienced alongside the cognitive and physical euphoria can often lead to users mildly or intensely clenching their jaw muscles, sometimes even to the point where the individual’s facial expression begins to change. This is sometimes colloquially called “gurning”. This particular effect is to be the reason that people take MDMA at raves use pacifiers or chew gum since intense gurning can lead to many users biting excessively hard on their lips. [40] and is typically only experienced in moderate to high dosages. For other individuals, especially if they are prone to experience the paradoxical feelings of muscle relaxation, bruxism may not be as pronounced.\n\n\n                    Context: \n                    This section discusses physical effects of MDMA, highlighting tactile sensations and associated jaw muscle activity. It notes that tactile pleasure reports may be exaggerated and explains the phenomenon of teeth grinding, or gurning, which occurs at moderate to high doses and can lead to biting lips or facial changes. The content emphasizes dosage-dependent effects and individual variability, relevant to comprehensive understanding of MDMA's physical impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_12", "document_index": 267, "latency_s": 1.1407857000012882, "prompt_toks": 8209, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    only experienced in moderate to high dosages. For other individuals, especially if they are prone to experience the paradoxical feelings of muscle relaxation, bruxism may not be as pronounced. Temperature regulation suppression - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section. Vasoconstriction Vibrating vision - At high doses, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion, causing the vision to become blurry and temporarily out of focus. This is a condition known as nystagmus .\n\n\n                    Context: \n                    This excerpt discusses physical effects of MDMA at moderate to high doses, highlighting symptoms such as bruxism, temperature regulation suppression, vasoconstriction, and vibrating vision (nystagmus). It emphasizes dosage-related variations and cautions against water overhydration, providing critical details on MDMA’s physiological impact detailed within the broader section on physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_13", "document_index": 267, "latency_s": 0.9465076999913435, "prompt_toks": 8301, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Abnormal heartbeat [ citation needed ]\n- Appetite suppression\n- Bodily control enhancement\n- Bronchodilation [ citation needed ]\n- Dehydration -- It is advised to avoid over-hydration from drinking excessive amounts of water, see the water intoxication and electrolyte imbalance section.\n- Difficulty urinating -  Like with other stimulants; this can happen to a mild or moderate degree and is once again a recommended reason to avoid drinking too much water, see the water intoxication and electrolyte imbalance section.\n- Dry mouth - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section. Chewing gum may help increase moisture and reverse dryness.\n- Excessive yawning -  Occasional yawning is thought to occur as a result of serotoninergic activity which can make people more sedated or sleepy. It is more likely to occur with lower doses and/or due to purer MDMA. Therefore, it is sometimes used as an indicator of a batch's quality.\n\n\n                    Context: \n                    This chunk details common physical effects and adverse reactions associated with MDMA use, including cardiovascular, respiratory, and hydration-related symptoms, as well as side indicators like yawning. It complements the comprehensive section on MDMA's physical and physiological effects, providing specific symptoms and precautions relevant for harm reduction and understanding the drug’s impact on the body.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_14", "document_index": 267, "latency_s": 1.2927175999939209, "prompt_toks": 8290, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased blood pressure [30] [31]\n- Increased bodily temperature [32] - As MDMA is a serotonin releasing agent, a rise in core body temperature tends to be a significant and consistent part of the experience. Caution must be taken as too high of a dose in a dangerously hot environment can result in serotonin toxicity and related oxidative stress, which can be fatal or very damaging if left untreated. Avoid drinking too much water, see the water intoxication and electrolyte imbalance section.\n- Increased heart rate [30]\n- Increased perspiration [33] - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section.\n- Muscle contractions\n- Nausea - This effect is most commonly present during the come up phase of the experience, and at higher doses, but has been reported to occur spontaneously in those who seem to be susceptible to it. This is likely due to the large number of serotonin receptors occurring in the gut.\n\n\n                    Context: \n                    This chunk details common physical effects of MDMA, including cardiovascular responses like increased blood pressure and heart rate, as well as temperature regulation issues, sweating, muscle contractions, and nausea often experienced during the onset or at high doses. These effects are crucial for understanding MDMA's physiological impact, safety considerations, and risk factors highlighted within the broader discussion of its subjective and physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_15", "document_index": 267, "latency_s": 1.1482512999937171, "prompt_toks": 8300, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Neurotoxicity - Long-term use can lead to a significant degree of neurotoxicity. Consequences like this are the primary reason the use of MDMA should be delegated to only several times a year at most. Protracted symptoms of depression or anhedonia are fairly common with excessively frequent use.\n- Pain relief - This effect is generally not as powerful as it is with opioids . [34] [35] [36]\n- Pupil dilation - This component can be very prominent compared to other stimulants and is oftentimes almost identical to that of genuine psychedelics . Environments and level of lighting can factor in too however.\n- Seizure - Seizures are rare but may occur in those who are susceptible to them, especially when taking higher doses or redosing while in physically taxing conditions such as being dehydrated, fatigued, undernourished, or overheated. [ citation needed ]\n- Temporary erectile dysfunction & Orgasm suppression [37] [38]\n\n\n                    Context: \n                    This section summarizes key physical and neurotoxic effects of MDMA, including long-term neurotoxicity risks, limited pain relief, prominent pupil dilation, rare seizure potential, and temporary sexual dysfunction. It provides important information on MDMA's adverse effects and safety considerations within the broader context of its pharmacology, toxicity, and health risks discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_16", "document_index": 267, "latency_s": 1.0709734999982174, "prompt_toks": 8276, "completion_toks": 94}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Temporary erectile dysfunction & Orgasm suppression [37] [38]\n- Spontaneous bodily sensations - The \"body high\" of MDMA can be characterized as a moderate to extreme euphoric and highly pleasurable tingling sensation of smoothness that encompasses the entire body. This sensation maintains a consistent presence that steadily rises with the onset and hits its limit once the peak occurs. Physical euphoria - Physical euphoria is a prominent aspect of the MDMA experience and occurs reliably when MDMA is used responsibly (i.e. reasonable dosing and spacing between experiences) and can lead to profound feelings of social and physical disinhibition and hyperactivity or a profoundly pleasure feeling in the body which can also be characterized by a lack of mobility but with a substantial level of comfort. However, euphoria is quick to fade as one builds tolerance to MDMA's effects, colloquially known as \"losing the magic\".\n\n\n                    Context: \n                    This excerpt details MDMA's physical effects, including its impact on bodily sensations, euphoria, and sexual function, highlighting the characteristic \"body high,\" feelings of pleasure and disinhibition, and potential sexual side effects like erectile dysfunction and orgasm suppression. It contextualizes MDMA's dual stimulant and entactogen nature, emphasizing responsible use and the phenomenon of tolerance. This information is essential for understanding MDMA’s sensory and physical profile within the broader discussion of its subjective effects and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_17", "document_index": 267, "latency_s": 1.5557218000030844, "prompt_toks": 8205, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria - Physical euphoria is a prominent aspect of the MDMA experience and occurs reliably when MDMA is used responsibly (i.e. reasonable dosing and spacing between experiences) and can lead to profound feelings of social and physical disinhibition and hyperactivity or a profoundly pleasure feeling in the body which can also be characterized by a lack of mobility but with a substantial level of comfort. However, euphoria is quick to fade as one builds tolerance to MDMA's effects, colloquially known as \"losing the magic\".\n- Stamina enhancement\n\n\n                    Context: \n                    This excerpt discusses key physical effects of MDMA, emphasizing physical euphoria as a core component of the experience that promotes social disinhibition and hyperactivity when used responsibly. It also mentions stamina enhancement as an associated physical benefit. These effects are relevant to understanding MDMA's characteristic stimulant and entactogenic profile within the broader pharmacological and subjective effects detailed in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_18", "document_index": 267, "latency_s": 0.8038425999984611, "prompt_toks": 8287, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stimulation - MDMA is popularly known for being stimulating and energetic. This encourages activities such as running, walking, climbing and dancing in a way that makes MDMA a popular choice for musical events such as festivals and raves or general nightlife activities. The distinct style of stimulation which MDMA presents can be described as forced. This means that at higher doses, it becomes difficult or impossible to keep still as jaw clenching, involuntarily body shakes and vibrations become present, resulting in an unsteadiness of the hands and a general lack of motor control. Unlike most other stimulants, however, the stimulating effects of MDMA can also paradoxically be accompanied by persistent or wave-like feelings of deep sedation and relaxation , depending on the dose, with lower doses exemplifying a more relaxing or sedative quality. However in moderate to high doses it acts more similar to traditional stimulants; resulting in a nearly invariable desire to move around\n\n\n                    Context: \n                    This excerpt details the physical and stimulant effects of MDMA, highlighting its energizing properties, impact on motor control, and paradoxical feelings of relaxation at varying doses. It is a key section within the overall discussion of MDMA’s physical effects, providing specific insights into its stimulation profile crucial for understanding its behavioral and physiological impact during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_19", "document_index": 267, "latency_s": 1.276860800004215, "prompt_toks": 8218, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    lower doses exemplifying a more relaxing or sedative quality. However in moderate to high doses it acts more similar to traditional stimulants; resulting in a nearly invariable desire to move around and engage in various kinds of mobile activities. This encouraged style of stimulation for some individuals is well reputed for resulting  very physically active behaviors such as dancing if said user is inclined or open to such activities. However, it is also not uncommon for people with general social prejudices against dance behavior to suddenly become much more openminded to the idea once under the influence of a sufficient (moderate) dose of MDMA.\n\n\n                    Context: \n                    This section describes the physical stimulation effects of MDMA at varying doses, highlighting that lower doses tend to produce a relaxing or sedative sensation, while moderate to high doses induce more traditional stimulant properties that increase movement and activity. It emphasizes the drug's ability to promote physically active behaviors like dancing and notes how it can influence users' social openness toward such activities. This information is relevant for understanding MDMA's dose-dependent physical and social effects detailed throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_20", "document_index": 267, "latency_s": 1.0231233000085922, "prompt_toks": 8226, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Tactile enhancement - MDMA produces distinct enhancements to tactile sensations. Users commonly report a sense of softness and fuzziness draping over their skin. Likewise, touching soft and fuzzy objects such as shag rugs can become irresistibly pleasurable and satisfying. MDMA-type tactile enhancement appears to be an effect unique to the entactogen class and may be a serotonin-related effect. Although it is also worth noting that many experimenters of the drug find that the tactile effects (especially in regards to pleasure) have often been notably exaggerated by other users, with some of these proponents even claiming borderline “orgasmic” sensations associated with physical touch.\n\n\n                    Context: \n                    This section details MDMA's tactile effects, highlighting its ability to enhance touch sensations, such as softness and fuzziness, which are characteristic of its entactogenic class. It notes that these tactile enhancements can be notably exaggerated by users, with some claiming near-orgasmic sensations. This information is relevant for understanding the physical experiential aspects and subjective effects of MDMA.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_21", "document_index": 267, "latency_s": 1.0511095999972895, "prompt_toks": 8264, "completion_toks": 57}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Teeth grinding [39] - This effect when experienced alongside the cognitive and physical euphoria can often lead to users mildly or intensely clenching their jaw muscles, sometimes even to the point where the individual’s facial expression begins to change. This is sometimes colloquially called “gurning”. This particular effect is to be the reason that people take MDMA at raves use pacifiers or chew gum since intense gurning can lead to many users biting excessively hard on their lips. [40] and is typically only experienced in moderate to high dosages. For other individuals, especially if they are prone to experience the paradoxical feelings of muscle relaxation, bruxism may not be as pronounced.\n- Temperature regulation suppression - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section.\n- Vasoconstriction\n\n\n                    Context: \n                    This excerpt discusses physical effects of MDMA, focusing on muscle-related issues such as teeth grinding (“gurning”) and bruxism, and includes vital information on temperature regulation suppression and vasoconstriction, highlighting health risks associated with physical overstimulation and thermoregulation during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_22", "document_index": 267, "latency_s": 1.0465592999971705, "prompt_toks": 8258, "completion_toks": 57}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Temperature regulation suppression - Avoid drinking too much water, see the water intoxication and electrolyte imbalance section.\n- Vasoconstriction\n- Vibrating vision - At high doses, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion, causing the vision to become blurry and temporarily out of focus. This is a condition known as nystagmus .\nCognitive effects: - The general head space of MDMA is described by many as one of pronounced mental stimulation, feelings of love or platonic affection, empathy, talkativeness, openness to novel social interactions and a pronounced sense of invigoration, revitalization and euphoric pleasure. It is capable of producing a large number of cognitive effects that are typically associated with entactogens and stimulants .\n\n\n                    Context: \n                    This section details key physical and cognitive effects of MDMA, including temperature regulation issues, vasoconstriction, vibrating vision (nystagmus), and its impact on mental state, such as heightened stimulation, empathy, and talkativeness, highlighting important safety considerations and typical subjective experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_23", "document_index": 267, "latency_s": 1.1716070999973454, "prompt_toks": 8273, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The most prominent of these effects include: Amnesia - Very high doses of MDMA can sometimes cause partial amnesia. Anxiety suppression - Although the initial, but very brief coming-up stage can actually be characterized by mild or notable anxiety , this component is virtually always soon after replaced by a thoroughly well-rounded and/or major suppression of anxiety and feelings of worry. Cognitive euphoria - Strong affective euphoria and feelings of happiness and significant increases in positive mood and optimism are nearly universally present with MDMA and are likely a direct result of the increased concentration of serotonin release, as well as norepinephrine , and dopamine increases to a lesser extent. [ citation needed ] Compulsive redosing Creativity enhancement - Although this is a very common effect, it evidently appears to be more prevalent amongst those with certain personality types or particular types of creative endeavors (such as music production rather than composing\n\n\n                    Context: \n                    This chunk summarizes key psychological and cognitive effects of MDMA, including amnesia at high doses, anxiety suppression after initial agitation, euphoria, and creativity enhancement. It highlights the prominence of these subjective experiences within the broader discussion of MDMA's effects, vital for understanding its impact on mental state and behavior. These details are essential for users and researchers assessing MDMA's psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_24", "document_index": 267, "latency_s": 0.7247287999925902, "prompt_toks": 8285, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    a very common effect, it evidently appears to be more prevalent amongst those with certain personality types or particular types of creative endeavors (such as music production rather than composing literary works for instance). It’s also usually regarded as being a less notable effect when compared to genuine psychedelic compounds. Decreased libido [41] [42] [43] Delirium & Confusion - This effect typically only occurs with overly high doses, and is associated with temperature dysregulation and overheating, particularly when MDMA is taken in crowded, physically strenuous environments that leaves the user unable to cool off, rest, or rehydrate adequately. Disinhibition - This effect can be extremely powerful and is exemplified by (sometimes unrestrained) degrees of increased sociability, loquaciousness and exceptional confidence in regards to amicability and willingness to communicate openly with strangers. It’s considered to be less “obnoxious“ and careless however than with acute\n\n\n                    Context: \n                    This excerpt discusses specific subjective and behavioral effects of MDMA, including decreased libido, delirium and confusion at high doses, and heightened disinhibition with increased sociability and confidence, emphasizing their occurrence, severity, and contextual relevance within MDMA’s overall psychological and physical impact profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_25", "document_index": 267, "latency_s": 1.0299794999882579, "prompt_toks": 8284, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    loquaciousness and exceptional confidence in regards to amicability and willingness to communicate openly with strangers. It’s considered to be less “obnoxious“ and careless however than with acute alcohol intoxication. Ego inflation - This can manifest in a number of ways (both positive and negative) but is often characterized by an increase in self-esteem and an exuberant sense of confidence. Individual personality type and a user’s natural neurochemistry can play a major role in the quality of this effect. Emotion enhancement - This effect typically is most heavily associated with the empathetic and affectionate aspects of MDMA although it tends to lack the sense of emotive sympathy and psycho-emotional vulnerability present in most psychedelics or even cannabis , with some users even reporting little to no meaningful change or augmentation in emotions. It is not uncommonly perceived as being more of an increase in understanding of others’ dispositions rather than deep heartfelt or\n\n\n                    Context: \n                    This excerpt discusses the psychological and emotional effects of MDMA, highlighting enhanced social behaviors, ego inflation, and increased understanding of others' dispositions, while noting that these effects often lack deep emotional vulnerability compared to psychedelics. It is relevant for understanding MDMA's influence on cognition and empathy, and improves searchability related to MDMA's psychological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_26", "document_index": 267, "latency_s": 1.1164951999962796, "prompt_toks": 8276, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    little to no meaningful change or augmentation in emotions. It is not uncommonly perceived as being more of an increase in understanding of others’ dispositions rather than deep heartfelt or visceral ‘feelings’ such as compassion or pity. Empathy, affection, and sociability enhancement - This particular and largely characteristic effect is usually more consistent, pronounced, functional, powerful and therapeutic with MDMA than with any other known substance. It is the most evident and noticeable effect within any MDMA experience and dominates the headspace. Over time and with repeated use, however, this effect becomes substantially diminished as the perspective it instills becomes fully grounded and already in place, making people feel merely stimulated and euphoric with no overtly newfound urges to communicate with others. Some users report that MDMA \"loses its magic\" with as few as ten experiences, while others have reported hundreds of uses before the empathic qualities disappear.\n\n\n                    Context: \n                    This excerpt details MDMA's characteristic emotional and empathic effects, highlighting its tendency to enhance feelings of empathy, affection, and sociability during the experience. It explains how these effects are typically pronounced and central to MDMA's headspace, but tend to diminish with repeated use, with some users reporting loss of these qualities after as few as ten uses. This information is relevant for understanding MDMA's psychological impact and the development of tolerance over time.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_27", "document_index": 267, "latency_s": 1.0989166999934241, "prompt_toks": 8275, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    urges to communicate with others. Some users report that MDMA \"loses its magic\" with as few as ten experiences, while others have reported hundreds of uses before the empathic qualities disappear. This does not appear to be valid for all users. However, many users report that they have not experienced any decrease in the novel qualities of the experience despite dozens or even hundreds of uses. Focus enhancement - Focus enhancement only occurs at low to moderate doses. Higher doses will usually impair attention and concentration, particularly during the \"come down\" phase of the experience. Immersion enhancement - This effect appears to be unusually pronounced in settings of exposure to music (especially formalized music-related events) or light-shows and similar types of visual or auditory displays. Increased music appreciation - This effect usually manifests itself through an increase in both the hedonic and thrillingly emotional impact of musical acoustic phenomena, often leading to\n\n\n                    Context: \n                    This excerpt discusses the long-term effects and individual variability of MDMA use, including the phenomenon of losing its empathic and social effects (\"losing its magic\") after multiple experiences. It also covers dose-dependent cognitive and sensory effects such as focus and immersion enhancement, particularly in musical settings. These details are relevant to understanding MDMA’s psychological impacts and user experience over repeated use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_28", "document_index": 267, "latency_s": 1.000772200000938, "prompt_toks": 8271, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    displays. Increased music appreciation - This effect usually manifests itself through an increase in both the hedonic and thrillingly emotional impact of musical acoustic phenomena, often leading to a “hyped“ or adrenaline rush type of feeling. For some users, an enhanced comprehension of subtle details in the music or a feeling of deeper understanding with regards to composition and lyrics has been reported what is essentially less common compared to many other hallucinogenic compounds. The overall effect is, for the most part mainly indicative of an all-around increased enthusiasm towards hearing music in general. Rarely, one may find music to be annoying or distracting rather than enhanced - this seems to be largely set and setting based and happens rarely. Mindfulness Motivation enhancement Reinvigoration Thought acceleration - This component can very effectively complement the social interactions and verbal communication with others that takes place during the experience. This is\n\n\n                    Context: \n                    This excerpt details MDMA's subjective effects on sensory perception, particularly highlighting increased music appreciation, emotional intensity, and mental stimulation. It is part of a comprehensive section on physical, cognitive, and sensory effects, emphasizing how MDMA enhances sensory enjoyment and social interaction, with notes on variability based on set and setting.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_29", "document_index": 267, "latency_s": 0.8580234999972163, "prompt_toks": 8210, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Reinvigoration Thought acceleration - This component can very effectively complement the social interactions and verbal communication with others that takes place during the experience. This is especially advantageous since this effect seems notably less manic, scatterbrained, ‘speedy’ and turbulent than with other stimulants; with many even describing it as feeling “smooth” and uniquely manageable. Time compression - Strong feelings of time compression are commonly produced by MDMA and subjectively speed up the experience of time passage to an unusually substantial degree; possibly more than any other commonly used recreational substance. Wakefulness\n\n\n                    Context: \n                    This section details MDMA's cognitive and sensory effects, specifically highlighting how it enhances reinvigoration, thought acceleration, and time compression, leading to a smoother, manageable stimulant experience with increased wakefulness. These effects are integral to understanding MDMA's impact on mental state and activity at peak doses.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_30", "document_index": 267, "latency_s": 0.7212128000101075, "prompt_toks": 8230, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Amnesia - Very high doses of MDMA can sometimes cause partial amnesia.\n- Anxiety suppression - Although the initial, but very brief coming-up stage can actually be characterized by mild or notable anxiety , this component is virtually always soon after replaced by a thoroughly well-rounded and/or major suppression of anxiety and feelings of worry.\n- Cognitive euphoria - Strong affective euphoria and feelings of happiness and significant increases in positive mood and optimism are nearly universally present with MDMA and are likely a direct result of the increased concentration of serotonin release, as well as norepinephrine , and dopamine increases to a lesser extent. [ citation needed ]\n- Compulsive redosing\n\n\n                    Context: \n                    This excerpt details some key cognitive and psychological effects of MDMA, including amnesia at high doses, anxiety suppression following initial anxiety, pervasive feelings of euphoria and positive mood, and the tendency for users to redose compulsively. It provides crucial information relevant to understanding MDMA's mental impact and user behavior, fitting within the broader discussion of its subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_31", "document_index": 267, "latency_s": 1.0072972000052687, "prompt_toks": 8237, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Compulsive redosing\n- Creativity enhancement - Although this is a very common effect, it evidently appears to be more prevalent amongst those with certain personality types or particular types of creative endeavors (such as music production rather than composing literary works for instance). It’s also usually regarded as being a less notable effect when compared to genuine psychedelic compounds.\n- Decreased libido [41] [42] [43]\n- Delirium & Confusion - This effect typically only occurs with overly high doses, and is associated with temperature dysregulation and overheating, particularly when MDMA is taken in crowded, physically strenuous environments that leaves the user unable to cool off, rest, or rehydrate adequately.\n\n\n                    Context: \n                    This section details specific cognitive and physiological effects of MDMA, including behaviors like compulsive redosing, as well as effects such as creativity enhancement, decreased libido, and confusion at high doses, often linked to overheating and temperature dysregulation in strenuous environments. These effects are important for understanding MDMA's mental impact and safety considerations during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_32", "document_index": 267, "latency_s": 0.859523100007209, "prompt_toks": 8225, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Disinhibition - This effect can be extremely powerful and is exemplified by (sometimes unrestrained) degrees of increased sociability, loquaciousness and exceptional confidence in regards to amicability and willingness to communicate openly with strangers. It’s considered to be less “obnoxious“ and careless however than with acute alcohol intoxication.\n- Ego inflation - This can manifest in a number of ways (both positive and negative) but is often characterized by an increase in self-esteem and an exuberant sense of confidence. Individual personality type and a user’s natural neurochemistry can play a major role in the quality of this effect.\n\n\n                    Context: \n                    This section discusses key subjective effects of MDMA related to social behavior and self-perception, including disinhibition—characterized by increased sociability, confidence, and openness—and ego inflation, which involves heightened self-esteem and confidence. These effects are central to the empathic and disinhibitory properties of MDMA described in the broader document on its effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_33", "document_index": 267, "latency_s": 0.7244400000054156, "prompt_toks": 8195, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Emotion enhancement - This effect typically is most heavily associated with the empathetic and affectionate aspects of MDMA although it tends to lack the sense of emotive sympathy and psycho-emotional vulnerability present in most psychedelics or even cannabis , with some users even reporting little to no meaningful change or augmentation in emotions. It is not uncommonly perceived as being more of an increase in understanding of others’ dispositions rather than deep heartfelt or visceral ‘feelings’ such as compassion or pity.\n\n\n                    Context: \n                    This section discusses how MDMA influences emotional states, highlighting its tendency to enhance empathy and affection without deepening visceral feelings or sympathy. It is part of a broader overview of MDMA's subjective effects, including physical, cognitive, sensory, and after-effects, providing detailed insights into the emotional modulation associated with the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_34", "document_index": 267, "latency_s": 0.8250821999972686, "prompt_toks": 8270, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Empathy, affection, and sociability enhancement - This particular and largely characteristic effect is usually more consistent, pronounced, functional, powerful and therapeutic with MDMA than with any other known substance. It is the most evident and noticeable effect within any MDMA experience and dominates the headspace. Over time and with repeated use, however, this effect becomes substantially diminished as the perspective it instills becomes fully grounded and already in place, making people feel merely stimulated and euphoric with no overtly newfound urges to communicate with others. Some users report that MDMA \"loses its magic\" with as few as ten experiences, while others have reported hundreds of uses before the empathic qualities disappear. This does not appear to be valid for all users. However, many users report that they have not experienced any decrease in the novel qualities of the experience despite dozens or even hundreds of uses.\n\n\n                    Context: \n                    This excerpt details the characteristic effects of MDMA related to empathy, sociability, and emotional connection, emphasizing its prominence during the experience and how repeated use can diminish these qualities over time, with some users reporting loss of \"magic\" after multiple uses. It contributes to the comprehensive overview of MDMA's subjective effects and potential long-term changes, highlighting its social and emotional impact. This section is relevant for understanding MDMA's psychological profile and considerations for responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_35", "document_index": 267, "latency_s": 0.7949397999909706, "prompt_toks": 8171, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Focus enhancement - Focus enhancement only occurs at low to moderate doses. Higher doses will usually impair attention and concentration, particularly during the \"come down\" phase of the experience.\n- Immersion enhancement - This effect appears to be unusually pronounced in settings of exposure to music (especially formalized music-related events) or light-shows and similar types of visual or auditory displays.\n\n\n                    Context: \n                    This excerpt addresses the cognitive and sensory effects of MDMA, specifically focusing on enhancement of attention and immersion, which are dose-dependent and environment-sensitive. It highlights how low to moderate doses can improve focus and how certain settings like music or light-shows can significantly amplify immersion experiences, making these effects relevant for understanding MDMA's perceptual and behavioral impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_36", "document_index": 267, "latency_s": 1.227592299997923, "prompt_toks": 8249, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased music appreciation - This effect usually manifests itself through an increase in both the hedonic and thrillingly emotional impact of musical acoustic phenomena, often leading to a “hyped“ or adrenaline rush type of feeling. For some users, an enhanced comprehension of subtle details in the music or a feeling of deeper understanding with regards to composition and lyrics has been reported what is essentially less common compared to many other hallucinogenic compounds. The overall effect is, for the most part mainly indicative of an all-around increased enthusiasm towards hearing music in general. Rarely, one may find music to be annoying or distracting rather than enhanced - this seems to be largely set and setting based and happens rarely.\n- Mindfulness\n- Motivation enhancement\n- Reinvigoration\n\n\n                    Context: \n                    This section discusses the cognitive and sensory effects of MDMA, specifically highlighting how it enhances music appreciation by increasing emotional impact and subjective understanding of music. It also mentions related mental states such as mindfulness, motivation enhancement, and reinvigoration, placing these effects within the broader context of MDMA’s psychological influence. These effects are key to understanding MDMA’s unique entactogenic profile and its influence on social and perceptual experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_37", "document_index": 267, "latency_s": 1.3779319000022952, "prompt_toks": 8232, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Mindfulness\n- Motivation enhancement\n- Reinvigoration\n- Thought acceleration - This component can very effectively complement the social interactions and verbal communication with others that takes place during the experience. This is especially advantageous since this effect seems notably less manic, scatterbrained, ‘speedy’ and turbulent than with other stimulants; with many even describing it as feeling “smooth” and uniquely manageable.\n- Time compression - Strong feelings of time compression are commonly produced by MDMA and subjectively speed up the experience of time passage to an unusually substantial degree; possibly more than any other commonly used recreational substance.\n- Wakefulness\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This excerpt features cognitive and experiential effects of MDMA, including mindfulness, motivation, mental reinvigoration, thought acceleration, and time compression, highlighting their roles in user experience. It provides detailed descriptions of how these effects enhance social interactions and perception of time, and is part of a broader discussion on MDMA's subjective and psychological impacts within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_38", "document_index": 267, "latency_s": 1.2481243000074755, "prompt_toks": 8289, "completion_toks": 95}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - The visual effects of MDMA occur more selectively and less consistently than any of the traditional psychedelics . This has resulted in many people disregarding the psychedelic aspects of MDMA as a myth, rumor or negligible effect despite a large body of anecdotal reports suggesting otherwise. The (often mild) hallucinatory effects cannot be guaranteed to manifest themselves, but are the most likely to occur with chemically pure MDMA at high doses, as well as towards the end of the experience; particularly if the user has been smoking cannabis . The visuals during the offset are usually characterized by closed eye visuals (CEVs) such as typical psychedelic-like pattering. Whereas during the peak effects, the visuals tend to be more similar to the open eye distortions of standard psychedelics, albeit in much more mildly and less vivid form. They also seem more likely to occur if the user has prior experience with psychedelics . Enhancements MDMA presents an array of\n\n\n                    Context: \n                    This excerpt details the visual effects of MDMA, highlighting their selective and inconsistent nature compared to classic psychedelics, and notes that mild hallucinations are more likely at high doses, during the offset, or with cannabis use. It emphasizes that visual distortions during peak effects resemble those of psychedelics but are generally less vivid, and that prior psychedelic experience can influence visual phenomena. This information is crucial for understanding MDMA’s sensory enhancement profile within the broader discussion of its subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_39", "document_index": 267, "latency_s": 1.0733984999969834, "prompt_toks": 8273, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    standard psychedelics, albeit in much more mildly and less vivid form. They also seem more likely to occur if the user has prior experience with psychedelics . Enhancements MDMA presents an array of sensory enhancements, with typically modest visual enhancements which are characteristically mild in comparison to standard psychedelics, but are still distinctly present unlike other classical stimulants. These generally include: Colour enhancement - This is exceptionally intense for MDMA when exposed to the very bright or neon colors;  particularly when viewing radiant or luminescent colors such as with glow sticks. Pattern recognition enhancement - Although similar or associated compounds are noted for inducing pareidolia (ubiquitously perceiving patterns in random visual stimuli); MDMA rather just enhances the quality, sharpness and aesthetic appreciation for already patterned surfaces and designs. Suppressions Double vision Distortions Tracers Symmetrical texture repetition Geometry\n\n\n                    Context: \n                    This section discusses MDMA's visual and sensory effects, emphasizing its typically mild and less vivid visual enhancements compared to classic psychedelics. Key effects include intense color enhancement, pattern recognition, and various visual suppressions such as distortions and tracers. It highlights how these visual phenomena are often subtle, especially relative to other psychedelic substances, and are more likely in individuals with prior psychedelic experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_40", "document_index": 267, "latency_s": 1.0372178999969037, "prompt_toks": 8291, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    just enhances the quality, sharpness and aesthetic appreciation for already patterned surfaces and designs. Suppressions Double vision Distortions Tracers Symmetrical texture repetition Geometry The visual geometry produced by MDMA can be characterized as more similar in appearance to that of psilocin than LSD . It can be comprehensively described through its variations as primarily intricate in complexity, abstract in form, organic in style, structured in organization, dimly lit in lighting, mostly monotone in colour with blues and greys, glossy in shading, sharp in edges, small in size, fast in speed, smooth in motion, equal in round and angular corners, non-immersive in-depth and consistent in intensity. At higher doses, they are significantly more likely to give rise to states of level 8A visual geometry over level 8B . Many users report that MDMA geometry presents itself with dark and menacing emotional vibes with a synthetic and nerve-racking feel to them. Hallucinatory states\n\n\n                    Context: \n                    This excerpt details the visual effects of MDMA, emphasizing its modest visual enhancements and common distortions such as double vision, tracers, and geometric patterns. It describes the characteristics of MDMA-induced visuals, comparing their appearance to psilocin rather than classical psychedelics like LSD, and notes dose-dependent variations and potential emotional qualities of the visuals. This information is relevant within the broader discussion of MDMA's sensory and perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_41", "document_index": 267, "latency_s": 2.0329506999987643, "prompt_toks": 8280, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    8A visual geometry over level 8B . Many users report that MDMA geometry presents itself with dark and menacing emotional vibes with a synthetic and nerve-racking feel to them. Hallucinatory states MDMA is capable of producing a unique range of low and high-level hallucinatory states in a fashion that is significantly less consistent and reproducible than that of virtually all other commonly used psychedelics . These effects are far more common either during the peak effects or the offset of the experience and commonly include: External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect shares many similarities to those produced by deliriant substances, but does not manifest itself consistently and usually happens only at heavy, likely toxic doses and is therefore not considered a typical or healthy sign when experiencing MDMA’s visuals. It can be comprehensively described through its variations\n\n\n                    Context: \n                    This excerpt describes MDMA's visual hallucination effects, focusing on high-dose geometric visuals and hallucinatory states that emerge primarily during peak or offset phases. It details the nature of complex, often dark or menacing imagery, including autonomous entity hallucinations at potentially toxic doses, highlighting the variability and potential health risks associated with these visual phenomena within the broader discussion of MDMA's subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_42", "document_index": 267, "latency_s": 1.2030188999924576, "prompt_toks": 8280, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    happens only at heavy, likely toxic doses and is therefore not considered a typical or healthy sign when experiencing MDMA’s visuals. It can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. They usually follow themes of memory replays and semi-realistic or expected events. For example, people could be casually holding objects or performing actions which one would expect them to be in real life before disappearing and dissolving under further inspection. Common examples of this include seeing people wearing glasses, or hats when they are not and mistaking objects for human beings or animals. Internal hallucinations - The internal hallucinations which MDMA induces are only present as spontaneous breakthroughs at extremely high doses. [ citation needed ] This effect's variations are delirious in believability, interactive in style, new experiences in content, autonomous in controllability and solid in\n\n\n                    Context: \n                    This excerpt details high-dose visual and hallucination effects of MDMA, emphasizing effects that occur only at toxic levels, such as delirious, autonomous, and semi-realistic hallucinations, including themes like memory replays and object misidentification. It highlights that internal hallucinations are rare and typically only at extremely high doses. This section is crucial for understanding the potential dangers and the nature of rare, heavy-dose hallucinations associated with MDMA.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_43", "document_index": 267, "latency_s": 1.292182099990896, "prompt_toks": 8240, "completion_toks": 57}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    at extremely high doses. [ citation needed ] This effect's variations are delirious in believability, interactive in style, new experiences in content, autonomous in controllability and solid in appearance. The most common way in which they manifest themselves is through hypnagogic scenarios which the user may experience as they are drifting off to sleep after a night of use; these can usually be described as memory replay from the previous several hours. These are brief and fleeting, but frequent and completely believable and convincing as they happen. In terms of the theme, they often are in the form of conversations with people or instead manifest as bizarre and extremely nonsensical plots. Peripheral information misinterpretation [ citation needed ]\n\n\n                    Context: \n                    This excerpt describes high-dose visual and hallucination effects of MDMA, specifically focusing on internal hypnagogic scenarios and their characteristics, including memory replay and nonsensical plots, which are part of MDMA’s complex visual hallucination profile detailed in the visual effects section of the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_44", "document_index": 267, "latency_s": 1.114471400011098, "prompt_toks": 8197, "completion_toks": 88}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Colour enhancement - This is exceptionally intense for MDMA when exposed to the very bright or neon colors;  particularly when viewing radiant or luminescent colors such as with glow sticks.\n- Pattern recognition enhancement - Although similar or associated compounds are noted for inducing pareidolia (ubiquitously perceiving patterns in random visual stimuli); MDMA rather just enhances the quality, sharpness and aesthetic appreciation for already patterned surfaces and designs.\n- Double vision\n- Tracers\n- Symmetrical texture repetition\n\n\n                    Context: \n                    This excerpt details MDMA's visual effects, including enhancements like color intensification, pattern recognition, and visual distortions such as double vision, tracers, and symmetrical texture repetition. These effects are part of MDMA's broader sensory and visual phenomena, which tend to be mild compared to classic psychedelics but are notable at higher doses or in certain environments. Understanding these visual effects aids in comprehending MDMA's perceptual impact and harm profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_45", "document_index": 267, "latency_s": 0.9979602999956114, "prompt_toks": 8276, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Symmetrical texture repetition\n- External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect shares many similarities to those produced by deliriant substances, but does not manifest itself consistently and usually happens only at heavy, likely toxic doses and is therefore not considered a typical or healthy sign when experiencing MDMA’s visuals. It can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. They usually follow themes of memory replays and semi-realistic or expected events. For example, people could be casually holding objects or performing actions which one would expect them to be in real life before disappearing and dissolving under further inspection. Common examples of this include seeing people wearing glasses, or hats when they are not and mistaking objects for human beings or animals.\n\n\n                    Context: \n                    This excerpt details visual hallucinations associated with MDMA use, highlighting phenomena such as symmetrical texture repetition and autonomous entity hallucinations that occur at high, often toxic doses. It emphasizes that these effects are inconsistent, typically linked to heavy dosing, and include themes like memory replay and misperceptions of objects or people, providing critical information on MDMA's perceptual effects and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_46", "document_index": 267, "latency_s": 0.6732809999957681, "prompt_toks": 8260, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucinations - The internal hallucinations which MDMA induces are only present as spontaneous breakthroughs at extremely high doses. [ citation needed ] This effect's variations are delirious in believability, interactive in style, new experiences in content, autonomous in controllability and solid in appearance. The most common way in which they manifest themselves is through hypnagogic scenarios which the user may experience as they are drifting off to sleep after a night of use; these can usually be described as memory replay from the previous several hours. These are brief and fleeting, but frequent and completely believable and convincing as they happen. In terms of the theme, they often are in the form of conversations with people or instead manifest as bizarre and extremely nonsensical plots.\n- Peripheral information misinterpretation [ citation needed ]\n\n\n                    Context: \n                    This excerpt details the internal and external hallucinations associated with MDMA use, highlighting the rare occurrence of internal hypnagogic scenarios at extremely high doses and mentioning peripheral information misinterpretation. It complements the document’s comprehensive overview of MDMA's visual and hallucinatory effects, emphasizing the variability and safety considerations of such hallucinations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_47", "document_index": 267, "latency_s": 0.9515318000048865, "prompt_toks": 8226, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Peripheral information misinterpretation [ citation needed ]\nAuditory effects: - Enhancements Hallucinations Distortions Tinnitus - Tinnitus is rarely reported, but typically manifests as a muffled roaring in the ears, affected by whether the user is upright or laying down. It is most commonly reported when using in conjunction with other substances but can manifest on its own at higher doses. This may be accompanied by partial or total, yet highly temporary (on the order of a minute), hearing loss, especially when standing. Some users have reported acquiring permanent tinnitus after abuse.\n- Enhancements\n- Hallucinations\n- Distortions\n\n\n                    Context: \n                    This excerpt details the auditory effects associated with MDMA use, including common enhancements, hallucinations, distortions, and the rarely reported tinnitus that may involve temporary or permanent hearing issues. It fits into the overall document's comprehensive overview of MDMA's physical and sensory effects, emphasizing auditory sensory distortions and potential risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_48", "document_index": 267, "latency_s": 1.0986275000032037, "prompt_toks": 8210, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Enhancements\n- Hallucinations\n- Distortions\n- Tinnitus - Tinnitus is rarely reported, but typically manifests as a muffled roaring in the ears, affected by whether the user is upright or laying down. It is most commonly reported when using in conjunction with other substances but can manifest on its own at higher doses. This may be accompanied by partial or total, yet highly temporary (on the order of a minute), hearing loss, especially when standing. Some users have reported acquiring permanent tinnitus after abuse.\nMulti-sensory effects:\n\n\n                    Context: \n                    This section details the sensory and auditory effects associated with MDMA, including visual enhancements, hallucinations, distortions, and rare tinnitus occurrences. It emphasizes the variability and potential risks of perceptual changes, highlighting the importance of understanding these effects in the context of MDMA's overall physical and sensory impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_49", "document_index": 267, "latency_s": 0.7054522000107681, "prompt_toks": 8285, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Multi-sensory effects: \nTranspersonal effects: - Existential self-realization - Although relatively common, this effect is not as pronounced, convicting or as consistent when compared to hallucinogens such as mescaline , psilocybin , LSD or MXE . This component has a unique quality within MDMA in that it almost always comes about in the form of self-affirmation, individual agency and a personal appreciation for one’s self as well as others. Unity and interconnectedness - Experiences of lower-level unity and interconnectedness are commonly produced by MDMA, although in a much less abstract or ‘metaphysical’ form than compounds like LSD . This MDMA effect most consistently manifests itself within large crowds at raves and musical events in the form of \"becoming one with the crowd.\" Music is said to consistently intensify this effect as well and can be considered very memorable and a defining feature of the experience’s peak.\n\n\n                    Context: \n                    This section outlines MDMA's multi-sensory and transpersonal effects, highlighting experiences of existential self-realization and feelings of unity and interconnectedness. These effects are less intense than classic hallucinogens but are commonly reported during MDMA use, especially in social and musical settings, forming a key aspect of its peak experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_50", "document_index": 267, "latency_s": 0.609721000000718, "prompt_toks": 8279, "completion_toks": 46}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Existential self-realization - Although relatively common, this effect is not as pronounced, convicting or as consistent when compared to hallucinogens such as mescaline , psilocybin , LSD or MXE . This component has a unique quality within MDMA in that it almost always comes about in the form of self-affirmation, individual agency and a personal appreciation for one’s self as well as others.\n- Unity and interconnectedness - Experiences of lower-level unity and interconnectedness are commonly produced by MDMA, although in a much less abstract or ‘metaphysical’ form than compounds like LSD . This MDMA effect most consistently manifests itself within large crowds at raves and musical events in the form of \"becoming one with the crowd.\" Music is said to consistently intensify this effect as well and can be considered very memorable and a defining feature of the experience’s peak.\nDisconnective effects:\n\n\n                    Context: \n                    This section details MDMA's transpersonal effects, highlighting experiences of existential self-realization and interconnectedness, especially in social settings like raves, and notes the variability and less pronounced nature of these effects compared to classical hallucinogens.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_51", "document_index": 267, "latency_s": 0.7907426000019768, "prompt_toks": 8280, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    After effects: - The effects which occur during the offset of an entactogen or stimulant experience generally feel negative and uncomfortable in comparison to the effects which occurred during its peak . This is often referred to as a \"comedown\" and is thought to occur because of neurotransmitter depletion. Although, it has been more and more commonly recognized in recent years that the true “hangover” for MDMA, especially in regards to the depression tends to actually ‘skip a day’ due to the brain supposedly still releasing substantial amounts of serotonin the day after which likely explains the “afterglow” effect which is eventually later replaced by a genuine hangover and uncomfortable emotional effects. These effects commonly include: Anxiety Appetite suppression Brain zaps Cognitive fatigue Depression - Can be anywhere from mild to severe and is usually most severe during the initial comedown after the main effects abruptly end rather than during the following days. With that\n\n\n                    Context: \n                    This excerpt discusses the after effects of MDMA use, including common negative feelings during the comedown such as depression, anxiety, and fatigue, as well as recent insights into the \"afterglow\" phenomenon where some positive mood persists. It is relevant to the overall document's section on MDMA's physical and psychological impacts, providing detailed information on post-experience emotional states and their underlying mechanisms.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_52", "document_index": 267, "latency_s": 1.0475430999940727, "prompt_toks": 8276, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    fatigue Depression - Can be anywhere from mild to severe and is usually most severe during the initial comedown after the main effects abruptly end rather than during the following days. With that said however, the depression in the following days is still usually noticeable and can last up to a week. Derealization Dream suppression or Dream potentiation - Although this substance have been known to suppress dreaming, some users note extremely strange and sometimes scary dreams for several nights after taking large doses of MDMA. Sleep paralysis - Some users report a higher incidence of experiencing sleep paralysis after consuming MDMA. Headache - Headaches the day after overuse are very commonly reported and result from a combination of electrolyte imbalance and physical strain Irritability Motivation suppression Thought deceleration Thought disorganization Suicidal ideation Wakefulness As stated above, individuals may experience an afterglow effect, especially when MDMA is used in a\n\n\n                    Context: \n                    This chunk summarizes MDMA's after-effects, including depression, derealization, sleep paralysis, headaches, irritability, and motivation suppression that occur during the comedown and days afterward. It highlights potential emotional and physical withdrawal symptoms, making it relevant for understanding MDMA's toxicity and harm potential in the full drug profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_53", "document_index": 267, "latency_s": 1.027701099999831, "prompt_toks": 8269, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Motivation suppression Thought deceleration Thought disorganization Suicidal ideation Wakefulness As stated above, individuals may experience an afterglow effect, especially when MDMA is used in a therapeutic context and harm reduction measures are properly adhered to. Some users have even utilized “recovery protocols” such as smoothies and other consumables made with certain ingredients to alleviate some of the symptoms present in shortages of neurotransmitter. That said, afterglows will often give-way to more frequent or even progressively worse comedowns if one's MDMA use becomes more frequent or excessive over time. It is a misconception however that some users experience either only afterglows or only comedowns/crashes when many, if not most users tend to experience both; just in a biphasic order. Such afterglow effects include: Rejuvenation Euthymia\n\n\n                    Context: \n                    This excerpt details the aftereffects of MDMA use, emphasizing the typical biphasic pattern of afterglow and comedown experiences. It discusses post-use symptoms like motivation suppression, thought disorganization, and potential mood improvements such as rejuvenation and euthymia. The section also highlights harm reduction strategies and clarifies misconceptions about the sequence of afterglow and crash effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_54", "document_index": 267, "latency_s": 0.809286699994118, "prompt_toks": 8295, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety\n- Appetite suppression\n- Brain zaps\n- Cognitive fatigue\n- Depression - Can be anywhere from mild to severe and is usually most severe during the initial comedown after the main effects abruptly end rather than during the following days. With that said however, the depression in the following days is still usually noticeable and can last up to a week.\n- Derealization\n- Dream suppression or Dream potentiation - Although this substance have been known to suppress dreaming, some users note extremely strange and sometimes scary dreams for several nights after taking large doses of MDMA.\n- Sleep paralysis - Some users report a higher incidence of experiencing sleep paralysis after consuming MDMA.\n- Headache - Headaches the day after overuse are very commonly reported and result from a combination of electrolyte imbalance and physical strain\n- Irritability\n- Motivation suppression\n- Thought deceleration\n- Thought disorganization\n- Suicidal ideation\n- Wakefulness\n- Rejuvenation\n\n\n                    Context: \n                    This excerpt lists common aftereffects experienced during the MDMA comedown and recovery phase, including emotional, cognitive, and physical symptoms such as depression, sleep disturbances, headaches, and irritability. It provides detailed descriptions of these potential lingering effects, which are critical for understanding MDMA's after-effects and harm reduction. The information is essential for users and researchers seeking comprehensive insights into post-use experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 38, "doc_id": "doc_267", "num_chunks": 56, "chunk_id": "267::chunk_55", "document_index": 267, "latency_s": 0.8296480999997584, "prompt_toks": 8168, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Irritability\n- Motivation suppression\n- Thought deceleration\n- Thought disorganization\n- Suicidal ideation\n- Wakefulness\n- Rejuvenation\n- Euthymia\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk lists various aftereffects and potential effects associated with MDMA use, including mood, cognitive, and behavioral changes such as irritability, motivation suppression, thought deceleration, disorganization, and suicidal ideation, as well as technical aspects like reagent results, preparation methods, research, legal issues, and paradoxical effects, situating it within the comprehensive discussion of MDMA's aftereffects, toxicity, and harm potential.\n                "}
