{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_0", "document_index": 271, "latency_s": 0.7909225000039442, "prompt_toks": 1634, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Methadone\npsychonaut_name: Methadone\npsychonaut_url: https://psychonautwiki.org/wiki/Methadone\n\n\n                    Context: \n                    This chunk provides basic identification details for methadone, including its name, URL, and classification, serving as an introductory reference within the comprehensive drug profile. It helps locate the specific page on psychonautwiki and contextualizes methadone's identity within the broader detailed effects, chemistry, and safety information.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_1", "document_index": 271, "latency_s": 0.9816019999998389, "prompt_toks": 1884, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Methadone | Chemical Nomenclature | Common names | Methadone, Dolophine, Methadose | Systematic name | (RS)-6-(dimethylamino)-4,4-diphenylheptan-3-one | Class Membership | Psychoactive class | Opioid | Chemical class | Diphenylpropylamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 40-99% | Threshold | 1 mg | Light | 3 - 5 mg | Common | 5 - 15 mg | Strong | 15 - 30 mg | Heavy | 30 mg + | Duration | Total | 10 - 19 hours | Onset | 20 - 90 minutes | Come up | 2 - 4 hours | Peak | 4 - 6 hours | Offset | 4 - 6 hours | After effects | 1 - 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP\n\n\n                    Context: \n                    This excerpt is the infobox section of the webpage detailing key pharmacological and chemical information about methadone, including its common names, chemical structure, administration routes, dosage guidelines, duration, and interactions. It provides a quick reference summary that complements the full text on methadone’s effects, toxicity, and legal status, enhancing efficient retrieval of essential data about this opioid.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_2", "document_index": 271, "latency_s": 0.83203949999006, "prompt_toks": 1701, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | SNRIs | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine | MXE | Tramadol | Grapefruit | MAOIs | Serotonin releasers | SSRIs | 5-HTP\n\n\n                    Context: \n                    This excerpt details substance interaction information related to methadone, listing various drugs and substances that may interact with it. It is relevant within the document as part of the guidance on safe use and potential risks associated with methadone, emphasizing the importance of understanding drug interactions for harm reduction and educational purposes.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_3", "document_index": 271, "latency_s": 0.6306702000001678, "prompt_toks": 1646, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk lists the main sections of the webpage, including Summary, Contents, Chemistry, Pharmacology, Subjective effects, Toxicity and harm potential, Legal status, See also, External links, and References, serving as an overview of the comprehensive information on methadone covered throughout the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_4", "document_index": 271, "latency_s": 0.8986450999946101, "prompt_toks": 1805, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - The general sensation of methadone can be described as one of immense euphoria, relaxation, anxiety suppression and pain relief. Sedation - This leads to the trademark \"nodding off\" effect, but it is usually milder compared to that of diacetylmorphine (heroin) Pain relief Physical euphoria - This particular substance can be considered moderately intense, more commonly with the L-enantiomer, in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin), and definitely stronger than that of other synthetic opioids such as tramadol . The sensation itself can be described as extreme feelings of intense physical comfort, extreme warmth, love and bliss. Itchiness Respiratory depression - At low to moderate doses, this effect results in the sensation that the breath is slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of\n\n\n                    Context: \n                    This chunk provides a detailed overview of the physical effects of methadone, including sensations of euphoria, relaxation, pain relief, sedation, and respiratory depression at varying doses. It is a concise segment within the broader document that covers methadone's effects on the body, complementing sections on its subjective, cognitive, and adverse effects for comprehensive understanding.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_5", "document_index": 271, "latency_s": 0.7408073999977205, "prompt_toks": 1740, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    that the breath is slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe overdoses can result in a coma or death without immediate medical attention. Constipation Cough suppression Difficulty urinating Nausea Sedation Pupil constriction Decreased libido Appetite suppression Orgasm suppression Abnormal heartbeat - A rare but potentially fatal side effect of methadone's potential to prolong the QT interval. Torsades de pointes is an abnormal heart rhythm which can lead to sudden cardiac death. [9]\n\n\n                    Context: \n                    This excerpt details the physical and respiratory effects of methadone, including its potential to cause respiratory depression at high doses, as well as common side effects like constipation, nausea, sedation, and sexual dysfunction, highlighting serious risks such as abnormal heart rhythms and the need for caution during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_6", "document_index": 271, "latency_s": 0.7186803999939002, "prompt_toks": 1730, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - This leads to the trademark \"nodding off\" effect, but it is usually milder compared to that of diacetylmorphine (heroin)\n- Pain relief\n- Physical euphoria - This particular substance can be considered moderately intense, more commonly with the L-enantiomer, in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin), and definitely stronger than that of other synthetic opioids such as tramadol . The sensation itself can be described as extreme feelings of intense physical comfort, extreme warmth, love and bliss.\n- Itchiness\n\n\n                    Context: \n                    This excerpt summarizes methadone's physical effects, including sedation, pain relief, moderate to strong physical euphoria mainly with the L-enantiomer, and itching. It is a key section describing the drug's primary subjective experiences and side effects, providing important details for understanding its intensity and impact. This information aids in identifying methadone's characteristic effects for research, safety, and harm reduction purposes.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_7", "document_index": 271, "latency_s": 0.6182706999970833, "prompt_toks": 1781, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Itchiness\n- Respiratory depression - At low to moderate doses, this effect results in the sensation that the breath is slowed down mildly to moderately, but does not cause noticeable impairment. At high doses and overdoses, opioid-induced respiratory depression can result in a shortness of breath, abnormal breathing patterns, semi-consciousness, or unconsciousness. Severe overdoses can result in a coma or death without immediate medical attention.\n- Constipation\n- Cough suppression\n- Difficulty urinating\n- Nausea\n- Sedation\n- Pupil constriction\n- Decreased libido\n- Appetite suppression\n- Orgasm suppression\n- Abnormal heartbeat - A rare but potentially fatal side effect of methadone's potential to prolong the QT interval. Torsades de pointes is an abnormal heart rhythm which can lead to sudden cardiac death. [9]\n\n\n                    Context: \n                    This chunk lists common physical and cardiovascular side effects of methadone, including itchiness, respiratory depression, constipation, nausea, sedation, pupil constriction, decreased libido, and potentially fatal abnormal heartbeat due to QT prolongation, emphasizing the drug's toxicity profile within the overall discussion of methadone's effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_8", "document_index": 271, "latency_s": 0.9870737999881385, "prompt_toks": 1722, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - Cognitive euphoria - This particular substance can be considered as less intense in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin), but the L-enantiomer (levomethadone) is way stronger and can be considered almost equal to diacetylmorphine . Both enantiomers, ultimately, are stronger than other synthetic opioids such as tramadol . The sensation itself can be described as powerful and overwhelming feeling of emotional bliss, contentment and happiness. Anxiety suppression Compulsive redosing Dream potentiation\n\n\n                    Context: \n                    This section details the cognitive effects of methadone, highlighting its capacity to induce emotional bliss, anxiety suppression, and compulsive redosing, with specific emphasis on the differences between its enantiomers. It complements the document's broader discussion of methadone's physical, subjective, and perceptual effects, providing insight into its impact on mental states.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_9", "document_index": 271, "latency_s": 0.6887093999976059, "prompt_toks": 1732, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive euphoria - This particular substance can be considered as less intense in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin), but the L-enantiomer (levomethadone) is way stronger and can be considered almost equal to diacetylmorphine . Both enantiomers, ultimately, are stronger than other synthetic opioids such as tramadol . The sensation itself can be described as powerful and overwhelming feeling of emotional bliss, contentment and happiness.\n- Anxiety suppression\n- Compulsive redosing\n- Dream potentiation\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This excerpt details the cognitive and emotional effects of methadone, highlighting its relatively moderate cognitive euphoria compared to other opioids, with specific notes on the potency of its enantiomers. It also covers associated psychological effects such as anxiety suppression, compulsive redosing, and dream potentiation, positioned within the broader discussion of methadone's physical, subjective, and historical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_10", "document_index": 271, "latency_s": 0.8808299000083935, "prompt_toks": 1770, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety suppression\n- Compulsive redosing\n- Dream potentiation\nHistory and culture: \nLiterature: \nVisual effects: - Suppressions Double vision - At high doses, the eyes un-focus and re-focus uncontrollably. It appears to be caused by issues in depth perception, as by closing one eye the issue can be temporarily alleviated. Hallucinatory states Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\n- Double vision - At high doses, the eyes un-focus and re-focus uncontrollably. It appears to be caused by issues in depth perception, as by closing one eye the issue can be temporarily alleviated.\n\n\n                    Context: \n                    This chunk details the visual effects associated with methadone use, including symptoms like anxiety suppression, compulsive redosing, and dream potentiation. It also describes high-dose visual phenomena such as double vision and internal hallucinations, highlighting the drug's impact on perception and imagery. These effects are relevant for understanding methadone's subjective experiences and potential visual side effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 42, "doc_id": "doc_271", "num_chunks": 12, "chunk_id": "271::chunk_11", "document_index": 271, "latency_s": 0.7530759999935981, "prompt_toks": 1748, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Double vision - At high doses, the eyes un-focus and re-focus uncontrollably. It appears to be caused by issues in depth perception, as by closing one eye the issue can be temporarily alleviated.\n- Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt details the visual and hallucination effects associated with high doses of methadone, including double vision and internal hallucinations, and lists related effects such as auditory and multisensory phenomena. It is part of the broader discussion on methadone’s physical and perceptual effects, highlighting its impact on sensory perception during intoxication.\n                "}
