{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_0", "document_index": 272, "latency_s": 0.7600365999969654, "prompt_toks": 3217, "completion_toks": 39}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Methamphetamine\npsychonaut_name: Methamphetamine\npsychonaut_url: https://psychonautwiki.org/wiki/Methamphetamine\n\n\n                    Context: \n                    This chunk provides the basic identification and referencing information for Methamphetamine, including its common names, systematic name, and its PsychonautWiki page URL, serving as a foundational reference within the comprehensive document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_1", "document_index": 272, "latency_s": 0.9763050000037765, "prompt_toks": 3486, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Methamphetamine | Chemical Nomenclature | Common names | Methamphetamine, Meth, Crystal, Desoxyn, Speed, Ma, Ice, Glass, Shard, Tina, T, Tweak, Crank, Shabu, Yaba | Substitutive name | N-Methylamphetamine | Systematic name | N-Methyl-1-phenylpropan-2-amine | Class Membership | Psychoactive class | Stimulant | Chemical class | Amphetamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Smoked | Dosage | Bioavailability | >90% | Threshold | < 5 mg | Light | 5 - 10 mg | Common | 10 - 20 mg | Strong | 20 - 60 mg | Heavy | 60 mg + | Duration | Total | 2 - 6 hours | Up to 12h for irregular users. | Onset | 7 - 10 seconds | Come up | 5 - 10 seconds | Peak | 1 - 3 hours | Offset | 1 - 3 hours | After effects | 2 - 24 hours | ⇣ | Oral | Dosage | Bioavailability | ~70% | [1] | Threshold | < 5 mg | Light | 5 - 10 mg | Common |\n\n\n                    Context: \n                    This infobox excerpt summarizes key chemical and pharmacological information about methamphetamine, including its names, chemical classification, routes of administration, dosage ranges, bioavailability, and onset times. It provides essential reference data that supports the detailed physical, cognitive, and visual effects described elsewhere in the document, facilitating quick retrieval of fundamental facts about the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_2", "document_index": 272, "latency_s": 0.848329599990393, "prompt_toks": 3564, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    up | 5 - 10 seconds | Peak | 1 - 3 hours | Offset | 1 - 3 hours | After effects | 2 - 24 hours | ⇣ | Oral | Dosage | Bioavailability | ~70% | [1] | Threshold | < 5 mg | Light | 5 - 10 mg | Common | 10 - 25 mg | Strong | 25 - 50 mg | Heavy | 50 mg + | Duration | Total | 8 - 12 hours | Up to 24h for irregular users. | Onset | 15 - 45 minutes | Come up | 1 - 3 hours | Peak | 3 - 5 hours | Offset | 3 - 4 hours | After effects | 12 - 24 hours | ⇣ | Insufflated | Dosage | Bioavailability | >90% | Threshold | < 5 mg | Light | 5 - 10 mg | Common | 10 - 30 mg | Strong | 30 - 60 mg | Heavy | 60 mg + | Duration | Total | 4 - 7 hours | Up to 12h for irregular users. | Onset | 3 - 5 minutes | Come up | 3 - 5 minutes | Peak | 1.5 - 3 hours | Offset | 2 - 4 hours | After effects | 6 - 24 hours | ⇣ | Rectal | Dosage | Bioavailability | ~99% | [2] | Threshold | < 5 mg | Light | 5 - 10 mg | Common | 10 - 30 mg | Strong | 30 - 40 mg | Heavy | 40 mg+ | Duration | Total | 6 - 10 hours | Up to 18h for\n\n\n                    Context: \n                    This chunk provides detailed pharmacokinetic data on methamphetamine, including dosage, bioavailability, onset, peak, duration, and effects across various administration routes (oral, insufflation, rectal). It supplements the full document's comprehensive overview by offering precise timing and dosage information vital for understanding methamphetamine's subjective and physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_3", "document_index": 272, "latency_s": 0.9042151000030572, "prompt_toks": 3514, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Rectal | Dosage | Bioavailability | ~99% | [2] | Threshold | < 5 mg | Light | 5 - 10 mg | Common | 10 - 30 mg | Strong | 30 - 40 mg | Heavy | 40 mg+ | Duration | Total | 6 - 10 hours | Up to 18h for irregular users. | Onset | 5 - 15 minutes | Come up | 3 - 5 minutes | Peak | 2 - 4 hours | Offset | 3 - 5 hours | After effects | 12 - 24 hours | ⇣ | Intravenous | Dosage | Bioavailability | ~100% | [1] | Threshold | < 5 mg | Light | 5 - 10 mg | Common | 10 - 30 mg | Strong | 30 - 40 mg | Heavy | 40 mg+ | Duration | Total | 4 - 8 hours | Up to 18h for irregular users. | Onset | 15 - 30 seconds | Come up | 1 - 2 minutes | Peak | 1 - 3 hours | Offset | 3 - 4 hours | After effects | 12 - 24 | hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Alcohol | GHB | GBL | Opioids | Cocaine | Cannabis | Caffeine | Ketamine |\n\n\n                    Context: \n                    This chunk provides detailed dosage information, bioavailability, onset times, duration, and effects specific to rectal and intravenous administration routes of methamphetamine. It complements the comprehensive section on methods of use, emphasizing differences in pharmacokinetics, duration, and onset between these routes, and includes important safety notes and substance interactions for harm reduction.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_4", "document_index": 272, "latency_s": 0.7241393000003882, "prompt_toks": 3289, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Alcohol | GHB | GBL | Opioids | Cocaine | Cannabis | Caffeine | Ketamine | Methoxetamine | Psychedelics | DXM | PCP | 25x-NBOMe | 2C-T-x | 5-MeO-xxT | DOx | Tramadol | aMT | MAOIs\n\n\n                    Context: \n                    This chunk presents a disclaimer about dosage information being user-sourced and not to be taken as medical advice, followed by a list of substances that may interact with methamphetamine. It enhances the section on drug interactions within the full document, highlighting potential risks and emphasizing the importance of verifying information from multiple sources.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_5", "document_index": 272, "latency_s": 1.1281050000106916, "prompt_toks": 3232, "completion_toks": 46}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This section outlines the main topics covered in the document, including chemistry, pharmacology, subjective effects, toxicity, legal status, and related links, serving as an overview of the comprehensive information about methamphetamine provided in the full webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_6", "document_index": 272, "latency_s": 0.9949373999988893, "prompt_toks": 3382, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Stimulation - In terms of its effects on the physical energy levels of the user, methamphetamine is usually considered to be extremely energetic and stimulating in a fashion that is identical to that of amphetamine , but stronger than that of modafinil , caffeine , and MDMA . It is similar yet distinct from the stimulation experienced on MDMA , encouraging physical activities such as dancing, socializing, running, or cleaning. The particular style of stimulation which methamphetamine presents can be described as forced. This means that at higher dosages, it becomes difficult or impossible to keep still as jaw clenching, involuntarily bodily shakes and vibrations become present, resulting in extreme shaking of the entire body, unsteadiness of the hands, and a general lack of motor control. Physical euphoria - As a potent stimulant, methamphetamine is capable producing states of intense physical euphoria, especially when it is vaporized or injected . However, the\n\n\n                    Context: \n                    This chunk provides detailed information on the physical effects of methamphetamine, including its energizing, stimulating properties, and associated motor disturbances like jaw clenching and tremors. It highlights the intensity of physical stimulation and euphoria, especially when vaporized or injected, fitting within the broader discussion of methamphetamine’s subjective, behavioral, and physiological impacts detailed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_7", "document_index": 272, "latency_s": 0.7952884999976959, "prompt_toks": 3374, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    lack of motor control. Physical euphoria - As a potent stimulant, methamphetamine is capable producing states of intense physical euphoria, especially when it is vaporized or injected . However, the initial rush of euphoria can wear off well before the substance has run its course which can promote compulsive redosing, which can have extremely damaging cumulative effects. Abnormal heartbeat Increased blood pressure Increased heart rate Appetite suppression Body odor alteration - Methamphetamine can potentially leave a very distinct odor within one's urine, sweat and general bodily secretions. Most people would consider it as unpleasant, but few people do enjoy it and find it a very pleasant odor. Bronchodilation Dehydration Frequent urination Increased bodily temperature Increased perspiration Muscle contractions Muscle spasms Neurotoxicity -- from long-term use. Stamina enhancement - This effect is more prominent than with any other commonly used stimulant . Tactile enhancement\n\n\n                    Context: \n                    This chunk provides detailed information on the physical effects of methamphetamine, including stimulation, euphoria, cardiovascular risks, bodily odor changes, thermoregulation issues, muscle effects, neurotoxicity, and enhanced stamina, which are key aspects covered in the overall document's section on physical and subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_8", "document_index": 272, "latency_s": 0.7834740999969654, "prompt_toks": 3390, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Muscle contractions Muscle spasms Neurotoxicity -- from long-term use. Stamina enhancement - This effect is more prominent than with any other commonly used stimulant . Tactile enhancement Tactile hallucination - High doses and/or prolonged usage of certain stimulants like methamphetamine and cocaine can lead to hallucinatory sensations of bugs crawling on the surface of or underneath one’s skin. This is typically referred to as delusional parasitosis or more informally as “meth mites”. Teeth grinding Temporary erectile dysfunction Vasoconstriction Pupil dilation Vibrating vision - At high doses or certain routes of administration, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion, causing the vision to become blurry and temporarily out of focus. This is a condition known as nystagmus . Seizure - This is an uncommon effect but can happen in those predisposed to them, especially while in physically taxing conditions such as being dehydrated,\n\n\n                    Context: \n                    This excerpt details the physical and neurological effects of methamphetamine use, including muscle spasms, neurotoxicity from long-term use, sensory hallucinations like vibrating vision and tactile hallucinations (\"meth mites\"), and cardiovascular issues such as vasoconstriction and pupil dilation. It highlights serious adverse effects and sensitivities, emphasizing risks associated with high doses and prolonged use within the comprehensive overview of methamphetamine's pharmacology and effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_9", "document_index": 272, "latency_s": 1.1675478999968618, "prompt_toks": 3254, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    This is a condition known as nystagmus . Seizure - This is an uncommon effect but can happen in those predisposed to them, especially while in physically taxing conditions such as being dehydrated, fatigued or undernourished, or if miusing the substance for extended periods of time.\n\n\n                    Context: \n                    This chunk discusses some of the physical adverse effects associated with methamphetamine use, specifically detailing visual disturbances like vibrating vision caused by nystagmus, and the risk of seizures, particularly in individuals predisposed or under physically taxing conditions such as dehydration, fatigue, or extended use. It highlights critical health risks documented in the toxicity and harm potential section of the overall document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_10", "document_index": 272, "latency_s": 1.1338890000042738, "prompt_toks": 3382, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stimulation - In terms of its effects on the physical energy levels of the user, methamphetamine is usually considered to be extremely energetic and stimulating in a fashion that is identical to that of amphetamine , but stronger than that of modafinil , caffeine , and MDMA . It is similar yet distinct from the stimulation experienced on MDMA , encouraging physical activities such as dancing, socializing, running, or cleaning. The particular style of stimulation which methamphetamine presents can be described as forced. This means that at higher dosages, it becomes difficult or impossible to keep still as jaw clenching, involuntarily bodily shakes and vibrations become present, resulting in extreme shaking of the entire body, unsteadiness of the hands, and a general lack of motor control. Physical euphoria - As a potent stimulant, methamphetamine is capable producing states of intense physical euphoria, especially when it is vaporized or injected . However, the initial rush of\n\n\n                    Context: \n                    This chunk details the physical and stimulating effects of methamphetamine, highlighting its energetic and motor-impairing properties, as well as its capacity to induce intense euphoria when vaporized or injected. It elaborates on the nature of methamphetamine's forced stimulation, motor control issues, and euphoria, making it crucial for understanding its physical effects within the broader discussion of its subjective and physical impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_11", "document_index": 272, "latency_s": 0.6982874999957858, "prompt_toks": 3256, "completion_toks": 63}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical euphoria - As a potent stimulant, methamphetamine is capable producing states of intense physical euphoria, especially when it is vaporized or injected . However, the initial rush of euphoria can wear off well before the substance has run its course which can promote compulsive redosing, which can have extremely damaging cumulative effects.\n\n\n                    Context: \n                    This excerpt describes the physical euphoria experienced from methamphetamine use, highlighting its potency when vaporized or injected and the risk of compulsive redosing due to rapid euphoria decline. It is a key section within the detailed discussion of methamphetamine's physical effects, emphasizing both its stimulant strength and potential for harm.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_12", "document_index": 272, "latency_s": 0.8912469999922905, "prompt_toks": 3390, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria - As a potent stimulant, methamphetamine is capable producing states of intense physical euphoria, especially when it is vaporized or injected . However, the initial rush of euphoria can wear off well before the substance has run its course which can promote compulsive redosing, which can have extremely damaging cumulative effects.\n- Abnormal heartbeat\n- Increased blood pressure\n- Increased heart rate\n- Appetite suppression\n- Body odor alteration - Methamphetamine can potentially leave a very distinct odor within one's urine, sweat and general bodily secretions. Most people would consider it as unpleasant, but few people do enjoy it and find it a very pleasant odor.\n- Bronchodilation\n- Dehydration\n- Frequent urination\n- Increased bodily temperature\n- Increased perspiration\n- Muscle contractions\n- Muscle spasms\n- Neurotoxicity -- from long-term use.\n- Stamina enhancement - This effect is more prominent than with any other commonly used stimulant .\n\n\n                    Context: \n                    This excerpt summarizes key physical effects of methamphetamine, highlighting its potent stimulant properties and associated physiological impacts such as euphoria, cardiovascular strain, thermoregulation, and neurotoxicity. It emphasizes both the desirable effects like stamina enhancement and the potential health risks involved with use, within the context of a comprehensive analysis of methamphetamine's pharmacology and physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_13", "document_index": 272, "latency_s": 0.7863136999949347, "prompt_toks": 3377, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Muscle contractions\n- Muscle spasms\n- Neurotoxicity -- from long-term use.\n- Stamina enhancement - This effect is more prominent than with any other commonly used stimulant .\n- Tactile enhancement\n- Tactile hallucination - High doses and/or prolonged usage of certain stimulants like methamphetamine and cocaine can lead to hallucinatory sensations of bugs crawling on the surface of or underneath one’s skin. This is typically referred to as delusional parasitosis or more informally as “meth mites”.\n- Teeth grinding\n- Temporary erectile dysfunction\n- Vasoconstriction\n- Pupil dilation\n- Vibrating vision - At high doses or certain routes of administration, a person's eyeballs may begin to spontaneously wiggle back and forth in a rapid motion, causing the vision to become blurry and temporarily out of focus. This is a condition known as nystagmus .\n\n\n                    Context: \n                    This section details the physical effects of methamphetamine, including muscle contractions, spasms, neurotoxicity from long-term use, and other physiological impacts such as vasoconstriction, pupil dilation, vibrating vision (nystagmus), and sexual dysfunction, highlighting its potent stimulant properties and associated health risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_14", "document_index": 272, "latency_s": 0.8974372000084259, "prompt_toks": 3349, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Seizure - This is an uncommon effect but can happen in those predisposed to them, especially while in physically taxing conditions such as being dehydrated, fatigued or undernourished, or if miusing the substance for extended periods of time.\nCognitive effects: - The cognitive effects of methamphetamine can be broken down into several components which progressively intensify proportional to dosage. The general head space of methamphetamine is described by many as one of extreme mental stimulation , increased focus , ego inflation and powerful euphoria. It contains a large number of typical stimulant cognitive effects. Although negative side effects are usually mild at low to moderate dosages, they become increasingly likely to manifest themselves with higher amounts or widespread usage. This particularly holds true during the offset of the experience.\n\n\n                    Context: \n                    This excerpt details the physical and cognitive side effects of methamphetamine use, highlighting the risk of seizures in predisposed individuals and describing the escalating cognitive effects such as increased focus, ego inflation, and euphoria that intensify with higher doses. It complements the broader discussion of methamphetamine's physiological and psychological impact outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_15", "document_index": 272, "latency_s": 0.6152754999930039, "prompt_toks": 3351, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The most prominent of these cognitive effects generally include: Analysis enhancement Compulsive redosing Ego inflation Cognitive euphoria - This effect is often very intense when compared to other dopaminergic stimulants such as Amphetamine or even Cocaine Empathy, affection and sociability enhancement - This effect is mild to moderate and usually disappears within the first few uses or after any form of tolerance has developed. Focus enhancement - This component is most effective at low to moderate dosages as anything higher will usually impair concentration. Immersion enhancement Increased libido Increased music appreciation Memory enhancement Motivation enhancement Thought acceleration Thought organization Time compression - This can be described as the experience of time speeding up and passing much quicker than it usually would when sober. Wakefulness\n- Analysis enhancement\n- Compulsive redosing\n- Ego inflation\n\n\n                    Context: \n                    This passage summarizes key cognitive effects of methamphetamine, including analysis enhancement, ego inflation, increased focus at low doses, and time distortion phenomena like time compression and wakefulness. It is part of the broader discussion on methamphetamine's subjective effects and mental impact, providing detailed insights into how the drug influences mental processes at various dosages.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_16", "document_index": 272, "latency_s": 0.9984079999994719, "prompt_toks": 3360, "completion_toks": 93}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis enhancement\n- Compulsive redosing\n- Ego inflation\n- Cognitive euphoria - This effect is often very intense when compared to other dopaminergic stimulants such as Amphetamine or even Cocaine\n- Empathy, affection and sociability enhancement - This effect is mild to moderate and usually disappears within the first few uses or after any form of tolerance has developed.\n- Focus enhancement - This component is most effective at low to moderate dosages as anything higher will usually impair concentration.\n- Immersion enhancement\n- Increased libido\n- Increased music appreciation\n- Memory enhancement\n- Motivation enhancement\n- Thought acceleration\n- Thought organization\n- Time compression - This can be described as the experience of time speeding up and passing much quicker than it usually would when sober.\n- Wakefulness\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This chunk outlines the cognitive effects of methamphetamine, including analysis enhancement, redosing tendencies, ego inflation, and heightened euphoric and focus-related experiences, as well as increased libido, memory, motivation, and perception adjustments like time compression. It is relevant to understanding the substance's psychological impact and differentiates its effects from other stimulants, providing essential details for user awareness and harm reduction. The section also briefly references the historical and cultural context of these effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_17", "document_index": 272, "latency_s": 1.1486331000050995, "prompt_toks": 3381, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - The visual effects of methamphetamine are usually less consistent and are only mildly noticeable at higher dosages. They are somewhat comparable to the visuals produced by deliriants and are more frequent in darker areas. Scenarios consisting of severe sleep deprivation caused by wakefulness can lead to more intense visual effects and even hallucinations . Suppressions Double vision Distortions Visual drifting - This effect is usually subtle or barely noticeable and only occurs at higher dosages or when combined with cannabis . It is most prominent when smoked or taken intravenously and is usually delirious in nature. Commonly this, high dosages or prolonged use can cause level 1-2 visual drifting. Brightness alteration Hallucinatory states Transformations - This effect occurs very rarely, and typically only when the user has taken high doses, is coming down, or has been awake for unusually long periods. They are usually very mild when they do happen to occur.\n\n\n                    Context: \n                    This excerpt details the visual effects associated with methamphetamine use, highlighting their variability, mild intensity at higher doses, and specific phenomena such as visual drifting, hallucinations, and transformations. It fits within the broader discussion of methamphetamine’s physical and sensory effects, providing specific information about how visual perceptions may be altered, especially under conditions of high dosage or sleep deprivation.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_18", "document_index": 272, "latency_s": 0.7294375000055879, "prompt_toks": 3331, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Double vision\n- Visual drifting - This effect is usually subtle or barely noticeable and only occurs at higher dosages or when combined with cannabis . It is most prominent when smoked or taken intravenously and is usually delirious in nature. Commonly this, high dosages or prolonged use can cause level 1-2 visual drifting.\n- Brightness alteration\n- Transformations - This effect occurs very rarely, and typically only when the user has taken high doses, is coming down, or has been awake for unusually long periods. They are usually very mild when they do happen to occur.\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects:\n\n\n                    Context: \n                    This chunk details the visual effects associated with methamphetamine use, including symptoms like double vision, subtle visual drifting often linked to high doses or intravenous administration, brightness alterations, and rare transformation effects during prolonged wakefulness. It is part of the comprehensive description of methamphetamine’s physical and perceptual effects found in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_19", "document_index": 272, "latency_s": 1.0396091000002343, "prompt_toks": 3382, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Auditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: - The effects which occur during the offset of a stimulant experience generally feel negative and uncomfortable in comparison to the effects which occurred during its peak . This is often referred to as a \"comedown\" and occurs because of neurotransmitter depletion. Its effects commonly include: Anxiety Appetite suppression Cognitive fatigue Depression Irritability Motivation suppression Sleep paralysis - Some users note sleep paralysis after consuming methamphetamine. Suicidal ideation Thought deceleration Psychosis Wakefulness - This particular after effect is more pronounced than it is with any other commonly used stimulant .\n- Anxiety\n- Appetite suppression\n- Cognitive fatigue\n- Depression\n- Irritability\n- Motivation suppression\n- Sleep paralysis - Some users note sleep paralysis after consuming methamphetamine.\n- Suicidal ideation\n- Thought deceleration\n- Psychosis\n\n\n                    Context: \n                    This excerpt provides details on the after effects experienced during the stimulant comedown from methamphetamine use, including symptoms like anxiety, depression, sleep paralysis, and psychosis. It is part of the broader section on physical and psychological effects, outlining potential negative after-effects that can occur once the drug's primary effects wear off. Understanding these after effects is crucial for comprehensively assessing methamphetamine's harm potential and user experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 43, "doc_id": "doc_272", "num_chunks": 21, "chunk_id": "272::chunk_20", "document_index": 272, "latency_s": 0.8354726999968989, "prompt_toks": 3284, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Depression\n- Irritability\n- Motivation suppression\n- Sleep paralysis - Some users note sleep paralysis after consuming methamphetamine.\n- Suicidal ideation\n- Thought deceleration\n- Psychosis\n- Wakefulness - This particular after effect is more pronounced than it is with any other commonly used stimulant .\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt details the after effects of methamphetamine use, highlighting psychological and physical symptoms such as depression, irritability, sleep paralysis, and psychosis, which occur during the stimulant's offset phase. It emphasizes the pronounced wakefulness and sleep-related issues associated with the drug's comedown, and lists related topics like reagent results, preparation methods, research, legal issues, paradoxical effects, and other considerations relevant to understanding its post-use impacts.\n                "}
