{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_0", "document_index": 275, "latency_s": 0.6570068000000902, "prompt_toks": 1533, "completion_toks": 33}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Morphine\npsychonaut_name: Morphine\npsychonaut_url: https://psychonautwiki.org/wiki/Morphine\n\n\n                    Context: \n                    This chunk contains the basic identifiers and references for the drug Morphine, including its name and URL, serving as an introductory metadata section within the comprehensive psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_1", "document_index": 275, "latency_s": 0.8718463999975938, "prompt_toks": 1835, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Morphine | Chemical Nomenclature | Common names | Morphine, MS-Contin, Oramorph, Zomorph, Sevredol, Duramorph | Substitutive name | Morphine | Systematic name | (5α,6α)-7,8-didehydro-4,5-epoxy-17-methylmorphinan-3,6-diol | Class Membership | Psychoactive class | Opioid | Chemical class | Morphinan | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 35% - 40% | Threshold | < 10 mg | Light | 10 - 15 mg | Common | 15 - 20 mg | Strong | 20 - 30 mg | Heavy | 30 mg + | Duration | Total | 4 - 6 hours | Onset | 10 - 30 minutes | Come up | 20 - 40 minutes | Peak | 2 - 3 hours | Offset | 1 - 2 hours | After effects | 12h | ⇣ | Intravenous | Dosage | Bioavailability | 100% | Threshold | < 3.33 mg | Light | 3.33 - 5 mg | Common | 5 - 7.5 mg | Strong | 7.5 - 10 mg | Heavy | 10 mg + | [2] | [3] | [4]\n\n\n                    Context: \n                    This chunk provides detailed pharmacological information about morphine, including its common names, chemical nomenclature, routes of administration with dosage guidelines, bioavailability, onset and duration of effects, and references to its intravenous use. It is essential for understanding morphine's medical and recreational use parameters within the comprehensive overview of its effects, toxicity, and legal status.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_2", "document_index": 275, "latency_s": 1.0402432999981102, "prompt_toks": 1740, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    After effects | 12h | ⇣ | Intravenous | Dosage | Bioavailability | 100% | Threshold | < 3.33 mg | Light | 3.33 - 5 mg | Common | 5 - 7.5 mg | Strong | 7.5 - 10 mg | Heavy | 10 mg + | [2] | [3] | [4] | [5] | Duration | Total | 4 - 5 hours | Onset | 0 - 30 seconds | Come up | 2 - 5 minutes | Peak | 1.5 - 2.5 hours | Offset | 60 - 90 minutes | After effects | 12h | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine | MXE | Tramadol | Grapefruit\n\n\n                    Context: \n                    This chunk provides detailed intravenous dosage information, including bioavailability, threshold, typical, strong, and heavy doses, as well as duration, onset, peak, and offset times, and potential after effects for morphine. It is essential for understanding the specific parameters and safety considerations of IV administration within the comprehensive pharmacological profile of morphine documented in the full webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_3", "document_index": 275, "latency_s": 0.8624991999968188, "prompt_toks": 1664, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences: \nPhysical effects: - Sedation Physical euphoria - The physical euphoria experienced on this substance is extremely intense when compared to other opioids such as codeine or tramadol . The sensation itself can be described as feelings of intense physical comfort, warmth, love and bliss. Muscle relaxation Constipation Cough suppression Decreased libido Difficulty urinating Itchiness Nausea Pain relief - Many report that they are still  aware of pain, however the pain is no longer of interest. Pupil constriction Respiratory depression Skin flushing Appetite suppression Orgasm suppression\n- Sedation\n\n\n                    Context: \n                    This chunk summarizes the physical effects of morphine, highlighting its intense euphoria, sedation, and physiological impacts such as pain relief, respiratory depression, and gastrointestinal effects. It is a key section within the broader document detailing morphine's pharmacology, toxicity, and effects, providing essential information for understanding its physical and medical profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_4", "document_index": 275, "latency_s": 0.74620560000767, "prompt_toks": 1640, "completion_toks": 50}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation\n- Physical euphoria - The physical euphoria experienced on this substance is extremely intense when compared to other opioids such as codeine or tramadol . The sensation itself can be described as feelings of intense physical comfort, warmth, love and bliss.\n- Muscle relaxation\n- Constipation\n- Cough suppression\n- Decreased libido\n- Difficulty urinating\n- Itchiness\n- Nausea\n- Pain relief - Many report that they are still  aware of pain, however the pain is no longer of interest.\n- Pupil constriction\n- Respiratory depression\n- Skin flushing\n- Appetite suppression\n- Orgasm suppression\n\n\n                    Context: \n                    This excerpt details the physical effects of morphine, including sedation, intense physical euphoria, muscle relaxation, and vital suppression symptoms such as respiratory depression and pupil constriction, providing essential information for understanding its pharmacological profile within the broader substance overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_5", "document_index": 275, "latency_s": 0.9380188000068301, "prompt_toks": 1697, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Pupil constriction\n- Respiratory depression\n- Skin flushing\n- Appetite suppression\n- Orgasm suppression\nCognitive effects: - Cognitive euphoria - Morphine produces cognitive euphoria that is substantially stronger compared to other opioids such as codeine or tramadol , but weaker than that of heroin , hydrocodone , and oxycodone . The sensation can be described as powerful and all-encompassing feelings of emotional bliss, contentment, and happiness. Anxiety suppression Thought deceleration Compulsive redosing Dream potentiation Irritability - While opioids are well known for their ability to improve mood, they can also have the paradoxical effect of increasing the user's sensitivity to irritable stimuli. This can manifest as aloofness and sudden outbursts of anger and aggression (colloquially known as \"opiate rage\"). It appears to occur more frequently during the comedown of the experience and/or with heavy use.\n\n\n                    Context: \n                    This excerpt details the physical and cognitive effects of morphine, including pupil constriction, respiratory depression, skin flushing, appetite suppression, and orgasm suppression, as well as describing the experience of cognitive euphoria, mood modulation, and potential paradoxical irritability, central to understanding morphine's psychoactive profile within the full pharmacological overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_6", "document_index": 275, "latency_s": 0.6637290000071516, "prompt_toks": 1685, "completion_toks": 55}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive euphoria - Morphine produces cognitive euphoria that is substantially stronger compared to other opioids such as codeine or tramadol , but weaker than that of heroin , hydrocodone , and oxycodone . The sensation can be described as powerful and all-encompassing feelings of emotional bliss, contentment, and happiness.\n- Anxiety suppression\n- Thought deceleration\n- Compulsive redosing\n- Dream potentiation\n- Irritability - While opioids are well known for their ability to improve mood, they can also have the paradoxical effect of increasing the user's sensitivity to irritable stimuli. This can manifest as aloofness and sudden outbursts of anger and aggression (colloquially known as \"opiate rage\"). It appears to occur more frequently during the comedown of the experience and/or with heavy use.\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This excerpt details the cognitive and emotional effects of morphine, highlighting its capacity to induce strong euphoria, anxiety suppression, and thought deceleration, along with potential for irritability and \"opiate rage,\" crucial for understanding its psychoactive profile within the full drug description.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_7", "document_index": 275, "latency_s": 0.8316799000022002, "prompt_toks": 1673, "completion_toks": 58}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    History and culture: \nLiterature: \nVisual effects: - Suppressions Double vision - At high doses, the eyes unfocus and re-focus uncontrollably. This creates a blurred effect and double vision that is present no matter where one focuses their eyes. This can be so intense it becomes impossible to read or drive. Hallucinatory States Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\n- Double vision - At high doses, the eyes unfocus and re-focus uncontrollably. This creates a blurred effect and double vision that is present no matter where one focuses their eyes. This can be so intense it becomes impossible to read or drive.\n\n\n                    Context: \n                    This section details the visual effects associated with morphine use, specifically double vision and internal hallucinations at high doses, describing how these phenomena impair visual focus and can induce dream-like states, and is part of the broader discussion on physical and perceptual effects of the substance in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 46, "doc_id": "doc_275", "num_chunks": 9, "chunk_id": "275::chunk_8", "document_index": 275, "latency_s": 0.8703737000032561, "prompt_toks": 1607, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This excerpt details the visual and hallucination effects associated with heavy morphine use, specifically highlighting internal hallucinations, dream-like states, and geometric imagery. It is part of the broader discussion on physical and perceptual effects of morphine, which also covers sensory suppression, cognitive effects, and after effects, providing a comprehensive overview of its subjective experience.\n                "}
