{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_0", "document_index": 291, "latency_s": 0.49450839999190066, "prompt_toks": 1111, "completion_toks": 40}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Oxymorphone\npsychonaut_name: Oxymorphone\npsychonaut_url: https://psychonautwiki.org/wiki/Oxymorphone\n\n\n                    Context: \n                    This chunk provides the basic identifiers for Oxymorphone, including its name and official URL, serving as an introductory reference within the comprehensive drug profile encompassing its chemistry, effects, and legal status.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_1", "document_index": 291, "latency_s": 0.7281449000001885, "prompt_toks": 1379, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Oxymorphone | Chemical Nomenclature | Common names | Opana | Substitutive name | Oxymorphone | Systematic name | (4R,4aS,7aR,12bS)-4a,9-dihydroxy-3-methyl-2,4,5,6,7a,13-hexahydro-1H-4,12-methanobenzofuro[3,2-e]isoquinoline-7-one | Class Membership | Psychoactive class | Opioid | Chemical class | Morphinan | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 2.5 mg | Light | 5 - 10 mg | Common | 10 - 20 mg | Strong | 20 - 30 mg | Heavy | 30 mg + | Duration | Total | 4 - 6 hours | Onset | 20 - 45 minutes | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB |\n\n\n                    Context: \n                    This chunk is an infobox summarizing key information about oxymorphone, including its chemical names, classification, routes of administration, dosage guidelines, duration, onset, and known interactions. It provides a quick reference to essential data within the full webpage on oxymorphone’s effects, health considerations, and legal status, supporting efficient search and retrieval of specific details.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_2", "document_index": 291, "latency_s": 0.8474951000098372, "prompt_toks": 1144, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | MAOIs | Nitrous | PCP | Stimulants | Alcohol | Benzodiazepines | DXM | GHB | GBL | Ketamine | MXE | Tramadol | Grapefruit\n\n\n                    Context: \n                    This excerpt provides information on drug interactions associated with oxymorphone, listing substances such as MAOIs, nitrous, PCP, stimulants, and others. It is part of the broader content on the substance's dosage, safety considerations, and pharmacology, highlighting potential risks when combining oxymorphone with various agents. This section is relevant for understanding interaction risks and ensuring responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_3", "document_index": 291, "latency_s": 0.8026752000005217, "prompt_toks": 1231, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences: \nPhysical effects: - Euphoria - In comparison to other opioids, this particular substance can be considered similar in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin) and more intense when compared to kratom and hydrocodone . The sensation itself can be described as feelings of intense physical comfort, warmth, love and bliss. Constipation Decreased libido Difficulty urinating Itchiness Nausea Pain relief Pupil constriction Respiratory depression Sedation Skin flushing Appetite suppression Orgasm suppression\n\n\n                    Context: \n                    This chunk provides a detailed overview of the physical effects associated with Oxymorphone, highlighting its euphoric properties, physiological sensations, and common side effects such as constipation and respiratory depression, making it a key section for understanding the drug's impact within the broader pharmacological and harm potential information in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_4", "document_index": 291, "latency_s": 1.0858765000011772, "prompt_toks": 1208, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Euphoria - In comparison to other opioids, this particular substance can be considered similar in its physical euphoria when compared with that of morphine or diacetylmorphine (heroin) and more intense when compared to kratom and hydrocodone . The sensation itself can be described as feelings of intense physical comfort, warmth, love and bliss.\n- Constipation\n- Decreased libido\n- Difficulty urinating\n- Itchiness\n- Nausea\n- Pain relief\n- Pupil constriction\n- Respiratory depression\n- Sedation\n- Skin flushing\n- Appetite suppression\n- Orgasm suppression\n\n\n                    Context: \n                    This excerpt details the physical effects associated with oxymorphone, including sensations of euphoria and various physiological side effects like constipation, pupil constriction, and respiratory depression. It is part of the comprehensive description of oxymorphone's physical effects section in the full document, providing key information on its subjective and physical impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_5", "document_index": 291, "latency_s": 0.7555300000094576, "prompt_toks": 1220, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Decreased libido\n- Difficulty urinating\n- Itchiness\n- Nausea\n- Pain relief\n- Pupil constriction\n- Respiratory depression\n- Sedation\n- Skin flushing\n- Appetite suppression\n- Orgasm suppression\nCognitive effects: - Euphoria - In comparison to other opioids, this particular substance can be considered similar in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin) and more intense when compared to kratom and hydrocodone . The sensation itself can be described as powerful and overwhelming feelings of emotional bliss, contentment, and happiness. Anxiety suppression Compulsive redosing Dream potentiation\n\n\n                    Context: \n                    This excerpt details the physical and cognitive effects associated with oxymorphone, including sensations like euphoria, physical symptoms such as nausea and pupil constriction, and psychological effects like emotional bliss and anxiety suppression. It is part of a comprehensive overview of the drug's effects, intended for educational and harm reduction purposes. The information helps users understand oxymorphone's impact on the body and mind.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_6", "document_index": 291, "latency_s": 1.1162894000008237, "prompt_toks": 1285, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Euphoria - In comparison to other opioids, this particular substance can be considered similar in its cognitive euphoria when compared with that of morphine or diacetylmorphine (heroin) and more intense when compared to kratom and hydrocodone . The sensation itself can be described as powerful and overwhelming feelings of emotional bliss, contentment, and happiness.\n- Anxiety suppression\n- Compulsive redosing\n- Dream potentiation\nHistory and culture: \nLiterature: \nVisual effects: - Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\n- Internal hallucination - One may experience a state of semi-consciousness and hypnagogia during heavy dosage nodding which results in dream-like states and up to level 3 imagery . This is often accompanied by ill-defined geometry .\nAuditory effects: \nMulti-sensory effects:\n\n\n                    Context: \n                    This excerpt details the physical, cognitive, and visual effects of oxymorphone, emphasizing its intense euphoria, emotional and dream-like states, and hallucinations at high doses. It provides specific descriptions of subjective experiences, such as feelings of bliss and ill-defined geometry during nodding, contributing to the overall understanding of oxymorphone’s psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 62, "doc_id": "doc_291", "num_chunks": 8, "chunk_id": "291::chunk_7", "document_index": 291, "latency_s": 0.8455525000026682, "prompt_toks": 1132, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Auditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This section lists specific experiential and behavioral effects associated with oxymorphone, including auditory, multisensory, transpersonal, disconnective, and after effects, as well as considerations for reagent results, preparation methods, research, legal issues, paradoxical effects, and other related topics, providing detailed information relevant to understanding the drug's psychoactive profile within the full webpage.\n                "}
