{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_0", "document_index": 296, "latency_s": 0.8033954999991693, "prompt_toks": 4121, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Pregabalin\npsychonaut_name: Pregabalin\npsychonaut_url: https://psychonautwiki.org/wiki/Pregabalin\n\n\n                    Context: \n                    This excerpt provides basic identification details for Pregabalin, including its name and link to the full article on PsychonautWiki. It serves as a reference point for both the substance's classification and further information, crucial for searches related to drug profiles or psychoactive substances.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_1", "document_index": 296, "latency_s": 0.8072711999993771, "prompt_toks": 4398, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Pregabalin | Chemical Nomenclature | Common names | Pregabalin, Lyrica, Nervalin | Substitutive name | 3-Isobutyl GABA | Systematic name | (S)-3-(Aminomethyl)-5-methylhexanoic acid | Class Membership | Psychoactive class | Depressant | Chemical class | Gabapentinoid | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | ~90% | [2] | Threshold | 50 mg | Light | 50 - 225 mg | Common | 225 - 600 mg | Strong | 600 - 900 mg | Heavy | 900 mg + | Duration | Total | 9 - 17 hours | Onset | 30 - 45 minutes | Come up | 1 - 2 hours | Peak | 4 - 6 hours | Offset | 4 - 8 hours | After effects | 4 - 10 hours | ⇣ | Rectal | Dosage | Bioavailability | ~99% | Threshold | < 40 mg | Light | 40 - 200 mg | Common | 200 - 450 mg | Strong | 450 - 600 mg | Heavy | 600 mg+ | Duration | Total | 5 - 8 hours | Onset |\n\n\n                    Context: \n                    This snippet is an infobox summarizing key pharmacological and procedural data on pregabalin, including chemical names, common aliases, administration routes, dosage ranges, bioavailability, and duration of effects. It provides quick reference details essential for understanding pregabalin's characteristics and appropriate use, positioning it within the comprehensive discussion of its subjective effects, toxicity, and legal status in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_2", "document_index": 296, "latency_s": 1.1591474000015296, "prompt_toks": 4258, "completion_toks": 113}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    | ⇣ | Rectal | Dosage | Bioavailability | ~99% | Threshold | < 40 mg | Light | 40 - 200 mg | Common | 200 - 450 mg | Strong | 450 - 600 mg | Heavy | 600 mg+ | Duration | Total | 5 - 8 hours | Onset | 15 - 30 minutes | Come up | 30 - 120 minutes | Peak | 2 - 3 hours | Offset | 3 - 5 hours | After effects | 6 - 12 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Oxycodone | SSRI | MDMA\n\n\n                    Context: \n                    This excerpt provides detailed dosage and onset information for rectal administration of Pregabalin, including bioavailability (~99%), dosage thresholds (from less than 40 mg to over 600 mg), duration (5-8 hours), and timing of effects such as onset (15-30 minutes) and peak (2-3 hours). It also includes a disclaimer about the educational nature of the information and lists potential drug interactions (Oxycodone, SSRI, MDMA). This specific data supplements the comprehensive effects and pharmacology overview found elsewhere in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_3", "document_index": 296, "latency_s": 0.8367957000009483, "prompt_toks": 4131, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines key sections of the Pregabalin article, including its summary, chemical properties, pharmacological effects, subjective user experiences, toxicity risks, legal considerations, related topics, external resources, and references. It serves as an organized overview of the drug's core information, making it essential for understanding its profile, effects, and legal status. This structure aids in quick navigation and comprehensive understanding of Pregabalin within the full webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_4", "document_index": 296, "latency_s": 0.8516796999901999, "prompt_toks": 4299, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Stimulation & Sedation -  Pregabalin produces mild sedation and improves sleep onset latency modestly. Several studies have shown pregabalin improves sleep quality of those who take it for various indications. It is unknown if this effect is carried over to those who take it recreationally. [17] [18] However, it is not an overly sedating substance when taken in the daytime. Appetite enhancement - This effect is not particularly prominent, but is reported to occur in some people. It can have a synergistic effect when combined with cannabis . Pain relief - Pregabalin is effective against certain types of chronic pain, particularly neuropathic pain, but not against acute pain. [19] Spontaneous bodily sensations - The general \"body high\" of pregabalin can be described as a sharp, pleasurable tingling sensation which is location specific to the hands, feet, and head. Physical euphoria - This component, while prominent in the experience, is generally not as strong as the\n\n\n                    Context: \n                    This excerpt provides an overview of pregabalin's physical effects, including its sedative properties, impact on sleep and pain relief, and sensations like tingling and euphoria. It contextualizes pregabalin's physiological and sensory effects, contributing to the comprehensive description of its subjective experiences and harm potential within the full psychoactive profile. These details are essential for understanding pregabalin's physical impact and safe use considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_5", "document_index": 296, "latency_s": 0.9378857999981847, "prompt_toks": 4294, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    sharp, pleasurable tingling sensation which is location specific to the hands, feet, and head. Physical euphoria - This component, while prominent in the experience, is generally not as strong as the cognitive euphoria that can be induced. The sensation itself can be described as feelings of physical comfort, warmth and bliss. Tactile enhancement - Although the user’s body may feel numb, the sense of touch can be heightened at the same time. Muscle twitching - Somewhat paradoxically, since pregabalin is used as an adjunct treatment for epilepsy, pregabalin, especially in higher doses, can produce muscle spasms. [ citation needed ] Anecdotally, seizures have been reported in overdose. [ citation needed ] Respiratory depression - While pregabalin may cause respiratory depression, this effect is not as strong as those with opioids and benzodiazepines . [20] Muscle relaxation - While the muscle relaxation experienced on pregabalin is not as powerful as that of diazepam or other\n\n\n                    Context: \n                    This excerpt summarizes pregabalin's physical effects, including sensory experiences like tingling and tactile enhancement, as well as potential adverse effects such as muscle twitching, seizures, respiratory depression, and muscle relaxation. It provides detailed descriptions of its tactile and muscular effects, highlighting both therapeutic and overdose-related risks, making it relevant for understanding pregabalin’s physical and toxicology profile within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_6", "document_index": 296, "latency_s": 1.06848689999606, "prompt_toks": 4295, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    this effect is not as strong as those with opioids and benzodiazepines . [20] Muscle relaxation - While the muscle relaxation experienced on pregabalin is not as powerful as that of diazepam or other benzodiazepines , it is still prominent. Dizziness - This effect is fairly prevalent at higher doses. Perception of bodily lightness - At very high doses, some users report feeling lighter. Increased libido or Decreased libido Orgasm depression - Some may experience a delayed but stronger orgasm even if they experience an increase in libido. Difficulty urinating - This effect is commonly reported by users. Frequent urination Motor control loss - At higher doses this effect resembles that of benzodiazepines and alcohol . Users report stumbling and bumping in to walls. Tactile suppression - This effect can result in the whole body feeling numb, particularly one’s face. At the same time the user’s sense of touch can be enhanced. Seizure suppression - Pregabalin is effective at reducing\n\n\n                    Context: \n                    This excerpt summarizes the physical and physiological effects of pregabalin at higher doses, including muscle relaxation, dizziness, perception of bodily lightness, libido alterations, difficulty urinating, motor control loss, tactile suppression, and seizure suppression. It highlights the drug’s sedative and motor impairing properties, providing detailed effects relevant for understanding pregabalin’s profile and safety considerations within the comprehensive webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_7", "document_index": 296, "latency_s": 0.5903588999935891, "prompt_toks": 4155, "completion_toks": 52}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - This effect can result in the whole body feeling numb, particularly one’s face. At the same time the user’s sense of touch can be enhanced. Seizure suppression - Pregabalin is effective at reducing certain types of seizures such as focal seizures and partial seizures. [21] [22] Pupil dilation\n\n\n                    Context: \n                    This section discusses pregabalin's physical effects, including sensory alterations like numbness and tactile enhancement, as well as its medical use for seizure suppression, particularly for focal and partial seizures. It highlights its impact on bodily sensations and its therapeutic relevance in epilepsy treatment.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_8", "document_index": 296, "latency_s": 0.9134133000043221, "prompt_toks": 4278, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Stimulation & Sedation -  Pregabalin produces mild sedation and improves sleep onset latency modestly. Several studies have shown pregabalin improves sleep quality of those who take it for various indications. It is unknown if this effect is carried over to those who take it recreationally. [17] [18] However, it is not an overly sedating substance when taken in the daytime.\n- Appetite enhancement - This effect is not particularly prominent, but is reported to occur in some people. It can have a synergistic effect when combined with cannabis .\n- Pain relief - Pregabalin is effective against certain types of chronic pain, particularly neuropathic pain, but not against acute pain. [19]\n- Spontaneous bodily sensations - The general \"body high\" of pregabalin can be described as a sharp, pleasurable tingling sensation which is location specific to the hands, feet, and head.\n\n\n                    Context: \n                    This excerpt summarizes pregabalin's physical and subjective effects, highlighting its mild sedation, potential appetite enhancement, analgesic properties for neuropathic pain, and the characteristic \"body high\" sensation. It provides key details on its sedative and analgesic profile, essential for understanding its psychoactive and physiological impacts within the full dossier.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_9", "document_index": 296, "latency_s": 1.3315810000058264, "prompt_toks": 4295, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Spontaneous bodily sensations - The general \"body high\" of pregabalin can be described as a sharp, pleasurable tingling sensation which is location specific to the hands, feet, and head.\n- Physical euphoria - This component, while prominent in the experience, is generally not as strong as the cognitive euphoria that can be induced. The sensation itself can be described as feelings of physical comfort, warmth and bliss.\n- Tactile enhancement - Although the user’s body may feel numb, the sense of touch can be heightened at the same time.\n- Muscle twitching - Somewhat paradoxically, since pregabalin is used as an adjunct treatment for epilepsy, pregabalin, especially in higher doses, can produce muscle spasms. [ citation needed ] Anecdotally, seizures have been reported in overdose. [ citation needed ]\n- Respiratory depression - While pregabalin may cause respiratory depression, this effect is not as strong as those with opioids and benzodiazepines . [20]\n\n\n                    Context: \n                    This excerpt summarizes pregabalin’s physical and sensory effects, including the \"body high,\" euphoria, tactile enhancement, muscle twitching, and respiratory depression. It provides detailed descriptions of bodily sensations, muscle spasms, and potential respiratory risks, making it useful for understanding pregabalin's physical effects and safety considerations within the broader pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_10", "document_index": 296, "latency_s": 0.79557040000509, "prompt_toks": 4270, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Respiratory depression - While pregabalin may cause respiratory depression, this effect is not as strong as those with opioids and benzodiazepines . [20]\n- Muscle relaxation - While the muscle relaxation experienced on pregabalin is not as powerful as that of diazepam or other benzodiazepines , it is still prominent.\n- Dizziness - This effect is fairly prevalent at higher doses.\n- Perception of bodily lightness - At very high doses, some users report feeling lighter.\n- Increased libido or Decreased libido\n- Orgasm depression - Some may experience a delayed but stronger orgasm even if they experience an increase in libido.\n- Difficulty urinating - This effect is commonly reported by users.\n- Frequent urination\n- Motor control loss - At higher doses this effect resembles that of benzodiazepines and alcohol . Users report stumbling and bumping in to walls.\n\n\n                    Context: \n                    This section summarizes key physical effects of pregabalin, detailing its impact on respiration, muscle relaxation, dizziness, bodily lightness, libido, orgasm, urination, and motor control, which are relevant for understanding its safety profile and side effects in the broader discussion of its subjective and physiological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_11", "document_index": 296, "latency_s": 1.830859000008786, "prompt_toks": 4265, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Frequent urination\n- Motor control loss - At higher doses this effect resembles that of benzodiazepines and alcohol . Users report stumbling and bumping in to walls.\n- Tactile suppression - This effect can result in the whole body feeling numb, particularly one’s face. At the same time the user’s sense of touch can be enhanced.\n- Seizure suppression - Pregabalin is effective at reducing certain types of seizures such as focal seizures and partial seizures. [21] [22]\n- Pupil dilation\nCognitive effects: - The cognitive effects of pregabalin can be broken down into several components which progressively intensify proportional to dosage. Pregabalin's headspace is comparable to a more clear-headed alcohol or benzodiazepine intoxication, although it can take a more dissociative turn at  high dosages.\n\n\n                    Context: \n                    This segment summarizes physical and cognitive effects of pregabalin, including common bodily sensations like frequent urination, motor control loss, tactile suppression, and pupil dilation. It also discusses the progression of cognitive effects with dosage, highlighting the intoxication-like headspace and dissociative potential, making it relevant for understanding pregabalin's overall pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_12", "document_index": 296, "latency_s": 0.987473700006376, "prompt_toks": 4285, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The most prominent of these cognitive effects generally include: Analysis suppression Empathy, affection, and sociability enhancement - Pregabalin presents distinct entactogen/empathogenic effects. In contrast to benzodiazepines (which merely increase sociability through disinhibition ), at high dosages pregabalin directly increases the urge to communicate with others with feelings of empathy, love, closeness and connection being well-defined. These effects, although weaker than that of MDMA , are still prominent. Ego inflation Novelty enhancement Suggestibility enhancement Amnesia - Compared to benzodiazepines , pregabalin is only mildly amnesiac if not combined with other depressants. With chronic usage or high dosages, one should expect more \"tip of the tongue\" moments and impaired short-term memory (e.g., walking into a room and forgetting what you were supposed to do there). Total blackouts do not seem to occur except in combination with other substances. Anxiety suppression\n\n\n                    Context: \n                    This section details the cognitive effects of pregabalin, including its influence on analysis, empathy, sociability, ego perception, and memory. It highlights pregabalin's entactogen/empathogenic properties, similarities to MDMA, and mild amnesiac tendencies at high doses. This information is crucial for understanding pregabalin's mental and emotional impacts within the broader discussion of its subjective experience and pharmacology.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_13", "document_index": 296, "latency_s": 0.8379070999944815, "prompt_toks": 4279, "completion_toks": 94}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    short-term memory (e.g., walking into a room and forgetting what you were supposed to do there). Total blackouts do not seem to occur except in combination with other substances. Anxiety suppression Emotion enhancement Cognitive euphoria [23] - Many users who take pregabalin describe a moderate to even intense euphoria, even at lower doses. Many users describe it as similar to opioid induced euphoria. The sensation itself can be described as powerful and overwhelming feelings of emotional bliss, contentment, and happiness. Disinhibition Dream potentiation Increased music appreciation - The music enhancement from pregabalin can be described as music sounding more detailed, 'higher quality', and even slowed down on higher dosages. Motivation enhancement - Like kratom , pregabalin can be mildly sedative yet increase motivation in a stimulant -like fashion. Immersion enhancement Creativity enhancement - This effect is especially noticeable on higher doses. Depersonalization and\n\n\n                    Context: \n                    This excerpt discusses the cognitive and subjective effects of pregabalin, highlighting sensations such as euphoria, emotional enhancement, increased music appreciation, motivation, creativity, and dissociative experiences like depersonalization. It provides detailed descriptions of these effects, emphasizing their intensity and variability, and is part of a broader section on pregabalin's physical, mental, and perceptual impacts. This information is relevant for understanding pregabalin’s psychoactive profile and potential recreational effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_14", "document_index": 296, "latency_s": 0.9448148999945261, "prompt_toks": 4308, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    can be mildly sedative yet increase motivation in a stimulant -like fashion. Immersion enhancement Creativity enhancement - This effect is especially noticeable on higher doses. Depersonalization and Derealization - At heavy doses, pregabalin can induce a mild dissociative state. The DPDR from pregabalin can be increased and made more negative (dysphoric) by sleep deprivation. Suicidal ideation - In heavy doses, this can lead to suicide attempts. Psychosis - Even at therapeutic doses, pregabalin has been shown to have psychotic side effects in a minority of it's users [24] [25] . Sleep deprivation strongly potentiates this effect, which may be higher for people genetically predisposed to schizophrenia. Mania - When used to treat bipolar disorder [26] ,it can cause mania, even from therapeutic doses. [27] . This effect typically occurs in a recreational settings, with heavy doses, or when the user is sleep-deprived. It can appear low in intensity (hypomania) or synergize with psychosis\n\n\n                    Context: \n                    This chunk summarizes the psychoactive effects of pregabalin related to sedation, motivation, dissociation, and severe mental health risks such as psychosis, mania, and suicidal ideation. It highlights how high doses and sleep deprivation can heighten these risks, providing essential information for understanding pregabalin’s subjective experience and safety considerations within the full pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_15", "document_index": 296, "latency_s": 0.6491951000061817, "prompt_toks": 4158, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    doses. [27] . This effect typically occurs in a recreational settings, with heavy doses, or when the user is sleep-deprived. It can appear low in intensity (hypomania) or synergize with psychosis . However, this effect is rare, and it's not a part of the typical experience. Thought deceleration\n\n\n                    Context: \n                    This passage discusses pregabalin’s potential to induce mania or psychosis-like effects at high, recreational doses, especially when sleep-deprived. It emphasizes that these effects are rare and not typical, but can include hypomania and thought deceleration, highlighting safety considerations. This information is relevant for understanding the risks and subjective effects associated with recreational use of pregabalin.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_16", "document_index": 296, "latency_s": 0.7414528999943286, "prompt_toks": 4291, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis suppression\n- Empathy, affection, and sociability enhancement - Pregabalin presents distinct entactogen/empathogenic effects. In contrast to benzodiazepines (which merely increase sociability through disinhibition ), at high dosages pregabalin directly increases the urge to communicate with others with feelings of empathy, love, closeness and connection being well-defined. These effects, although weaker than that of MDMA , are still prominent.\n- Ego inflation\n- Novelty enhancement\n- Suggestibility enhancement\n- Amnesia - Compared to benzodiazepines , pregabalin is only mildly amnesiac if not combined with other depressants. With chronic usage or high dosages, one should expect more \"tip of the tongue\" moments and impaired short-term memory (e.g., walking into a room and forgetting what you were supposed to do there). Total blackouts do not seem to occur except in combination with other substances.\n- Anxiety suppression\n- Emotion enhancement\n\n\n                    Context: \n                    This excerpt summarizes pregabalin's cognitive effects, highlighting its entactogen and empathogenic properties, such as increased sociability, empathy, ego inflation, and suggestion susceptibility. It also notes its impact on memory, anxiety, and emotion, providing detailed descriptions relevant to its subjective experience and potential uses or risks within the broader discussion of pregabalin's physical and psychological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_17", "document_index": 296, "latency_s": 0.7051546000002418, "prompt_toks": 4251, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Anxiety suppression\n- Emotion enhancement\n- Cognitive euphoria [23] - Many users who take pregabalin describe a moderate to even intense euphoria, even at lower doses. Many users describe it as similar to opioid induced euphoria. The sensation itself can be described as powerful and overwhelming feelings of emotional bliss, contentment, and happiness.\n- Disinhibition\n- Dream potentiation\n- Increased music appreciation - The music enhancement from pregabalin can be described as music sounding more detailed, 'higher quality', and even slowed down on higher dosages.\n- Motivation enhancement - Like kratom , pregabalin can be mildly sedative yet increase motivation in a stimulant -like fashion.\n- Immersion enhancement\n- Creativity enhancement - This effect is especially noticeable on higher doses.\n\n\n                    Context: \n                    This excerpt details the cognitive and emotional effects of pregabalin, including anxiety suppression, emotion enhancement, euphoria, disinhibition, dream potentiation, increased music appreciation, motivation, immersion, and creativity. It is part of the broader section on physical and mental subjective effects, providing specific insights into pregabalin's influence on mood, perception, and cognitive states relevant for understanding its recreational and therapeutic profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_18", "document_index": 296, "latency_s": 0.6635762999940198, "prompt_toks": 4230, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Immersion enhancement\n- Creativity enhancement - This effect is especially noticeable on higher doses.\n- Depersonalization and Derealization - At heavy doses, pregabalin can induce a mild dissociative state. The DPDR from pregabalin can be increased and made more negative (dysphoric) by sleep deprivation.\n- Suicidal ideation - In heavy doses, this can lead to suicide attempts.\n- Psychosis - Even at therapeutic doses, pregabalin has been shown to have psychotic side effects in a minority of it's users [24] [25] . Sleep deprivation strongly potentiates this effect, which may be higher for people genetically predisposed to schizophrenia.\n\n\n                    Context: \n                    This section outlines pregabalin's cognitive and psychological effects at higher doses, including immersion and creativity enhancement, as well as potential adverse mental health risks such as depersonalization, derealization, suicidal ideation, and psychosis, especially under sleep deprivation or in vulnerable individuals. It provides critical information on the drug’s dissociative and psychotic side effects relevant for understanding its dangerous or harmful potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_19", "document_index": 296, "latency_s": 0.5881047000002582, "prompt_toks": 4190, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Mania - When used to treat bipolar disorder [26] ,it can cause mania, even from therapeutic doses. [27] . This effect typically occurs in a recreational settings, with heavy doses, or when the user is sleep-deprived. It can appear low in intensity (hypomania) or synergize with psychosis . However, this effect is rare, and it's not a part of the typical experience.\n- Thought deceleration\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This section discusses pregabalin's potential psychiatric side effects, specifically highlighting that therapeutic or recreational doses can induce mania, especially in sleep-deprived or heavy-use scenarios, and notes the associated effect of thought deceleration. It is relevant to the pharmacological and subjective effects overview, providing insight into serious mental health risks associated with the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_20", "document_index": 296, "latency_s": 0.76993749999383, "prompt_toks": 4295, "completion_toks": 78}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - Colour enhancement Visual acuity suppression - At high dosages, pregabalin can induce slightly blurred vision. Tracers - This effect can be seen at high doses and is generally quite mild. It generally does not extend past level 2. Depth perception distortions - This effect is quite mild and only appears at very high doses. Object alteration - Although this effect is rare, it can still occur spontaneously, typically with heavy doses. Drifting After images and * Frame rate suppression at high / very high doses. These 2 effects together can make your vision feel more 'slow'. Double vision - This effect is quite mild and inconsistently appears at high doses. Hallucinatory states While pregabalin isn't commonly thought off as a hallucinogenic drug, it still can cause dissociative and even psychotic like effects at higher doses. Sleep deprivation and genetics might play a role into the hallucinatory states of Pregabalin. Pregabalin's hallucinatory states are (but not\n\n\n                    Context: \n                    This excerpt details the visual and hallucinatory effects associated with pregabalin use, including color enhancement, blurred vision, tracers, depth perception distortions, and rare hallucinations such as object activation and shadow people. It complements the broader discussion of pregabalin's physical and perceptual effects, providing specific insights into its visual hallucinations at high doses and under sleep deprivation conditions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_21", "document_index": 296, "latency_s": 0.6055841000052169, "prompt_toks": 4231, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    and even psychotic like effects at higher doses. Sleep deprivation and genetics might play a role into the hallucinatory states of Pregabalin. Pregabalin's hallucinatory states are (but not limited to) : Internal hallucination - At high dosages, one may experience dream-like states and hypnagogia . External hallucination - This effect is rare and only occurs on heavy doses and/or when the user is sleep deprived. This effect can be delirious /  psychotic in nature. It can include : Object activation , Shadow people and Transformations . It may include even non existent people and animals from a distance, but once the user comes closer they may disappear.\n\n\n                    Context: \n                    This segment discusses the hallucinatory and psychosis-like effects of pregabalin at higher doses, highlighting how sleep deprivation and genetics may influence these experiences. It details specific types of hallucinations, such as dream-like states and rare external hallucinations involving object activation, shadow figures, and transformations, which can appear delirious or psychotic in nature.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_22", "document_index": 296, "latency_s": 1.00203760000295, "prompt_toks": 4253, "completion_toks": 101}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Colour enhancement\n- Visual acuity suppression - At high dosages, pregabalin can induce slightly blurred vision.\n- Tracers - This effect can be seen at high doses and is generally quite mild. It generally does not extend past level 2.\n- Depth perception distortions - This effect is quite mild and only appears at very high doses.\n- Object alteration - Although this effect is rare, it can still occur spontaneously, typically with heavy doses.\n- Drifting\n- After images and * Frame rate suppression at high / very high doses. These 2 effects together can make your vision feel more 'slow'.\n- Double vision - This effect is quite mild and inconsistently appears at high doses.\n- Internal hallucination - At high dosages, one may experience dream-like states and hypnagogia .\n\n\n                    Context: \n                    This section details visual and perceptual effects of pregabalin at high doses, including colour enhancement, blurred vision, tracers, distortions, object alterations, drifting sensations, afterimages, frame rate suppression, double vision, and hallucinations. These effects are part of the drug's overall spectrum of sensory distortions and hallucinatory states, emphasizing its dissociative and perceptual impact during high-dose use. It is relevant for understanding pregabalin's visual and perceptual hallucinogenic potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_23", "document_index": 296, "latency_s": 0.6496935000031954, "prompt_toks": 4275, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Double vision - This effect is quite mild and inconsistently appears at high doses.\n- Internal hallucination - At high dosages, one may experience dream-like states and hypnagogia .\n- External hallucination - This effect is rare and only occurs on heavy doses and/or when the user is sleep deprived. This effect can be delirious /  psychotic in nature. It can include : Object activation , Shadow people and Transformations . It may include even non existent people and animals from a distance, but once the user comes closer they may disappear.\nAuditory effects: - Auditory enhancement Auditory distortion - These are usually mild and only present at extremely high doses. Auditory hallucination - At heavier dosages, one may experience tinnitus or the perception of imagined sounds, such as voices.\n- Auditory enhancement\n- Auditory distortion - These are usually mild and only present at extremely high doses.\n\n\n                    Context: \n                    This excerpt covers pregabalin's visual and auditory hallucinatory effects at high doses, including mild double vision, dream-like internal hallucinations, rare external psychotic hallucinations, and mild auditory distortions and tinnitus, highlighting the substance's dissociative and perceptual disturbances in elevated dosages.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_24", "document_index": 296, "latency_s": 1.5517046000022674, "prompt_toks": 4286, "completion_toks": 98}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Auditory enhancement\n- Auditory distortion - These are usually mild and only present at extremely high doses.\n- Auditory hallucination - At heavier dosages, one may experience tinnitus or the perception of imagined sounds, such as voices.\nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: - Visual disconnection - This effect is generally quite mild and appears inconsistently at  high doses. It results in feeling as if one's sense of vision is distant or vague and being viewed through a screen or window. However, pregabalin is rarely reported to cause holes, spaces and voids or hallucinatory structures .\n- Visual disconnection - This effect is generally quite mild and appears inconsistently at  high doses. It results in feeling as if one's sense of vision is distant or vague and being viewed through a screen or window. However, pregabalin is rarely reported to cause holes, spaces and voids or hallucinatory structures .\n\n\n                    Context: \n                    This excerpt covers pregabalin's auditory effects, including enhancement, distortion, and hallucinations at high doses, as well as visual disconnection phenomena experienced during intoxication. It is part of the broader section on sensory and perceptual effects, providing detailed information on how pregabalin impacts multisensory perception, especially under high-dose or sleep-deprived conditions. These details are relevant for understanding pregabalin's dissociative and hallucinogenic potential within the overall psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_25", "document_index": 296, "latency_s": 0.8362049999996088, "prompt_toks": 4294, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    After effects: - The effects during a offset of an Pregabalin experience are generally positive and more similar to an 'afterglow' rather then a 'hangover'. These effects are usually very mild compared to peak effects. The after effects of Pregabalin are: Motivation enhancement - Pregabalin is usually mentally stimulating, and the afterglow is similar. Since the high is mostly gone, this can lead to productivity enhancement. Increased music appreciation - This effect is not as strong as it would be in the high, but music is noticeably enhanced and sounds more detailed. Muscle relaxation - This effect is not as strong as the high but its still here in the afterglow. Motor control loss - This effect is weaker than the high but is still noticeable to the user. Driving while in the afterglow / comedown is a bad idea. Dizziness - The after effects are mostly positive with pregabalin, but dizziness can still be here, especially after doing a high dose.\n\n\n                    Context: \n                    This excerpt details the after effects of pregabalin use, describing the mild, positive \"afterglow\" experiences such as motivation, enhanced music appreciation, muscle relaxation, and residual dizziness. It supplements the broader pharmacological and subjective effects outlined in the full document, providing specific guidance on the post-peak state of use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 67, "doc_id": "doc_296", "num_chunks": 27, "chunk_id": "296::chunk_26", "document_index": 296, "latency_s": 0.8993664000008721, "prompt_toks": 4270, "completion_toks": 84}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Motivation enhancement - Pregabalin is usually mentally stimulating, and the afterglow is similar. Since the high is mostly gone, this can lead to productivity enhancement.\n- Increased music appreciation - This effect is not as strong as it would be in the high, but music is noticeably enhanced and sounds more detailed.\n- Muscle relaxation - This effect is not as strong as the high but its still here in the afterglow.\n- Motor control loss - This effect is weaker than the high but is still noticeable to the user. Driving while in the afterglow / comedown is a bad idea.\n- Dizziness - The after effects are mostly positive with pregabalin, but dizziness can still be here, especially after doing a high dose.\nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk summarizes the aftereffects of pregabalin use, including mood elevation, music appreciation, muscle relaxation, impaired motor control, and dizziness, highlighting post-peak physiological and cognitive effects. It provides key information on the residual impacts experienced during the comedown, relevant for understanding pregabalin's overall subjective profile and potential risks. These details are important for full comprehension of pregabalin's effects and harm potential.\n                "}
