{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_0", "document_index": 297, "latency_s": 0.5975806000060402, "prompt_toks": 4763, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Psilocin\npsychonaut_name: Psilocin\npsychonaut_url: https://psychonautwiki.org/wiki/Psilocin\n\n\n                    Context: \n                    This chunk provides the basic identification details for Psilocin, including its name and URL, situating it as the introductory reference point within the comprehensive document on its chemical properties, effects, and legal status. It serves as the foundational metadata for the detailed information that follows.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_1", "document_index": 297, "latency_s": 0.8687358000024687, "prompt_toks": 5027, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Psilocin | Chemical Nomenclature | Common names | Psilocin, Psilocine, Psilocyn, Psilotsin, 4-HO-DMT, 4-OH-DMT | Substitutive name | 4-Hydroxy-N,N-dimethyltryptamine | Systematic name | 3-[2-(Dimethylamino)ethyl]-1H-indol-4-ol | Class Membership | Psychoactive class | Psychedelic | Chemical class | Tryptamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 5 mg | Light | 10 - 15 mg | Common | 15 - 25 mg | Strong | 25 - 40 mg | Heavy | 40 mg + | Duration | Total | 4 - 6 hours | Onset | 20 - 45 minutes | Come up | 1.5 - 3 hours | Peak | 2 - 3 hours | Offset | 1.5 - 2 hours | After effects | 4 - 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for\n\n\n                    Context: \n                    This chunk provides a detailed infobox summary of Psilocin, including its chemical nomenclature, common names, classification, routes of administration, dosage ranges, and duration of effects. It serves as a concise reference within the larger document, supplementing the in-depth sections on its pharmacology, effects, and legal status to enhance quick information retrieval.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_2", "document_index": 297, "latency_s": 0.5539480000006733, "prompt_toks": 4777, "completion_toks": 52}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\n\n\n                    Context: \n                    This excerpt appears near the dosage and safety information section, emphasizing that Psilocin's dosage data is user-reported and for educational purposes only. It highlights the importance of verifying information from multiple sources, contextualizing the document's focus on responsible use and interaction descriptions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_3", "document_index": 297, "latency_s": 0.8954802000080235, "prompt_toks": 4775, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the key sections of the detailed analysis on psilocin, including its chemistry, pharmacology, subjective effects, toxicity, legal status, and related references. It serves as a navigational summary for the comprehensive information provided in the full document, highlighting the core topics covered for research, safety, and legal considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_4", "document_index": 297, "latency_s": 0.9944844999990892, "prompt_toks": 4934, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation - In terms of its effects on the physical energy levels of the tripper, psilocin is considered by most to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by compulsive yawning. Perception of bodily heaviness - This effect corresponds with the general sense of sedation and relaxation that characterizes psilocin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the trip. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens . Spontaneous physical sensations - The \"body high\" of psilocin can be described as a pleasurable, soft and all-encompassing tingling sensation or glow. This maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Once the peak of the experience or\n\n\n                    Context: \n                    This excerpt details the physical effects of psilocin, including sedation, perception of bodily heaviness, and spontaneous sensations, highlighting their typical manifestations and variations during a trip. It provides specific information on how psilocin impacts physical sensations and contrasts with other psychedelics, making it essential for understanding its physical profile within the comprehensive guide. These details are crucial for identifying and managing psilocin’s physical effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_5", "document_index": 297, "latency_s": 1.3635357000021031, "prompt_toks": 4931, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    tingling sensation or glow. This maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Once the peak of the experience or sensation is reached it can feel incredibly euphoric and tranquil or heavy and immobilizing depending on the dose. Physical euphoria - It should be noted that this effect is not as reliably induceable for psychedelics like psilocin than it is with other substance classes like stimulants or entactogens , and can just as easily manifest as physical discomfort for no apparent reason. Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually occurs around the peak of the experience or directly after. Users can feel as if they are physically part of or conjoined with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful. Tactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still\n\n\n                    Context: \n                    This excerpt describes the physical effects of psilocin, including sensations of tingling or glow, euphoria, changes in felt body form, and tactile enhancements. It highlights the variability and context-dependent nature of these sensations, emphasizing their appearance around the peak of the trip and their association with feelings of warmth, unity, and peacefulness. This section provides detailed insights into psilocin’s physical experiential profile within the broader psychedelic effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_6", "document_index": 297, "latency_s": 1.3309061999898404, "prompt_toks": 4937, "completion_toks": 58}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful. Tactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still present and unique in its character. It is repeatedly described as feeling very primitive in its nature often times with the small hairs on the users arms or legs feeling slightly itchy or even ticklish against the skin. Changes in felt gravity Nausea - This effect can be greatly lessened or even completely avoided if the individual has an empty stomach prior to ingestion. It is often recommended that one either refrain from eating for approximately 6 to 8 hours beforehand, or eat a light meal 3 to 4 hours before if they are feeling physically fatigued. In the rare circumstances that pure psilocin is ingested this effect is considered to be much less prominent than it is with psilocybin mushrooms . Excessive yawning - This effect seems to be uniquely pronounced among psilocin and related\n\n\n                    Context: \n                    This excerpt details the physical effects of psilocin, including tactile sensations, changes in gravity perception, nausea mitigation strategies, and yawning. It provides specific insights into the physical experience and recommended precautions, making it valuable for understanding psilocin's somatic impact within the comprehensive effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_7", "document_index": 297, "latency_s": 1.4121891999966465, "prompt_toks": 4916, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    is ingested this effect is considered to be much less prominent than it is with psilocybin mushrooms . Excessive yawning - This effect seems to be uniquely pronounced among psilocin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline . It typically occurs in combination with watery eyes . Brain zaps - Although this effect is very rare, it can still occur for those susceptible to it. This component is however much less common and intense than it is with serotonin releasing agents such as MDMA . Watery eyes Muscle contractions Olfactory hallucination Frequent urination Pupil dilation Runny nose Increased salivation Seizure - This is a rare effect but can happen in those predisposed to them, especially while in physically taxing conditions such as being dehydrated, undernourished, or fatigued.\n\n\n                    Context: \n                    This excerpt details the physical effects and potential side effects associated with psilocin consumption, including symptoms like excessive yawning, watery eyes, brain zaps, and rare seizures. It highlights differences in prominence compared to psilocybin mushrooms and notes conditions that may increase certain risks, making it relevant for understanding safety considerations and physical responses in the broader context of psilocin's pharmacology and effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_8", "document_index": 297, "latency_s": 0.9386564000014914, "prompt_toks": 4866, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - In terms of its effects on the physical energy levels of the tripper, psilocin is considered by most to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by compulsive yawning. Perception of bodily heaviness - This effect corresponds with the general sense of sedation and relaxation that characterizes psilocin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the trip. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens .\n\n\n                    Context: \n                    This excerpt details the physical effects of psilocin, emphasizing sedation, bodily heaviness, and related sensations experienced during a trip. It highlights how these effects contribute to the overall physical profile of psilocin, noting variations based on mushroom species such as Psilocybe azurescens. These details are essential for understanding psilocin’s physical impact within the broader discussion of its subjective and physiological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_9", "document_index": 297, "latency_s": 0.7078092999872752, "prompt_toks": 4816, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Perception of bodily heaviness - This effect corresponds with the general sense of sedation and relaxation that characterizes psilocin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the trip. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens .\n\n\n                    Context: \n                    This excerpt describes the physical effects of psilocin, specifically highlighting the perception of bodily heaviness as a common early effect characterized by sedation and relaxation. It emphasizes that this sensation typically occurs during the first half of the trip and is more pronounced with certain mushroom species like Psilocybe azurescens, making it relevant to the physical effects section of the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_10", "document_index": 297, "latency_s": 0.9938419000100112, "prompt_toks": 4931, "completion_toks": 94}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Spontaneous physical sensations - The \"body high\" of psilocin can be described as a pleasurable, soft and all-encompassing tingling sensation or glow. This maintains a consistent presence that steadily rises with the onset and hits its limit once the peak has been reached. Once the peak of the experience or sensation is reached it can feel incredibly euphoric and tranquil or heavy and immobilizing depending on the dose. Physical euphoria - It should be noted that this effect is not as reliably induceable for psychedelics like psilocin than it is with other substance classes like stimulants or entactogens , and can just as easily manifest as physical discomfort for no apparent reason.\n- Physical euphoria - It should be noted that this effect is not as reliably induceable for psychedelics like psilocin than it is with other substance classes like stimulants or entactogens , and can just as easily manifest as physical discomfort for no apparent reason.\n\n\n                    Context: \n                    This excerpt details psilocin's physical effects, specifically describing the \"body high,\" sensations of bodily warmth and heaviness, and the variability of physical euphoria. It highlights how these sensations develop during the peak and notes that physical euphoria is less reliably induced by psilocin compared to stimulants or entactogens, sometimes manifesting as discomfort. It is part of the broader section on physical effects within the comprehensive overview of psilocin's subjective experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_11", "document_index": 297, "latency_s": 0.9283932999969693, "prompt_toks": 4868, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually occurs around the peak of the experience or directly after. Users can feel as if they are physically part of or conjoined with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful.\n- Tactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still present and unique in its character. It is repeatedly described as feeling very primitive in its nature often times with the small hairs on the users arms or legs feeling slightly itchy or even ticklish against the skin.\n- Changes in felt gravity\n\n\n                    Context: \n                    This section details physical effects of psilocin, including altered somatic perception and tactile sensations, such as changes in felt bodily form, tactile enhancement, and felt gravity. These effects typically occur at or near the peak of the experience and contribute to the overall physical profile of psilocin's subjective impact. Understanding these physical sensations is crucial for comprehending psilocin's sensory and bodily influence in psychedelic experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_12", "document_index": 297, "latency_s": 0.7313013999955729, "prompt_toks": 4940, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Changes in felt gravity\n- Nausea - This effect can be greatly lessened or even completely avoided if the individual has an empty stomach prior to ingestion. It is often recommended that one either refrain from eating for approximately 6 to 8 hours beforehand, or eat a light meal 3 to 4 hours before if they are feeling physically fatigued. In the rare circumstances that pure psilocin is ingested this effect is considered to be much less prominent than it is with psilocybin mushrooms .\n- Excessive yawning - This effect seems to be uniquely pronounced among psilocin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline . It typically occurs in combination with watery eyes .\n- Brain zaps - Although this effect is very rare, it can still occur for those susceptible to it. This component is however much less common and intense than it is with serotonin releasing agents such as MDMA .\n- Watery eyes\n\n\n                    Context: \n                    This section details common physical side effects of psilocin, including changes in felt gravity, nausea mitigation strategies, excessive yawning often with watery eyes, potential for rare brain zaps, and watery eyes themselves. It provides practical information on physical reactions and precautions, fitting within the broader discussion of psilocin's physical and subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_13", "document_index": 297, "latency_s": 0.7478725999972085, "prompt_toks": 4904, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Watery eyes\n- Muscle contractions\n- Olfactory hallucination\n- Frequent urination\n- Pupil dilation\n- Runny nose\n- Increased salivation\n- Seizure - This is a rare effect but can happen in those predisposed to them, especially while in physically taxing conditions such as being dehydrated, undernourished, or fatigued.\nCognitive effects: - The cognitive effects of psilocin are described by many as extremely relaxing, profound and stoning in style when compared to other commonly used psychedelics such as LSD or 2C-B which tend to be energetic and stimulating, it is also regarded as being notably more lucid than psilocybin mushrooms but not as clearheaded as DMT . It contains a large number of both typical and unique psychedelic cognitive effects.\n\n\n                    Context: \n                    This excerpt details the physical and cognitive effects of psilocin, highlighting symptoms such as watery eyes, muscle contractions, olfactory hallucinations, and heightened salivation, along with rare but serious effects like seizures. It emphasizes psilocin’s relaxing, profound, and lucid cognitive profile compared to other psychedelics like LSD or 2C-B, making it a key section for understanding its physiological and mental impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_14", "document_index": 297, "latency_s": 0.8904954000026919, "prompt_toks": 4911, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The most prominent of these typical effects generally include: Enhancement and suppression cycles - This can be described as constant waves of extremely stimulated and profound thinking which are spontaneously surpassed in a cyclic fashion by waves of general thought suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes. Emotionality enhancement - This effect can be described as being more prominent, consistent and profound when compared to other traditional psychedelics such as mescaline or LSD . This can lead to strong feelings of compassion, urgency and even completely sporadic moments of intense emotional significance that can also be periodically affected by enhancement and suppression cycles . Empathy, affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a\n\n\n                    Context: \n                    This segment summarizes key cognitive effects of psilocin, including enhancement and suppression cycles of thinking, and heightened emotionality and empathy. It provides detailed descriptions of these typical psychological experiences, highlighting their cyclic nature and intensity compared to other psychedelics. This information is essential for understanding psilocin's mental and emotional impact as part of its broader pharmacology profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_15", "document_index": 297, "latency_s": 0.6734194000018761, "prompt_toks": 4899, "completion_toks": 56}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a less consistent rate. The sociability enhancement in particular only occurs rarely and it appears to be more emotional . Simultaneous emotions Language suppression - This effect can be described as a perceived inability or general unwillingness to talk aloud despite feeling perfectly capable of formulating coherent thoughts within one's internal narrative. It is much more common among inexperienced users. Autonomous voice communication Cognitive euphoria Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant. Conceptual thinking Personal bias suppression Novelty enhancement Immersion enhancement Creativity enhancement Feelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or\n\n\n                    Context: \n                    This excerpt discusses various subjective cognitive and emotional effects of psilocin, including sociability and emotional enhancement, language suppression, analysis and conceptual thinking, and feelings of impending doom, providing detailed descriptions of these experiences within the broader context of psilocin's psychopharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_16", "document_index": 297, "latency_s": 0.7784348999994108, "prompt_toks": 4919, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Novelty enhancement Immersion enhancement Creativity enhancement Feelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or subsides once the primary effects begin. It should be noted that this effect is relatively consistent and normal for psilocin and related tryptamines which is why a positive and well-informed mindset is key. Less regularly this aspect can also occur during the peak but will most often be met after with sensations of euphoria or rejuvenation . Catharsis - While this component can occur spontaneously, it typically follows a difficult phase of the experience, if not the entirety of the experience itself. Rejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocin trip and tends to slowly transition into the after effects which\n\n\n                    Context: \n                    This chunk covers the psychological and emotional effects of psilocin, including enhancement of creativity, immersion, and novelty, as well as common experiences like feelings of impending doom, catharsis, and rejuvenation during and after the trip. It provides detailed descriptions of these transient phenomena, highlighting their occurrence during different trip phases. This information is relevant for understanding the subjective mental states associated with psilocin use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_17", "document_index": 297, "latency_s": 0.8102088000014191, "prompt_toks": 4927, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocin trip and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocin and related tryptamines . Memory suppression Ego death Addiction suppression [8] Thought connectivity Thought deceleration Thought organization Confusion - This effect is commonly reported to occur at a higher rate than with other psychedelics such as LSD or mescaline . It is more commonly observed in users who are generally inexperienced with psychedelics. Delusion Déjà vu Increased music appreciation Increased sense of humor Laughter fits Mindfulness Ego replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca , it can still occur with high dosages. Personality regression\n\n\n                    Context: \n                    This excerpt covers the aftereffects and cognitive experiences associated with psilocin, including feelings of afterglow, memory suppression, ego death, and various psychological phenomena like delusion, deja vu, and personality regression. It highlights the mental and emotional states commonly reported during and after a psilocin trip, helping to understand the substance’s lasting effects and subjective impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_18", "document_index": 297, "latency_s": 0.956582900005742, "prompt_toks": 4805, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    fits Mindfulness Ego replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca , it can still occur with high dosages. Personality regression - While this effect is not typically observed, it can still spontaneously manifest and is thought to depend primarily on the user's set and setting . Time distortion\n\n\n                    Context: \n                    This section discusses specific subjective effects of psilocin, including rare experiences such as mindfulness and ego replacement, which are more common with psychedelics like DMT and ayahuasca. It also covers personality regression and time distortion, highlighting the variability of these effects depending on dosage, set, and setting within the broader context of psilocin's psychological and perceptual impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_19", "document_index": 297, "latency_s": 0.8963399999920512, "prompt_toks": 4860, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Enhancement and suppression cycles - This can be described as constant waves of extremely stimulated and profound thinking which are spontaneously surpassed in a cyclic fashion by waves of general thought suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes.\n- Emotionality enhancement - This effect can be described as being more prominent, consistent and profound when compared to other traditional psychedelics such as mescaline or LSD . This can lead to strong feelings of compassion, urgency and even completely sporadic moments of intense emotional significance that can also be periodically affected by enhancement and suppression cycles .\n\n\n                    Context: \n                    This chunk outlines key subjective effects of psilocin, detailing the cyclical nature of enhancement and suppression in thoughts and emotions, as well as the heightened and profound emotional responses compared to other psychedelics. It provides insight into the mental and emotional dynamics experienced during psilocin trips, crucial for understanding its cognitive and affective profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_20", "document_index": 297, "latency_s": 1.0217884000012418, "prompt_toks": 4898, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Empathy, affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a less consistent rate. The sociability enhancement in particular only occurs rarely and it appears to be more emotional .\n- Simultaneous emotions\n- Language suppression - This effect can be described as a perceived inability or general unwillingness to talk aloud despite feeling perfectly capable of formulating coherent thoughts within one's internal narrative. It is much more common among inexperienced users.\n- Autonomous voice communication\n- Cognitive euphoria\n- Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n- Conceptual thinking\n- Personal bias suppression\n- Novelty enhancement\n- Immersion enhancement\n- Creativity enhancement\n\n\n                    Context: \n                    This excerpt details the subjective cognitive effects of psilocin, including empathy, emotional enhancement, language suppression, autonomous voice communication, and various cognitive improvements like analysis, conceptual thinking, and creativity. It fits within the broader section on subjective psychedelic effects, highlighting psilocin's influence on emotional and mental states, particularly contrasting with other psychedelics like LSD or MDMA. These effects are crucial for understanding psilocin's unique psychological profile and user experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_21", "document_index": 297, "latency_s": 0.8723694999935105, "prompt_toks": 4921, "completion_toks": 58}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Feelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or subsides once the primary effects begin. It should be noted that this effect is relatively consistent and normal for psilocin and related tryptamines which is why a positive and well-informed mindset is key. Less regularly this aspect can also occur during the peak but will most often be met after with sensations of euphoria or rejuvenation . Catharsis - While this component can occur spontaneously, it typically follows a difficult phase of the experience, if not the entirety of the experience itself. Rejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocin trip and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful\n\n\n                    Context: \n                    This excerpt covers subjective psychological effects experienced during a psilocin trip, specifically feelings of impending doom during the come-up, and subsequent emotional processes such as catharsis and rejuvenation that occur during the offset and aftereffects, highlighting the importance of mindset and the typical progression of these experiences.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_22", "document_index": 297, "latency_s": 0.8937342999997782, "prompt_toks": 4797, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    It is however almost always felt during the offset of a psilocin trip and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocin and related tryptamines .\n\n\n                    Context: \n                    This paragraph discusses the aftereffects of psilocin trips, highlighting the common occurrence of a positive \"afterglow\" phase that typically arises during the offset period. It emphasizes the consistency of these mindful after-effects across psilocin and related tryptamines, making it relevant for understanding the post-trip experiences detailed in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_23", "document_index": 297, "latency_s": 0.7559638999955496, "prompt_toks": 4892, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Catharsis - While this component can occur spontaneously, it typically follows a difficult phase of the experience, if not the entirety of the experience itself.\n- Rejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocin trip and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocin and related tryptamines .\n- Memory suppression Ego death\n- Ego death\n- Addiction suppression [8]\n- Thought connectivity\n- Thought deceleration\n- Thought organization\n\n\n                    Context: \n                    This excerpt covers the aftereffects and cognitive effects associated with psilocin, including processes like catharsis, rejuvenation, ego death, and thought modulation. It is relevant for understanding the psychological and emotional phases of psilocin experiences, highlighting common post-trip phenomena and mental state changes. These details aid in comprehending the full scope of psilocin's psychoactive effects and potential outcomes.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_24", "document_index": 297, "latency_s": 0.8256472000066424, "prompt_toks": 4922, "completion_toks": 94}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Memory suppression Ego death\n- Ego death\n- Addiction suppression [8]\n- Thought connectivity\n- Thought deceleration\n- Thought organization\n- Confusion - This effect is commonly reported to occur at a higher rate than with other psychedelics such as LSD or mescaline . It is more commonly observed in users who are generally inexperienced with psychedelics.\n- Delusion\n- Déjà vu\n- Increased music appreciation\n- Increased sense of humor Laughter fits\n- Laughter fits\n- Mindfulness\n- Ego replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca , it can still occur with high dosages.\n- Personality regression - While this effect is not typically observed, it can still spontaneously manifest and is thought to depend primarily on the user's set and setting .\n- Time distortion\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This chunk lists cognitive and psychological effects of psilocin, including memory suppression, ego death, thought connectivity, confusion, delusions, and time distortion, which are key aspects of its psychoactive profile. It is part of the detailed effects section that describes subjective experiences during a psilocin trip, providing important information for understanding its mental and perceptual impacts. This section complements other effects categories and aids in comprehensive search retrieval related to psilocin's mental effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_25", "document_index": 297, "latency_s": 1.110995000010007, "prompt_toks": 4922, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - Enhancements Colour enhancement -  In comparison to other psychedelics, this effect may appear to be more saturated. Visual acuity enhancement - This effect typically occurs at lower to medium doses and becomes increasingly suppressed at higher doses. Magnification Pattern recognition enhancement Distortions Drifting ( melting , flowing , breathing and morphing ) - In comparison to other psychedelics, this effect can be described as highly detailed, realistic, slow and smooth in motion and static in appearance. Colour shifting Colour tinting Visual haze Diffraction Tracers After images Symmetrical texture repetition Perspective distortions Depth perception distortions Environmental orbism Scenery slicing Environmental patterning Geometry The visual geometry present on this substance can be described as more similar in appearance to that of 4-AcO-DMT , ayahuasca and 2C-E than LSD or 2C-B . It can be comprehensively described through its variations as intricate in\n\n\n                    Context: \n                    This excerpt details the visual effects associated with psilocin, including color enhancement, visual distortions, geometric patterns, and hallucinations. It compares psilocin's visual phenomena to other psychedelics like 4-AcO-DMT and ayahuasca, highlighting the specific characteristics and variations of the visual geometry experienced during use. This information is crucial for understanding the visual aspects of psilocin's subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_26", "document_index": 297, "latency_s": 1.128396400003112, "prompt_toks": 4948, "completion_toks": 110}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    this substance can be described as more similar in appearance to that of 4-AcO-DMT , ayahuasca and 2C-E than LSD or 2C-B . It can be comprehensively described through its variations as intricate in complexity, abstract in form, organic in feel, structured in organization, brightly lit, and multicoloured in scheme, glossy in shading, soft in its edges, large in size, slow in speed, smooth in motion, rounded in its corners, non-immersive in-depth and consistent in intensity. It has a very \"organic\" feel and at higher dosages is significantly more likely to result in states of Level 8B visual geometry over level 8A . Hallucinatory states Psilocin and its various other forms produce a full range of high level hallucinatory states in a fashion that is more consistent and reproducible than that of many other commonly used psychedelics . These effects generally include: Machinescapes Transformations Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ;\n\n\n                    Context: \n                    This excerpt provides a detailed description of the visual hallucination effects associated with psilocin, highlighting its similarity to substances like 4-AcO-DMT, ayahuasca, and 2C-E, and emphasizing its characteristic organic, intricate, and vivid visual states. It is relevant within the broader pharmacology and visual effects sections, offering specific insights into the nature and complexity of psilocin's hallucinations, including high-level geometrical and surreal imagery. These details are crucial for understanding the visual phenomenology of psilocin trips.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_27", "document_index": 297, "latency_s": 0.9318872000003466, "prompt_toks": 4915, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    that of many other commonly used psychedelics . These effects generally include: Machinescapes Transformations Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very consistent in dark environments at appropriately high dosages. They can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry -based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical, or transcendental nature in their overall theme. External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new\n\n\n                    Context: \n                    This excerpt details the visual hallucination effects of psilocin, emphasizing phenomena such as machinescapes, environmental transformations, and autonomous entity hallucinations, particularly in dark environments at high doses. It describes the nature, content, and themes of these hallucinations, highlighting their consistency and variability, and is a key part of the document's comprehensive overview of psilocin's visual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_28", "document_index": 297, "latency_s": 0.7231010000105016, "prompt_toks": 4815, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    and scenarios and plots ) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical or transcendental nature in their overall theme. Shadow people\n\n\n                    Context: \n                    This chunk details the characteristics of visual hallucinations associated with psilocin, specifically describing autonomous hallucinations like shadow people that predominantly occur in dark environments, with detailed variations in their believability, style, content, controllability, and thematic nature, highlighting their significance within the broader discussion of psilocin’s visual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_29", "document_index": 297, "latency_s": 0.7221067000064068, "prompt_toks": 4896, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Colour enhancement -  In comparison to other psychedelics, this effect may appear to be more saturated.\n- Visual acuity enhancement - This effect typically occurs at lower to medium doses and becomes increasingly suppressed at higher doses.\n- Magnification\n- Pattern recognition enhancement\n- Drifting ( melting , flowing , breathing and morphing ) - In comparison to other psychedelics, this effect can be described as highly detailed, realistic, slow and smooth in motion and static in appearance.\n- Colour shifting\n- Colour tinting\n- Visual haze\n- Diffraction\n- Tracers\n- After images\n- Symmetrical texture repetition\n- Perspective distortions\n- Depth perception distortions\n- Environmental orbism\n- Scenery slicing\n- Environmental patterning\n- Machinescapes\n- Transformations\n\n\n                    Context: \n                    This chunk details the visual effects associated with psilocin, including color and pattern enhancements, geometric distortions, and hallucinations. It provides specific descriptions of visual phenomena experienced at various doses, highlighting effects like drifting, color shifting, and environmental patterns. This information is essential for understanding psilocin's visual hallucination profile within the broader psychedelic effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_30", "document_index": 297, "latency_s": 0.9330922999943141, "prompt_toks": 4882, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Symmetrical texture repetition\n- Perspective distortions\n- Depth perception distortions\n- Environmental orbism\n- Scenery slicing\n- Environmental patterning\n- Machinescapes\n- Transformations\n- Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very consistent in dark environments at appropriately high dosages. They can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry -based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical, or transcendental nature in their overall theme.\n\n\n                    Context: \n                    This section details the visual hallucination effects of psilocin, specifically focusing on visual distortions, environmental alterations, and immersive internal hallucinations. It highlights phenomena such as symmetrical texture repetition, perspective and depth distortions, environmental patterns, scenery slicing, and autonomous internal landscapes, emphasizing their consistency in dark, high-dose settings and their thematic qualities. These visual effects are integral to understanding the psychedelic experience outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_31", "document_index": 297, "latency_s": 0.7676654999959283, "prompt_toks": 4864, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical or transcendental nature in their overall theme.\n- Shadow people\nAuditory effects: - Enhancements Distortions Hallucinations\n- Enhancements\n- Distortions\n- Hallucinations\n\n\n                    Context: \n                    This chunk details the visual phenomenon of external hallucinations induced by psilocin, emphasizing autonomous entities and landscapes, particularly in dark environments, with descriptions of their believability, controllability, and thematic nature. It also briefly mentions auditory hallucinations involving enhancements, distortions, and general hallucinations, contributing to the comprehensive overview of psilocin’s perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_32", "document_index": 297, "latency_s": 1.011662899996736, "prompt_toks": 4902, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Shadow people\nAuditory effects: - Enhancements Distortions Hallucinations\n- Enhancements\n- Distortions\n- Hallucinations\nMulti-sensory effects: - Synaesthesia - In its fullest manifestation, this is a very rare and non-reproducible effect. Increasing the dosage can increase the likelihood of this occurring, but seems to only be a prominent part of the experience among those who are already predisposed to synaesthetic states. Dosage independent intensity [ citation needed ]\n- Synaesthesia - In its fullest manifestation, this is a very rare and non-reproducible effect. Increasing the dosage can increase the likelihood of this occurring, but seems to only be a prominent part of the experience among those who are already predisposed to synaesthetic states.\n- Dosage independent intensity [ citation needed ]\n\n\n                    Context: \n                    This excerpt details the hallucination types and sensory effects associated with psilocin, specifically focusing on shadow people hallucinations, auditory distortions, and multisensory phenomena like synaesthesia. It highlights the rarity and dosage dependence of synaesthesia experiences, contributing to the comprehensive description of psilocin's visual and perceptual effects within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 68, "doc_id": "doc_297", "num_chunks": 34, "chunk_id": "297::chunk_33", "document_index": 297, "latency_s": 0.809654100012267, "prompt_toks": 4860, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Dosage independent intensity [ citation needed ]\nTranspersonal effects: - Anecdotally, components such as these are generally considered to be most consistent with the naturally occurring entheogenic tryptamines such as ayahuasca , ibogaine and psilocybin / psilocin . Spirituality enhancement Existential self-realization Unity and interconnectedness\n- Spirituality enhancement\n- Existential self-realization\n- Unity and interconnectedness\nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk details the transpersonal effects and related categories of psilocin, including spirituality, self-realization, interconnectedness, and disconnective and after effects. It highlights components that are considered to align with entheogenic tryptamines like ayahuasca and psilocybin, providing insights into the compound's profound psychological and spiritual impacts. These sections are essential for understanding psilocin's broader experiential and research contexts.\n                "}
