{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_0", "document_index": 298, "latency_s": 0.829894599999534, "prompt_toks": 4492, "completion_toks": 39}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Psilocybin\npsychonaut_name: Psilocybin\npsychonaut_url: https://psychonautwiki.org/wiki/Psilocybin\n\n\n                    Context: \n                    This chunk provides the basic identification details for Psilocybin, including its name, associated psychonaut, and official URL, serving as a foundational reference within the comprehensive psychedelic profile on the webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_1", "document_index": 298, "latency_s": 1.123240100001567, "prompt_toks": 4766, "completion_toks": 92}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Psilocybin mushrooms | Chemical Nomenclature | Common names | Psilocybin, Psilocybin mushrooms, Magic Mushrooms, Shrooms, 4-PO-DMT | Substitutive name | 4-Phosphoryloxy-N,N-dimethyltryptamine | Systematic name | 3-[2-(Dimethylamino)ethyl]-1H-indol-4-ol | Class Membership | Psychoactive class | Psychedelic | Chemical class | Tryptamine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 2.5 mg Psilocybin | Light | 2.5 - 10 mg Psilocybin | Common | 10 - 25 mg Psilocybin | Strong | 25 - 50 mg Psilocybin | Heavy | 50 mg Psilocybin + | Duration | Total | 6 - 8 hours | Onset | 20 - 45 minutes | Come up | 1 - 1.5 hours | Peak | 2 - 2.5 hours | [1] | Offset | 2.5 - 3.5 hours | After effects | 4 - 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for\n\n\n                    Context: \n                    This chunk is an infobox summarizing key chemical, dosage, and safety information about psilocybin mushrooms, including common names, chemical nomenclature, administration routes, dosage ranges, and duration of effects. It provides essential reference data that supports the detailed descriptions of psilocybin's physical, perceptual, and subjective effects found elsewhere in the full document. This structured summary aids quick retrieval of critical facts for research, medical, or educational purposes.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_2", "document_index": 298, "latency_s": 0.9492979000060586, "prompt_toks": 4566, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    up | 1 - 1.5 hours | Peak | 2 - 2.5 hours | [1] | Offset | 2.5 - 3.5 hours | After effects | 4 - 24 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions | Cannabis | Amphetamines | Cocaine | Tramadol | Lithium\n\n\n                    Context: \n                    This chunk summarizes the timing and dosage information for psilocybin's effects, including onset, peak, offset, and afterglow durations, as well as a disclaimer and potential interactions with substances like cannabis and stimulants. It provides essential details relevant to responsible use and understanding the drug's pharmacokinetics within the full guide on psilocybin.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_3", "document_index": 298, "latency_s": 0.8556202000036137, "prompt_toks": 4501, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the main sections of the comprehensive psilocybin webpage, including topics like chemistry, pharmacology, subjective effects, toxicity, legal status, and references. It serves as an overview of the key categories covered in the full document, facilitating targeted information retrieval related to psilocybin's properties, effects, and legal considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_4", "document_index": 298, "latency_s": 0.8607883999939077, "prompt_toks": 4657, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Neurogenesis [22] Sedation - Psilocybin mushrooms are reported to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by excessive yawning . Spontaneous bodily sensations - The \"body high\" of psilocybin can be described as a pleasurable, soft and all-encompassing tingling sensation or glow that steadily rises with the onset and hits its limit at the peak. Once the peak of the experience or sensation is reached it can feel incredibly euphoric and tranquil or heavy and immobilizing depending on the dose and setting. Perception of bodily heaviness - This effect corresponds to the general sense of sedation and relaxation that characterizes psilocybin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the experience. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as\n\n\n                    Context: \n                    This excerpt details the physical effects of psilocybin, including sedation, bodily sensations, and perception of heaviness, highlighting their characteristics, variability, and species-specific nuances. It provides essential information for understanding psilocybin’s physical impact within the broader psychoactive and perceptual effects discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_5", "document_index": 298, "latency_s": 0.8932098000077531, "prompt_toks": 4657, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    only prominent during the first half of the experience. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens . [ citation needed ] Tactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still present and unique in its character. It is repeatedly described as feeling very primitive in its nature often times with the small hairs on the user's arms or legs feeling slightly itchy or even ticklish against the skin. Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually occurs around the peak of the experience or directly after. Users can feel as if they are physically part of or conjoined with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful. Pain relief - This effect can be considered as less intense when compared with LSD. Like most psychedelics, this\n\n\n                    Context: \n                    This excerpt details individual physical effects of psilocybin, including tactile enhancement, changes in felt bodily form, and pain relief, highlighting their onset, intensity, and subjective experience. It emphasizes the physical sensations commonly reported during psilocybin trips, particularly in the first half of the experience, and notes variations based on mushroom species. This information is essential for understanding the sensory and physical profile of psilocybin's effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_6", "document_index": 298, "latency_s": 0.7578372999996645, "prompt_toks": 4659, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    This is usually reported as feeling comfortable in its sensations and even peaceful. Pain relief - This effect can be considered as less intense when compared with LSD. Like most psychedelics, this effects is likely a result of reductions in inflammation as well as from distortions in sensory processing. This effect, while common, is not guaranteed. An increase in pain perception is also possible. Nausea - This effect can be greatly lessened or even completely avoided if the individual has an empty stomach prior to ingestion. It is often recommended that one either refrain from eating for approximately 6 to 8 hours beforehand, or eat a light meal 3 to 4 hours before if they are feeling physically fatigued. Changes in felt gravity Excessive yawning - This effect seems to be uniquely pronounced among psilocybin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline . It typically occurs in combination with watery\n\n\n                    Context: \n                    This excerpt summarizes key physical effects experienced during a psilocybin trip, including sensations of comfort, pain relief, nausea management, and bodily sensations like gravity changes and yawning. It provides detailed insights into common physical responses and considerations, making it relevant for understanding psilocybin's tactile and physiological impact within the comprehensive use, effects, and safety information in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_7", "document_index": 298, "latency_s": 0.842698599997675, "prompt_toks": 4626, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    among psilocybin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline . It typically occurs in combination with watery eyes . Watery eyes Frequent urination Muscle contractions Olfactory hallucination Pupil dilation Runny nose Increased salivation Brain zaps [ citation needed ] - Although this effect is very rare, it can still occur for those susceptible to it. This component is however much less common and intense than it is with serotonin releasing agents such as MDMA . Seizure [ citation needed ] - This is a rare effect but can happen in a small population of those who are predisposed to them, particularly while in physically taxing conditions such as being dehydrated, undernourished, overheated, or fatigued.\n\n\n                    Context: \n                    This segment details common physical and rare adverse effects associated with psilocybin and related tryptamines, including watery eyes, nasal symptoms, brain zaps, and seizure risks. It highlights effects that occur less frequently or in susceptible individuals, offering important safety considerations within the comprehensive overview of psilocybin's physical and toxicological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_8", "document_index": 298, "latency_s": 0.9666897999995854, "prompt_toks": 4581, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Neurogenesis [22]\n- Sedation - Psilocybin mushrooms are reported to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by excessive yawning .\n- Spontaneous bodily sensations - The \"body high\" of psilocybin can be described as a pleasurable, soft and all-encompassing tingling sensation or glow that steadily rises with the onset and hits its limit at the peak. Once the peak of the experience or sensation is reached it can feel incredibly euphoric and tranquil or heavy and immobilizing depending on the dose and setting.\n\n\n                    Context: \n                    This excerpt covers the physical effects of psilocybin, including neurogenesis, sedation, and bodily sensations. It highlights how psilocybin induces relaxation, mild sedation, yawning, and a characteristic \"body high\" sensation that peaks with euphoria or heaviness, providing detailed descriptions relevant to understanding its physical and perceptual impacts within the comprehensive overview of psilocybin's effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_9", "document_index": 298, "latency_s": 0.6885379000013927, "prompt_toks": 4614, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Perception of bodily heaviness - This effect corresponds to the general sense of sedation and relaxation that characterizes psilocybin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the experience. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens . [ citation needed ]\n- Tactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still present and unique in its character. It is repeatedly described as feeling very primitive in its nature often times with the small hairs on the user's arms or legs feeling slightly itchy or even ticklish against the skin.\n\n\n                    Context: \n                    This section details key physical effects of psilocybin, including sensations of bodily heaviness and tactile enhancement, which contribute to the overall physical and sensory experience. It highlights how these effects vary with dosage and mushroom species, such as Psilocybe azurescens, and provides insights into the sensory modifications characteristic of psilocybin trips.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_10", "document_index": 298, "latency_s": 0.6071688999945763, "prompt_toks": 4658, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually occurs around the peak of the experience or directly after. Users can feel as if they are physically part of or conjoined with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful.\n- Pain relief - This effect can be considered as less intense when compared with LSD. Like most psychedelics, this effects is likely a result of reductions in inflammation as well as from distortions in sensory processing. This effect, while common, is not guaranteed. An increase in pain perception is also possible.\n- Nausea - This effect can be greatly lessened or even completely avoided if the individual has an empty stomach prior to ingestion. It is often recommended that one either refrain from eating for approximately 6 to 8 hours beforehand, or eat a light meal 3 to 4 hours before if they are feeling physically fatigued.\n- Changes in felt gravity\n\n\n                    Context: \n                    This chunk summarizes key physical effects of psilocybin, including changes in bodily perception, pain relief, nausea mitigation strategies, and alterations in felt gravity. It provides essential details on these physiological sensations and practical considerations, situating them within the broader discussion of psilocybin's physical and sensory effects in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_11", "document_index": 298, "latency_s": 0.9412019000010332, "prompt_toks": 4661, "completion_toks": 92}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Changes in felt gravity\n- Excessive yawning - This effect seems to be uniquely pronounced among psilocybin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline . It typically occurs in combination with watery eyes .\n- Watery eyes\n- Frequent urination\n- Muscle contractions\n- Olfactory hallucination\n- Pupil dilation\n- Runny nose\n- Increased salivation\n- Brain zaps [ citation needed ] - Although this effect is very rare, it can still occur for those susceptible to it. This component is however much less common and intense than it is with serotonin releasing agents such as MDMA .\n- Seizure [ citation needed ] - This is a rare effect but can happen in a small population of those who are predisposed to them, particularly while in physically taxing conditions such as being dehydrated, undernourished, overheated, or fatigued.\n\n\n                    Context: \n                    This excerpt details physical effects associated with psilocybin use, including sensations like changes in felt gravity, and common physiological responses such as yawning, watery eyes, nausea, and pupil dilation. It highlights rare adverse effects like brain zaps and seizures, emphasizing the importance of understanding both typical and less common physical reactions within the broader discussion of psilocybin's effects. This information is crucial for comprehensive safety and effect profiling of psilocybin.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_12", "document_index": 298, "latency_s": 0.8169612000056077, "prompt_toks": 4641, "completion_toks": 54}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - Emotion enhancement - This effect can be described as being more prominent, consistent and profound when compared to other traditional psychedelics such as mescaline or LSD . This can lead to strong feelings of compassion, urgency and even completely sporadic moments of intense emotional significance that can also be periodically affected by enhancement and suppression cycles . Empathy, affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a less consistent rate. The sociability enhancement in particular only occurs rarely and it appears to be more emotional . Euthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for\n\n\n                    Context: \n                    This chunk expands on the cognitive effects of psilocybin, detailing emotional enhancement, empathy and sociability effects, and the therapeutic potential of psychedelics when combined with psychotherapy, providing in-depth descriptions relevant for understanding psilocybin's mental and emotional impact.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_13", "document_index": 298, "latency_s": 0.7856824999907985, "prompt_toks": 4628, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for several mental health problems. Language suppression - This effect can be described as a perceived inability or general unwillingness to talk aloud despite feeling perfectly capable of formulating coherent thoughts within one's internal narrative. It is much more common among inexperienced users. Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant. Enhancement and suppression cycles - This can be described as constant waves of extremely stimulated and profound thinking which are spontaneously surpassed in a cyclic fashion by waves of general thought suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes. Feelings of impending doom - This effect is usually only\n\n\n                    Context: \n                    This excerpt covers the psychological effects and mental states associated with psilocybin use, including its potential therapeutic benefits when combined with psychotherapy, as well as common cognitive phenomena such as language suppression, analysis enhancement, cyclic thinking, and feelings of impending doom. These details are relevant for understanding psilocybin's subjective experience, mental health applications, and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_14", "document_index": 298, "latency_s": 0.948159100007615, "prompt_toks": 4649, "completion_toks": 77}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes. Feelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or subsides once the primary effects begin. It should be noted that this effect is relatively consistent and normal for psilocybin and related tryptamines which is why a positive and well-informed mindset is key. Less regularly this aspect can also occur during the peak but will most often be met afterwards with sensations of euphoria , catharsis or rejuvenation . Cognitive euphoria Autonomous voice communication Suggestibility enhancement Conceptual thinking Thought connectivity Thought deceleration Thought loops Thought organization Confusion - This effect occurs at a higher rate than other psychedelics such as LSD or DMT . It is more commonly observed in users who are inexperienced with psilocybin, or psychedelics in\n\n\n                    Context: \n                    This excerpt details the cognitive effects experienced during a psilocybin trip, including thought cycles, confusion, and feelings of impending doom, emphasizing their cyclical nature and variability depending on user experience. It highlights the importance of mindset and describes phenomena such as mental intoxication and episodes of thought loops, situating them within the broader discussion of psilocybin's subjective and psychological effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_15", "document_index": 298, "latency_s": 1.1354055999981938, "prompt_toks": 4647, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Confusion - This effect occurs at a higher rate than other psychedelics such as LSD or DMT . It is more commonly observed in users who are inexperienced with psilocybin, or psychedelics in general Novelty enhancement Creativity enhancement Delusion Déjà vu Increased music appreciation Immersion enhancement Memory enhancement Memory suppression Ego death Mindfulness Simultaneous emotions Personal bias suppression Ego replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca , it can still spontaneously occur, usually with higher doses. Personality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting . Catharsis Rejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a\n\n\n                    Context: \n                    This chunk details the cognitive and subjective effects associated with psilocybin, highlighting increased confusion, novelty, creativity, and rare phenomena like ego death and personality regression. It is part of the larger section on subjective effects, providing specific insights into the mental states and experiences that users may encounter during a psilocybin episode. These details are essential for understanding psilocybin's impact on consciousness and perception.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_16", "document_index": 298, "latency_s": 0.8079579999903217, "prompt_toks": 4558, "completion_toks": 104}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocybin experience and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocybin and related tryptamines . Addiction suppression [29] Time distortion\n\n\n                    Context: \n                    This excerpt discusses the after effects of psilocybin, highlighting that feelings of rejuvenation or catharsis often follow difficult phases of the experience and transition into a positive \"afterglow,\" a common and consistent phenomenon. It is part of the section on physical, cognitive, and emotional effects, emphasizing psilocybin's characteristic after-effects like the suppression of addiction and time distortion. This information is relevant for understanding the post-peak phase of psilocybin's psychoactive profile and its potential therapeutic benefits.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_17", "document_index": 298, "latency_s": 1.2628435999940848, "prompt_toks": 4589, "completion_toks": 81}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Emotion enhancement - This effect can be described as being more prominent, consistent and profound when compared to other traditional psychedelics such as mescaline or LSD . This can lead to strong feelings of compassion, urgency and even completely sporadic moments of intense emotional significance that can also be periodically affected by enhancement and suppression cycles .\n- Empathy, affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a less consistent rate. The sociability enhancement in particular only occurs rarely and it appears to be more emotional .\n\n\n                    Context: \n                    This excerpt details psilocybin's subjective cognitive effects, specifically its capacity to enhance emotions, compassion, and sociability. It emphasizes that emotion enhancement is more intense and consistent compared to other psychedelics like mescaline or LSD, while sociability effects are rarer and more nuanced. This information is part of the broader description of psilocybin's psychological and perceptual impact on users.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_18", "document_index": 298, "latency_s": 0.8930232999991858, "prompt_toks": 4574, "completion_toks": 67}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Euthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for several mental health problems.\n- Language suppression - This effect can be described as a perceived inability or general unwillingness to talk aloud despite feeling perfectly capable of formulating coherent thoughts within one's internal narrative. It is much more common among inexperienced users.\n- Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n\n\n                    Context: \n                    This section details key cognitive effects of psilocybin, including emotional and analytical states. It highlights how psychedelics can enhance mood and insight (euthymia), suppress verbal expression (language suppression), and improve introspective analysis. These effects are relevant for understanding psilocybin's impact on mental processes and therapeutic potential.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_19", "document_index": 298, "latency_s": 0.548858600013773, "prompt_toks": 4641, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n- Enhancement and suppression cycles - This can be described as constant waves of extremely stimulated and profound thinking which are spontaneously surpassed in a cyclic fashion by waves of general thought suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes.\n- Feelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or subsides once the primary effects begin. It should be noted that this effect is relatively consistent and normal for psilocybin and related tryptamines which is why a positive and well-informed mindset is key. Less regularly this aspect can also occur during the peak but will most often be met afterwards with sensations of euphoria , catharsis or rejuvenation .\n- Cognitive euphoria\n- Autonomous voice communication\n\n\n                    Context: \n                    This section details various subjective mental effects of psilocybin, including cognitive and perceptual phenomena. It covers effects like analysis enhancement, cyclic thought patterns, feelings of impending doom, cognitive euphoria, and autonomous voice communication, providing insights into the mental states induced by psilocybin during a psychedelic experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_20", "document_index": 298, "latency_s": 0.7346774000034202, "prompt_toks": 4676, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Cognitive euphoria\n- Autonomous voice communication\n- Suggestibility enhancement\n- Conceptual thinking\n- Thought connectivity\n- Thought deceleration\n- Thought loops\n- Thought organization\n- Confusion - This effect occurs at a higher rate than other psychedelics such as LSD or DMT . It is more commonly observed in users who are inexperienced with psilocybin, or psychedelics in general\n- Novelty enhancement\n- Creativity enhancement\n- Delusion\n- Déjà vu\n- Increased music appreciation\n- Immersion enhancement\n- Memory enhancement\n- Memory suppression Ego death\n- Ego death\n- Mindfulness\n- Simultaneous emotions\n- Personal bias suppression\n- Ego replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca , it can still spontaneously occur, usually with higher doses.\n- Personality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting .\n- Catharsis\n\n\n                    Context: \n                    This segment details the cognitive and psychological effects of psilocybin, including enhanced thought processes, emotional experiences, and rare phenomena like ego death and personality regression. It highlights effects such as confusion, delusion, and ego replacement that are key to understanding psilocybin's mental impact, making it essential for comprehensive effect analysis within the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_21", "document_index": 298, "latency_s": 0.9631469000014476, "prompt_toks": 4608, "completion_toks": 86}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Personality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting .\n- Catharsis\n- Rejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocybin experience and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocybin and related tryptamines .\n- Addiction suppression [29]\n- Time distortion\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This chunk covers subjective psychological effects of psilocybin, including rare phenomena like personality regression, common afterglow experiences such as catharsis and rejuvenation, and notes on addiction suppression and time distortion. It is relevant for understanding psilocybin's mental and emotional impact, as well as its potential therapeutic and cultural significance. These details enhance comprehensive searches related to psilocybin's psychological and experiential effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_22", "document_index": 298, "latency_s": 2.1282025999971665, "prompt_toks": 4651, "completion_toks": 97}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - Enhancements Colour enhancement - Relative to other psychedelics, this effect may appear to be more saturated. Pattern recognition enhancement Visual acuity enhancement - This effect typically occurs prominently at lower doses and becomes increasingly suppressed as one raises the dose. [ citation needed ] Distortions Drifting ( melting , flowing , breathing and morphing ) - In comparison to other psychedelics, this effect can be described as highly detailed, realistic, slow and smooth in motion and static in appearance. Colour shifting Colour tinting Visual haze Diffraction Tracers After images Symmetrical texture repetition Perspective distortions Depth perception distortions Recursion Environmental orbism Scenery slicing Geometry The visual geometry produced by psilocybin mushrooms can be described as more similar in appearance to that of 4-AcO-DMT , ayahuasca and 2C-E than LSD or 2C-B . It can be comprehensively described through its variations as intricate in\n\n\n                    Context: \n                    This excerpt details the visual effects of psilocybin, including enhancements like color saturation, pattern recognition, and visual acuity, as well as distortions such as drifting, color shifting, and perspective changes. It also compares psilocybin's visual geometry to other psychedelics like 4-AcO-DMT, ayahuasca, and 2C-E. This section is relevant for understanding the characteristic visual hallucinations produced during a psilocybin experience.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_23", "document_index": 298, "latency_s": 1.4812188000069, "prompt_toks": 4676, "completion_toks": 91}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    mushrooms can be described as more similar in appearance to that of 4-AcO-DMT , ayahuasca and 2C-E than LSD or 2C-B . It can be comprehensively described through its variations as intricate in complexity, abstract in form, organic in feel, structured in organization, brightly lit, and multicoloured in scheme, glossy in shading, soft in its edges, large in size, slow in speed, smooth in motion, rounded in its corners, non-immersive in-depth and consistent in intensity. It has a very \"organic\" feel and at higher dosages is significantly more likely to result in states of Level 8B visual geometry over level 8A . Hallucinatory states Psilocybin and its various other forms produce a full range of high level hallucinatory states in a fashion that is more consistent and reproducible than that of many other commonly used psychedelics . These effects generally include: Machinescapes Transformations Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective\n\n\n                    Context: \n                    This excerpt provides a detailed description of the visual hallucination characteristics associated with psilocybin mushrooms, highlighting their organic, intricate, and colorful visual effects. It emphasizes the similarities to compounds like 4-AcO-DMT, ayahuasca, and 2C-E, and discusses high-level hallucinatory states such as machinescapes and transformations, situating it within the broader section on physical and visual effects of psilocybin.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_24", "document_index": 298, "latency_s": 1.0329094000044279, "prompt_toks": 4641, "completion_toks": 91}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    many other commonly used psychedelics . These effects generally include: Machinescapes Transformations Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very consistent in dark environments at appropriately high dosages. They can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry -based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical, or transcendental nature in their overall theme. External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in\n\n\n                    Context: \n                    This excerpt details psilocybin-induced visual hallucinations, specifically describing internal and external hallucinations, such as autonomous entities, landscapes, and scenarios, which are common at high doses in dark environments. It emphasizes the detailed, controllable nature of these effects and their thematic diversity, highlighting their significance in the overall discussion of psilocybin's visual effects. This content is relevant for understanding the hallucinatory states associated with psilocybin use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_25", "document_index": 298, "latency_s": 0.8130401999951573, "prompt_toks": 4536, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    and plots ) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical or transcendental nature in their overall theme.\n\n\n                    Context: \n                    This excerpt describes the characteristics of internal hallucinations (autonomous entities, settings, and scenarios) produced by psilocybin, emphasizing their prevalence in dark environments and their detailed, believable, and theme-specific nature, which is integral to understanding psilocybin's visual hallucination profile within the broader discussion of its effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_26", "document_index": 298, "latency_s": 0.8613918999908492, "prompt_toks": 4620, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Colour enhancement - Relative to other psychedelics, this effect may appear to be more saturated.\n- Pattern recognition enhancement\n- Visual acuity enhancement - This effect typically occurs prominently at lower doses and becomes increasingly suppressed as one raises the dose. [ citation needed ]\n- Drifting ( melting , flowing , breathing and morphing ) - In comparison to other psychedelics, this effect can be described as highly detailed, realistic, slow and smooth in motion and static in appearance.\n- Colour shifting\n- Colour tinting\n- Visual haze\n- Diffraction\n- Tracers\n- After images\n- Symmetrical texture repetition\n- Perspective distortions\n- Depth perception distortions\n- Recursion\n- Environmental orbism\n- Scenery slicing\n- Machinescapes\n- Transformations\n\n\n                    Context: \n                    This excerpt details the visual effects associated with psilocybin, including colour and pattern enhancements, distortions, and hallucinations. It provides specific phenomena such as drifting, colour shifting, visual haze, tracers, and scenery slicing, offering a comprehensive overview of psilocybin’s hallmark visual experiences within the broader document on its effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_27", "document_index": 298, "latency_s": 0.687938100003521, "prompt_toks": 4611, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - After images\n- Symmetrical texture repetition\n- Perspective distortions\n- Depth perception distortions\n- Recursion\n- Environmental orbism\n- Scenery slicing\n- Machinescapes\n- Transformations\n- Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - This effect is very consistent in dark environments at appropriately high dosages. They can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry -based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical, or transcendental nature in their overall theme.\n\n\n                    Context: \n                    This chunk details common visual hallucination effects associated with psilocybin, including patterns, distortions, and elaborate internal visions, particularly emphasizing the prevalence of internal hallucinations in dark environments at high doses with themes of spirituality, science fiction, and surrealism, which are integral to understanding psilocybin's visual effects section.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_28", "document_index": 298, "latency_s": 0.7217916999943554, "prompt_toks": 4590, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical or transcendental nature in their overall theme.\nAuditory effects: - Auditory enhancement Auditory distortion Auditory hallucination\n- Auditory enhancement\n- Auditory distortion\n- Auditory hallucination\n\n\n                    Context: \n                    This excerpt details psilocybin-induced visual hallucinations, specifically external hallucinations involving autonomous entities, landscapes, and scenarios, highlighting their occurrence in dark environments and thematic characteristics. It also lists auditory effects including enhancement, distortion, and hallucinations. These sections are integral to understanding psilocybin's perceptual and sensory impact, essential for comprehensive knowledge and responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_29", "document_index": 298, "latency_s": 0.7143494000047212, "prompt_toks": 4628, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Auditory effects: - Auditory enhancement Auditory distortion Auditory hallucination\n- Auditory enhancement\n- Auditory distortion\n- Auditory hallucination\nMulti-sensory effects: - Synaesthesia - In its fullest manifestation, this is a very rare and non-reproducible effect. Increasing the dosage can increase the likelihood of this occurring, but seems to only be a prominent part of the experience among those who are already predisposed to synaesthetic states. Dosage independent intensity [ citation needed ]\n- Synaesthesia - In its fullest manifestation, this is a very rare and non-reproducible effect. Increasing the dosage can increase the likelihood of this occurring, but seems to only be a prominent part of the experience among those who are already predisposed to synaesthetic states.\n- Dosage independent intensity [ citation needed ]\n\n\n                    Context: \n                    This excerpt details the auditory and multi-sensory effects associated with psilocybin use, including auditory hallucinations, enhancements, distortions, and rare phenomena like synaesthesia. It is part of the comprehensive section on psychedelic effects, providing specific insights into sensory distortions that occur during psilocybin experiences. This information is essential for understanding the full profile of psilocybin’s subjective effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 69, "doc_id": "doc_298", "num_chunks": 31, "chunk_id": "298::chunk_30", "document_index": 298, "latency_s": 1.043573600007221, "prompt_toks": 4589, "completion_toks": 97}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Dosage independent intensity [ citation needed ]\nTranspersonal effects: - Anecdotally, these components are generally considered to be most consistent with the naturally-occurring entheogenic tryptamines such as ayahuasca , ibogaine and psilocybin. They are listed below as follows: Spirituality enhancement Existential self-realization Unity and interconnectedness\n- Spirituality enhancement\n- Existential self-realization\n- Unity and interconnectedness\nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk details the transpersonal effects associated with psilocybin, emphasizing themes like spirituality, self-realization, and interconnectedness, and notes their similarity to other entheogenic tryptamines such as ayahuasca and ibogaine. It also briefly lists related effects and categories like disconnective effects, after effects, and research topics, serving as a concise overview of psilocybin’s profound psychological and existential impacts within the broader context of its subjective and transpersonal effects.\n                "}
