{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_0", "document_index": 302, "latency_s": 0.6364177000068594, "prompt_toks": 1726, "completion_toks": 36}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Temazepam\npsychonaut_name: Temazepam\npsychonaut_url: https://psychonautwiki.org/wiki/Temazepam\n\n\n                    Context: \n                    This chunk provides fundamental identification information for Temazepam, including its name and URL, serving as an introductory reference within the comprehensive pharmacological and effects profile detailed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_1", "document_index": 302, "latency_s": 0.9705453000060515, "prompt_toks": 1983, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Temazepam | Chemical Nomenclature | Common names | Temazepam, Restoril, Normison | Substitutive name | Temazepam | Systematic name | 7-Chloro-1,3-dihydro-3-hydroxy-1-methyl-5-phenyl-1,4-benzodiazepin-2-one | Class Membership | Psychoactive class | Depressant | Chemical class | Benzodiazepine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 96% | [3] | Threshold | 2 mg | Light | 5 - 10 mg | Common | 10 - 30 mg | Strong | 30 - 40 mg | Heavy | 40 mg + | [2] | Duration | Total | 7 - 8 hours | [2] | Onset | 30 - 60 minutes | [2] | After effects | 3.5 - 18.4 hours | [3] | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\n\n\n                    Context: \n                    This chunk contains key pharmacological and usage details about Temazepam, including its chemical classification, common names, administration routes, dosage ranges, bioavailability, duration, onset, and disclaimer statements. It provides essential reference information that supports the full document's comprehensive overview of Temazepam's effects, risks, and legal considerations. The data is crucial for understanding its pharmacokinetics and responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_2", "document_index": 302, "latency_s": 0.6332800000091083, "prompt_toks": 1738, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk provides the main section headers of the webpage, outlining key topics such as chemistry, pharmacology, subjective effects, toxicity, legal status, and references related to Temazepam. It serves as an overview of the topics covered in detail within the full document, facilitating navigation and search relevance for information on this benzodiazepine.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_3", "document_index": 302, "latency_s": 0.7160968000098364, "prompt_toks": 1884, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation -  In terms of energy level alterations, this drug has the potential to be extremely sedating and often results in an overwhelmingly lethargic state. At higher levels, this causes users to suddenly feel as if they are extremely sleep deprived and have not slept for days, forcing them to sit down and generally feel as if they are constantly on the verge of passing out instead of engaging in physical activities. This sense of sleep deprivation increases proportional to dosage and eventually becomes powerful enough to force a person into complete unconsciousness. Dizziness Muscle relaxation Motor control loss Respiratory depression Seizure suppression Decreased heart rate Perception of bodily heaviness -  Temazepam is known to cause feelings of heaviness in the body. This effect can range from motor impairment and difficulty moving at lower doses to complete lethargy or inability to stand up or move at high doses. Physical euphoria - The euphoria felt on\n\n\n                    Context: \n                    This excerpt details the physical effects associated with Temazepam, including sedation, lethargy, dizziness, muscle relaxation, respiratory depression, and feelings of heaviness, emphasizing the drug's potent depressant properties and dosage-dependent impairments. It is a crucial section within the broader description of Temazepam’s pharmacological profile and physical side effects, providing specific insights into its sedative and motor-impacting effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_4", "document_index": 302, "latency_s": 0.6291234000091208, "prompt_toks": 1760, "completion_toks": 72}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    body. This effect can range from motor impairment and difficulty moving at lower doses to complete lethargy or inability to stand up or move at high doses. Physical euphoria - The euphoria felt on temazepam is significantly stronger than that felt on other benzodiazepines such as alprazolam .\n\n\n                    Context: \n                    This excerpt describes the physical effects of temazepam, highlighting sedation, motor impairment, and feelings of heaviness, along with the notably strong physical euphoria compared to other benzodiazepines like alprazolam. It is part of the section detailing physical effects, emphasizing dose-dependent impairments and euphoric sensations associated with the drug.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_5", "document_index": 302, "latency_s": 0.8974155000032624, "prompt_toks": 1884, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation -  In terms of energy level alterations, this drug has the potential to be extremely sedating and often results in an overwhelmingly lethargic state. At higher levels, this causes users to suddenly feel as if they are extremely sleep deprived and have not slept for days, forcing them to sit down and generally feel as if they are constantly on the verge of passing out instead of engaging in physical activities. This sense of sleep deprivation increases proportional to dosage and eventually becomes powerful enough to force a person into complete unconsciousness.\n- Dizziness\n- Muscle relaxation\n- Motor control loss\n- Respiratory depression\n- Seizure suppression\n- Decreased heart rate\n- Perception of bodily heaviness -  Temazepam is known to cause feelings of heaviness in the body. This effect can range from motor impairment and difficulty moving at lower doses to complete lethargy or inability to stand up or move at high doses.\n\n\n                    Context: \n                    This excerpt details temazepam’s physical effects, including profound sedation, lethargy, muscle relaxation, and sensations of heaviness, which are key to understanding its depressant properties. These effects highlight the drug’s potency and potential risks at higher doses, making them crucial for assessing its profile within the full pharmacological and toxicity overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_6", "document_index": 302, "latency_s": 0.9678073000104632, "prompt_toks": 1796, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Physical euphoria - The euphoria felt on temazepam is significantly stronger than that felt on other benzodiazepines such as alprazolam .\nCognitive effects: - The cognitive effects of temazepam can be broken down into several components which progressively intensify proportional to dosage. The general head space of temazepam is described by many as one of intense sedation, relaxation, anxiety suppression and decreased inhibition. It contains a large number of typical depressant cognitive effects.\n\n\n                    Context: \n                    This section details the cognitive and physical effects of temazepam, emphasizing its sedative, euphoric, and cognitively impairing properties. It highlights that users may experience strong euphoria and a range of cognitive suppressions, which become more pronounced with higher doses—key aspects for understanding temazepam's psychoactive profile within the full documentation.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_7", "document_index": 302, "latency_s": 0.6742495000071358, "prompt_toks": 1887, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    The most prominent of these cognitive effects generally include: Amnesia Cognitive euphoria - The euphoria felt on temazepam is significantly stronger than that felt on other benzodiazepines such as alprazolam . Anxiety suppression Thought deceleration Analysis suppression Disinhibition Compulsive redosing Emotion suppression - Although this compound primarily suppresses anxiety, it also dulls other emotions in a manner which is distinct but less intensive than that of antipsychotics . Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at heavy dosages. Memory suppression - Temazepam primarily suppresses short-term memory, resulting in forgetfulness, and/or disorganized behaviors. Confusion - At heavy doses, temazepam can cause confusion. This effect is a result of the drug suppressing basic cognitive\n\n\n                    Context: \n                    This excerpt outlines the primary cognitive effects of temazepam, including amnesia, euphoria, anxiety suppression, delusions of sobriety, memory impairment, and confusion. It is a detailed summary within the broader discussion of temazepam's physical and psychological effects, highlighting its impact on mental functions at varying doses. These effects are crucial for understanding the drug’s psychoactive profile and risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_8", "document_index": 302, "latency_s": 0.7601512999972329, "prompt_toks": 1821, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    memory, resulting in forgetfulness, and/or disorganized behaviors. Confusion - At heavy doses, temazepam can cause confusion. This effect is a result of the drug suppressing basic cognitive functions at heavy doses, such as comprehension, memory, and reasoning skills. Motivation suppression - Due to temazepam's heavy sedation and lethargy, doing any type of activity that requires moving, or high amounts of effort may be difficult to do on this compound, especially at higher doses. Language suppression - Temazepam is known to cause slurred speech and difficulty communicating words in a clear fashion. Dream potentiation\n\n\n                    Context: \n                    This chunk summarizes the cognitive and perceptual effects of temazepam at higher doses, including memory suppression, confusion, motivation suppression, language impairment, and dream potentiation. It highlights how heavy use can impair judgment and cause disorganized behaviors, fitting into the broader section on physical and cognitive effects of the substance.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_9", "document_index": 302, "latency_s": 1.1119030999980168, "prompt_toks": 1867, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Amnesia\n- Cognitive euphoria - The euphoria felt on temazepam is significantly stronger than that felt on other benzodiazepines such as alprazolam .\n- Anxiety suppression\n- Thought deceleration\n- Analysis suppression\n- Disinhibition\n- Compulsive redosing\n- Emotion suppression - Although this compound primarily suppresses anxiety, it also dulls other emotions in a manner which is distinct but less intensive than that of antipsychotics .\n- Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at heavy dosages.\n- Memory suppression - Temazepam primarily suppresses short-term memory, resulting in forgetfulness, and/or disorganized behaviors.\n\n\n                    Context: \n                    This excerpt summarizes key cognitive and memory effects associated with temazepam, including amnesia, euphoric sensations, emotional and anxiety suppression, and di­s­sin­hibitory phenomena such as delusions of sobriety. It highlights the drug's impact on mental functions and common psychological side effects, providing essential details relevant to its psychoactive profile and safety considerations discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_10", "document_index": 302, "latency_s": 1.0297960000025341, "prompt_toks": 1895, "completion_toks": 51}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Memory suppression - Temazepam primarily suppresses short-term memory, resulting in forgetfulness, and/or disorganized behaviors.\n- Confusion - At heavy doses, temazepam can cause confusion. This effect is a result of the drug suppressing basic cognitive functions at heavy doses, such as comprehension, memory, and reasoning skills.\n- Motivation suppression - Due to temazepam's heavy sedation and lethargy, doing any type of activity that requires moving, or high amounts of effort may be difficult to do on this compound, especially at higher doses.\n- Language suppression - Temazepam is known to cause slurred speech and difficulty communicating words in a clear fashion.\n- Dream potentiation\nHistory and culture: \nLiterature: \nVisual effects: \nAuditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues:\n\n\n                    Context: \n                    This chunk details the cognitive and perceptual effects of temazepam, including memory suppression, confusion at high doses, motivation and speech impairment, and dream potentiation, aligning with its overall sedative and cognitive depressant profile discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 73, "doc_id": "doc_302", "num_chunks": 12, "chunk_id": "302::chunk_11", "document_index": 302, "latency_s": 0.9111197000020184, "prompt_toks": 1850, "completion_toks": 69}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Auditory effects: \nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: - Paradoxical reactions  to benzodiazepines such as increased seizures (in epileptics), aggression, increased anxiety, violent behavior, loss of impulse control, irritability and suicidal behavior sometimes occur (although they are rare in the general population, with an incidence rate below 1%). [11] [12] These paradoxical effects occur with greater frequency in recreational abusers, individuals with mental disorders, children, and patients on high-dosage regimes. [13] [14]\nOther:\n\n\n                    Context: \n                    This chunk lists additional effects and considerations related to Temazepam, including sensory, psychological, and legal aspects, with a detailed note on paradoxical reactions such as increased seizures, aggression, and behavioral issues. It complements the comprehensive overview of Temazepam's physical and cognitive effects, providing important safety and legal information relevant to users and clinicians.\n                "}
