{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_0", "document_index": 304, "latency_s": 0.5061524000047939, "prompt_toks": 3738, "completion_toks": 35}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Zolpidem\npsychonaut_name: Zolpidem\npsychonaut_url: https://psychonautwiki.org/wiki/Zolpidem\n\n\n                    Context: \n                    This chunk provides the basic identification details for Zolpidem, including its name and psychonaut reference link, serving as an introduction or metadata summary within the comprehensive drug profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_1", "document_index": 304, "latency_s": 0.5879515999986324, "prompt_toks": 3995, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Zolpidem | Chemical Nomenclature | Common names | Ambien, Intermezzo, Edluar, Zolpimist | Substitutive name | Zolpidem | Systematic name | N,N-dimethyl-2-(6-methyl-2-p-tolylimidazo[1,2-a]pyridin-3-yl)acetamide | Class Membership | Psychoactive class | Depressant | / | Hallucinogen | Chemical class | Imidazopyridine | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Threshold | 5 mg | Light | 10 - 20 mg | Common | 20 - 30 mg | Strong | 30 - 50 mg | Heavy | 50 mg + | Duration | Total | 5 - 10 hours | Onset | 15 - 45 minutes | Come up | 30 - 45 minutes | Peak | 3 - 6 hours | Offset | 4 - 5 hours | After effects | 2 - 4 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other\n\n\n                    Context: \n                    This chunk contains the infobox summary of zolpidem, including chemical nomenclature, common names, psychoactive classifications, routes of administration, dosage guidelines, and pharmacokinetic details. It provides essential reference information to enhance searchability and quick identification within the full webpage on zolpidem.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_2", "document_index": 304, "latency_s": 0.8450004999904195, "prompt_toks": 3756, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    | 2 - 4 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\n\n\n                    Context: \n                    This chunk provides information about the duration of zolpidem's effects (2-4 hours) and emphasizes that dosage data is user-generated and for educational purposes only, highlighting the importance of verifying with additional sources. It is relevant to the full document's section on dosage, effects, and responsible use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_3", "document_index": 304, "latency_s": 0.8388539000006858, "prompt_toks": 3796, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences: \nPhysical effects: - The physical effects of zolpidem are almost identical to that of benzodiazepines such as alprazolam , although with less intensive muscle relaxation . They can be broken down into several components.\n\n\n                    Context: \n                    This chunk provides an overview of the physical effects of zolpidem, noting its similarity to benzodiazepines like alprazolam, with less muscle relaxation. It is part of a detailed section on zolpidem’s subjective and physical effects, relevant for understanding its psychoactive profile, toxicity, and safety considerations within the comprehensive psychonaut wiki entry.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_4", "document_index": 304, "latency_s": 0.6871497999964049, "prompt_toks": 3918, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    These are described below and generally include: Sedation - The sedation present within this compound is significantly stronger than that of other GABAergic depressant when proportionally compared to their other effects. This is why zolpidem is commonly prescribed as a sleep aid to those who struggle with insomnia. Physical euphoria - This manifests itself as a warm, soft glow which emanates from the center of the user's body. Appetite enhancement - Many users of zolpidem report binge eating bizarre mixtures of various foods while they are \"asleep\" with little or no memory of the activity upon waking up. [8] This likely occurs as a result of zolpidem's cognitive effects such as disinhibition and amnesia . Changes in felt gravity - This is not as strong or apparent as it is with dissociatives or salvia . Gustatory hallucination Dizziness Nausea - At moderate to heavy dosages, a slight discomfort may be felt in the stomach. This will go away once the user has vomited. Muscle relaxation\n\n\n                    Context: \n                    This excerpt summarizes the physical and psychoactive effects of zolpidem, highlighting sedation, euphoria, appetite stimulation, and sensory alterations such as hallucinations and dizziness. It emphasizes the drug’s strong sedative properties and its potential for cognitive effects like amnesia and disinhibition. This section is relevant for understanding zolpidem's physical effects and their impact at various dosages within the full profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_5", "document_index": 304, "latency_s": 1.1789275999908568, "prompt_toks": 3826, "completion_toks": 88}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    or salvia . Gustatory hallucination Dizziness Nausea - At moderate to heavy dosages, a slight discomfort may be felt in the stomach. This will go away once the user has vomited. Muscle relaxation - Although muscle relaxation is definitely present, it usually only manifests itself at heavier dosages and is significantly weaker than that of benzodiazepines. Motor control loss Respiratory depression Increased heart rate - Zolpidem can increase heart rate. [ citation needed ] Increased blood pressure - Zolpidem can increase blood pressure. [ citation needed ] Tactile hallucination\n\n\n                    Context: \n                    This excerpt details the physical effects of zolpidem at moderate to high doses, including sensory hallucinations, muscle relaxation, and cardiovascular impacts. It provides specific information about side effects such as nausea, dizziness, and tactile hallucinations, emphasizing dose-dependent muscle relaxation and increases in heart rate and blood pressure. These effects are key for understanding zolpidem's safety profile and are central to the comprehensive effects described in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_6", "document_index": 304, "latency_s": 0.5191220999986399, "prompt_toks": 3916, "completion_toks": 53}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - The sedation present within this compound is significantly stronger than that of other GABAergic depressant when proportionally compared to their other effects. This is why zolpidem is commonly prescribed as a sleep aid to those who struggle with insomnia.\n- Physical euphoria - This manifests itself as a warm, soft glow which emanates from the center of the user's body.\n- Appetite enhancement - Many users of zolpidem report binge eating bizarre mixtures of various foods while they are \"asleep\" with little or no memory of the activity upon waking up. [8] This likely occurs as a result of zolpidem's cognitive effects such as disinhibition and amnesia .\n- Changes in felt gravity - This is not as strong or apparent as it is with dissociatives or salvia .\n- Gustatory hallucination\n- Dizziness\n- Nausea - At moderate to heavy dosages, a slight discomfort may be felt in the stomach. This will go away once the user has vomited.\n\n\n                    Context: \n                    This excerpt summarizes the physical effects of zolpidem, including sedation potency, euphoria, appetite increase, altered gravity perception, hallucinations, dizziness, and nausea, providing key details relevant to its overall pharmacological profile and effects documented on the webpage.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_7", "document_index": 304, "latency_s": 0.9080411000031745, "prompt_toks": 3906, "completion_toks": 62}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Gustatory hallucination\n- Dizziness\n- Nausea - At moderate to heavy dosages, a slight discomfort may be felt in the stomach. This will go away once the user has vomited.\n- Muscle relaxation - Although muscle relaxation is definitely present, it usually only manifests itself at heavier dosages and is significantly weaker than that of benzodiazepines.\n- Motor control loss\n- Respiratory depression\n- Increased heart rate - Zolpidem can increase heart rate. [ citation needed ]\n- Increased blood pressure - Zolpidem can increase blood pressure. [ citation needed ]\n- Tactile hallucination\nCognitive effects: - The cognitive effects of zolpidem are comparable to that of benzodiazepines although with less intensive anxiety suppression . At heavier more recreational dosages, additional effects which are usually associated with deliriants may become present. These include thought disorganization and delusions . The specific effects can be broken down into several components.\n\n\n                    Context: \n                    This excerpt summarizes the physical and cognitive effects of zolpidem, including hallucinations, physiological responses like nausea and increased heart rate, and mental states such as disorganization and delusions. It is part of the detailed description of zolpidem's subjective effects and toxicity profile within the full wiki page.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_8", "document_index": 304, "latency_s": 1.0604878000012832, "prompt_toks": 3896, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    These are described below and generally include: Amnesia - The amnesia following zolpidem varies greatly between people with some people not experiencing this effect as much while others experience complete blackouts for extended periods of time even at low or therapeutic dosages. There have been many cases of bizarre behavior where people can't recall the entire event. Anxiety suppression - Although anxiety suppression is definitely present, it usually only manifests itself at heavier dosages and is significantly weaker than that of benzodiazepines. Compulsive redosing Cognitive euphoria Psychosis Delusion [9] [10] - At heavier dosages, this effect may become present in a manner which is comparable to traditional deliriants. It is often accompanied by external hallucinations which tend to reinforce one's belief of the delusion. Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and\n\n\n                    Context: \n                    This excerpt provides a detailed overview of the subjective cognitive and perceptual effects of zolpidem, including amnesia, delusions, psychosis, and related phenomena, highlighting variations in individual responses and heavy-dosage effects. It is relevant for understanding zolpidem’s mind-altering potential and risks within the broader discussion of its pharmacology and psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_9", "document_index": 304, "latency_s": 0.7161773000116227, "prompt_toks": 3901, "completion_toks": 82}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    reinforce one's belief of the delusion. Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at heavy dosages. Experience reports indicate that zolpidem may provoke these delusions in equal or greater strength than benzodiazepines. Disinhibition Dream potentiation Emotion enhancement - Some users report increased emotions and empathy with zolpidem, especially happiness and sadness. Empathy, affection, and sociability enhancement - This effect is far not as strong as with entactogens like MDMA and 2C-B but is delirious in nature. Laughter Mania Déjà vu - Spontaneous memory replays integrate into the thought patterns and produce a strong sense of déjà vu. Confusion Increased music appreciation Increased libido Suggestibility enhancement Analysis suppression Emotion suppression Language suppression - At heavier\n\n\n                    Context: \n                    This excerpt details zolpidem's subjective psychological effects at higher dosages, including delusions of sobriety, disinhibition, dream potentiation, emotional and sociability enhancements, déjà vu, and cognitive impairments such as confusion, language, and memory suppression. It is relevant for understanding the drug’s mind-altering and dissociative-like effects, which are crucial for harm assessment and responsible use considerations.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_10", "document_index": 304, "latency_s": 0.9361206999892602, "prompt_toks": 3894, "completion_toks": 87}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    and produce a strong sense of déjà vu. Confusion Increased music appreciation Increased libido Suggestibility enhancement Analysis suppression Emotion suppression Language suppression - At heavier dosages of zolpidem, one may find that they have a distinct difficulty vocalizing their thoughts in a coherent manner. Short-term memory suppression - At heavier dosages, many users find that they cannot recall things from 10 or 30 seconds ago due to suppression of their short-term memory. This can potentially lead to confusion, repetitive behaviour and thought loops . Sleepiness Thought deceleration Thought disorganization - This effect is present at heavier dosages and tends to synergise with disinihibition and delusions in a manner which results in bizarre decision-making processes or thought processes which are often out of character and make little to no sense once the user has sobered up from the experience. Time distortion - Similar to benzodiazepines , time may feel like it passes\n\n\n                    Context: \n                    This excerpt summarizes the subjective cognitive and perceptual effects of zolpidem at higher doses, including phenomena like déjà vu, increased music appreciation, libido, suggestibility, and various suppressions (analysis, emotion, language, short-term memory). It highlights how heavy dosages can lead to disorganization, confusion, and altered perception of time, providing detailed insights into zolpidem's psychoactive profile within the overall drug documentation.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_11", "document_index": 304, "latency_s": 0.8911070999893127, "prompt_toks": 3751, "completion_toks": 70}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    processes which are often out of character and make little to no sense once the user has sobered up from the experience. Time distortion - Similar to benzodiazepines , time may feel like it passes quicker than usual.\n\n\n                    Context: \n                    This excerpt discusses the cognitive effects of zolpidem, including disorganized thinking and delusions, as well as its impact on perception. It highlights how these effects, such as time distortion, resemble those of benzodiazepines and occur at higher dosages, making it relevant for understanding zolpidem’s subjective experiences and potential risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_12", "document_index": 304, "latency_s": 0.6022099000110757, "prompt_toks": 3867, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Amnesia - The amnesia following zolpidem varies greatly between people with some people not experiencing this effect as much while others experience complete blackouts for extended periods of time even at low or therapeutic dosages. There have been many cases of bizarre behavior where people can't recall the entire event.\n- Anxiety suppression - Although anxiety suppression is definitely present, it usually only manifests itself at heavier dosages and is significantly weaker than that of benzodiazepines.\n- Compulsive redosing\n- Cognitive euphoria\n- Psychosis\n- Delusion [9] [10] - At heavier dosages, this effect may become present in a manner which is comparable to traditional deliriants. It is often accompanied by external hallucinations which tend to reinforce one's belief of the delusion.\n\n\n                    Context: \n                    This excerpt summarizes key subjective and cognitive effects of zolpidem, including amnesia variability, anxiolytic effects at higher doses, and phenomena such as compulsive redosing, euphoria, psychosis, and delusions, providing detailed insights into its psychological and behavioral impact within the comprehensive effects profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_13", "document_index": 304, "latency_s": 0.9001511000096798, "prompt_toks": 3910, "completion_toks": 64}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Delusions of sobriety - This is the false belief that one is perfectly sober despite obvious evidence to the contrary such as severe cognitive impairment and an inability to fully communicate with others. It most commonly occurs at heavy dosages. Experience reports indicate that zolpidem may provoke these delusions in equal or greater strength than benzodiazepines.\n- Disinhibition\n- Dream potentiation\n- Emotion enhancement - Some users report increased emotions and empathy with zolpidem, especially happiness and sadness.\n- Empathy, affection, and sociability enhancement - This effect is far not as strong as with entactogens like MDMA and 2C-B but is delirious in nature.\n- Laughter\n- Mania\n- Déjà vu - Spontaneous memory replays integrate into the thought patterns and produce a strong sense of déjà vu.\n- Confusion\n- Increased music appreciation\n- Increased libido\n- Suggestibility enhancement\n- Analysis suppression\n- Emotion suppression\n\n\n                    Context: \n                    This chunk details the cognitive and psychological effects of zolpidem, including delusions of sobriety, disinhibition, emotion and empathy enhancement, déjà vu, confusion, increased libido, and suppressions of analysis and emotion, providing insight into its subjective and deliriant-like properties as described in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_14", "document_index": 304, "latency_s": 0.859548199994606, "prompt_toks": 3886, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Confusion\n- Increased music appreciation\n- Increased libido\n- Suggestibility enhancement\n- Analysis suppression\n- Emotion suppression\n- Language suppression - At heavier dosages of zolpidem, one may find that they have a distinct difficulty vocalizing their thoughts in a coherent manner.\n- Short-term memory suppression - At heavier dosages, many users find that they cannot recall things from 10 or 30 seconds ago due to suppression of their short-term memory. This can potentially lead to confusion, repetitive behaviour and thought loops .\n- Sleepiness\n- Thought deceleration\n- Thought disorganization - This effect is present at heavier dosages and tends to synergise with disinihibition and delusions in a manner which results in bizarre decision-making processes or thought processes which are often out of character and make little to no sense once the user has sobered up from the experience.\n\n\n                    Context: \n                    This chunk summarizes the cognitive and subjective effects of zolpidem at higher dosages, including confusion, memory suppression, thought disorganization, and emotional suppression. It is relevant to understanding the drug's impact on mental state and hallucinogenic potential, complementing the detailed effects outlined elsewhere in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_15", "document_index": 304, "latency_s": 0.9170371000072919, "prompt_toks": 3736, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Time distortion - Similar to benzodiazepines , time may feel like it passes quicker than usual.\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This chunk discusses the perceptual effect of time distortion associated with zolpidem, noting its similarity to benzodiazepines in causing time to feel like it passes more quickly. It is situated within the broader section on subjective effects, alongside historical and cultural references, providing context for zolpidem's psychological impact. This information is relevant for understanding its cognitive and perceptual influence during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_16", "document_index": 304, "latency_s": 0.8354916999960551, "prompt_toks": 3891, "completion_toks": 95}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Visual effects: - The visual effects of zolpidem are comparable to that of certain aspects deliriants , dissociatives and psychedelics . At lower dosages, these effects manifest as simple visual suppressions but at higher doses, they may escalate into full-blown complex hallucinatory states of a bizarre and unique nature. Acuity suppression Visual snow After images - These may spontaneously develop in peripheral vision. Depth perception distortions Double vision - Double vision produced by zolpidem may apply to the whole field of view or alternatively on single or multiple objects only, sometimes alongside transformations . Magnification Object activation Object alteration Peripheral information misinterpretation Transformations Acuity suppression Drifting - At heavier dosages, this compound may induce the experience of scenery, walls, objects and people appearing to melt and distort in a manner which is comparable to traditional psychedelics such as psilocin or LSD . Geometry - The\n\n\n                    Context: \n                    This excerpt details the visual effects of zolpidem, comparing them to deliriants, dissociatives, and psychedelics. It explains how visual phenomena such as acuity suppression, visual snow, afterimages, double vision, and geometric patterns vary with dosage, including hallucinations, distortions, and melting or shifting perceptions at higher doses. This section is relevant for understanding zolpidem's potent hallucinogenic visual effects described within the broader pharmacological profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_17", "document_index": 304, "latency_s": 0.9432491999905324, "prompt_toks": 3886, "completion_toks": 80}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    may induce the experience of scenery, walls, objects and people appearing to melt and distort in a manner which is comparable to traditional psychedelics such as psilocin or LSD . Geometry - The geometry produced by zolpidem shares similarities with DXM and generally shifts between jitteriness and static. Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) -  The internal hallucinations present on this compound can be described as vivid dream-like states similar in style to that of deliriants . This effect typically occurs briefly and spontaneously at moderate dosages but becomes progressively extended in its occurrence and duration proportional to dosage consumed before eventually becoming all-encompassing. It can be comprehensively described through its variations as delirious in believability, interactive in style, equal in new experiences and memory replays in content, autonomous in\n\n\n                    Context: \n                    This excerpt describes the visual and hallucination effects of zolpidem at higher doses, comparing its distortion and geometric visuals to substances like psilocin, LSD, and DXM. It details phenomena such as scenery melting, intricate internal hallucinations, and their progression with dosage, highlighting zolpidem's deliriant-like visual effects within the broader discussion of its subjective and perceptual effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_18", "document_index": 304, "latency_s": 0.7483984999998938, "prompt_toks": 3882, "completion_toks": 79}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    all-encompassing. It can be comprehensively described through its variations as delirious in believability, interactive in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style. External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - In comparison to other classes of hallucinogen , this effect exclusively occurs at heavy dosages and is comparable to deliriants such as DPH and datura . This effect can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. The most common themes for these hallucinations include those of both everyday occurrences such as talking to people who are not there and impossible occurrences such as inanimate objects coming to life or shadow people . Shadow people\n\n\n                    Context: \n                    This excerpt describes heavy dosage hallucinatory effects of zolpidem, specifically external autonomous hallucinations resembling deliriants like DPH and datura, including themes such as talking to non-existent people and shadow people. It is relevant to the document’s detailed section on visual and hallucinogenic effects of zolpidem, highlighting its complex and delirious hallucinations at high doses.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_19", "document_index": 304, "latency_s": 1.2365603999933228, "prompt_toks": 3868, "completion_toks": 94}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Acuity suppression Visual snow\n- Visual snow\n- After images - These may spontaneously develop in peripheral vision.\n- Depth perception distortions\n- Double vision - Double vision produced by zolpidem may apply to the whole field of view or alternatively on single or multiple objects only, sometimes alongside transformations .\n- Magnification\n- Object activation\n- Object alteration\n- Peripheral information misinterpretation\n- Transformations\n- Acuity suppression\n- Drifting - At heavier dosages, this compound may induce the experience of scenery, walls, objects and people appearing to melt and distort in a manner which is comparable to traditional psychedelics such as psilocin or LSD .\n- Geometry - The geometry produced by zolpidem shares similarities with DXM and generally shifts between jitteriness and static.\n\n\n                    Context: \n                    This section details the visual effects associated with zolpidem, including visual disturbances, hallucinations, and distortions that occur at various dosages. It highlights phenomena such as visual snow, afterimages, depth perception distortions, double vision, and geometric patterns, emphasizing their similarity to those caused by deliriants and psychedelics. These visual effects are crucial for understanding zolpidem's perceptual impact within the broader discussion of its subjective and sensory effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_20", "document_index": 304, "latency_s": 0.778064700003597, "prompt_toks": 3859, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Geometry - The geometry produced by zolpidem shares similarities with DXM and generally shifts between jitteriness and static.\n- Internal hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) -  The internal hallucinations present on this compound can be described as vivid dream-like states similar in style to that of deliriants . This effect typically occurs briefly and spontaneously at moderate dosages but becomes progressively extended in its occurrence and duration proportional to dosage consumed before eventually becoming all-encompassing. It can be comprehensively described through its variations as delirious in believability, interactive in style, equal in new experiences and memory replays in content, autonomous in controllability and solid in style.\n\n\n                    Context: \n                    This excerpt details zolpidem's visual hallucination effects, including complex hallucinations and geometric distortions, as well as its characteristic internal hallucinations resembling vivid dream states that can become prolonged with higher doses. These descriptions are part of the comprehensive section on zolpidem's visual and perceptual effects within the full drug profile, highlighting its deliriant-like hallucinations and neural impact at recreational dosages.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_21", "document_index": 304, "latency_s": 0.8307495000044582, "prompt_toks": 3889, "completion_toks": 61}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - External hallucination ( autonomous entities ; settings, sceneries, and landscapes ; perspective hallucinations and scenarios and plots ) - In comparison to other classes of hallucinogen , this effect exclusively occurs at heavy dosages and is comparable to deliriants such as DPH and datura . This effect can be comprehensively described through its variations as delirious in believability, autonomous in controllability and solid in style. The most common themes for these hallucinations include those of both everyday occurrences such as talking to people who are not there and impossible occurrences such as inanimate objects coming to life or shadow people .\n- Shadow people\nAuditory effects: - Auditory hallucination - At heavier dosages, one may experience the perception of imagined sounds such as voices or music, sometimes incorporated into ambient sounds or music. These are often accompanied by external hallucinations and delusions . Auditory enhancement\n\n\n                    Context: \n                    This chunk details zolpidem's heavy-dose visual and auditory hallucinations, including external autonomous entity hallucinations akin to deliriants, themes like talking to non-existent people and shadow figures, and associated auditory effects such as perceived voices and music, emphasizing its deliriant-like hallucination profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_22", "document_index": 304, "latency_s": 0.7794463000027463, "prompt_toks": 3767, "completion_toks": 90}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Auditory hallucination - At heavier dosages, one may experience the perception of imagined sounds such as voices or music, sometimes incorporated into ambient sounds or music. These are often accompanied by external hallucinations and delusions .\n- Auditory enhancement\nMulti-sensory effects: \nTranspersonal effects:\n\n\n                    Context: \n                    This excerpt discusses the auditory hallucination effects associated with higher doses of Zolpidem, noting the perception of imagined sounds such as voices or music, often combined with external hallucinations and delusions. It highlights the potential for sensory and transpersonal effects at recreational dosages, providing insight into the drug's complex psychoactive profile within the broader context of Zolpidem's physical, cognitive, and multisensory effects detailed in the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_23", "document_index": 304, "latency_s": 1.3293291000009049, "prompt_toks": 3913, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Disconnective effects: - Visual disconnection - This effect is only present at moderate to heavy recreational dosages and is comparable to that of a dissociatives such as DXM and ketamine . It commonly results in feeling as if one's sense of vision is distant or vague and being viewed through a screen or window. However, it is not capable of higher end visual disconnection such as holes, spaces and voids or hallucinatory structures in the same way that traditional dissociatives are. This is likely due to the way in which zolpidem's sedative effects render the user unconscious at dosages far lower than one could consume to reach such a state. Consciousness disconnection - This effect is only present at moderate to heavy recreational dosages and is comparable to that of dissociatives such as DXM and ketamine . However, it is not capable of higher end cognitive disconnection in the same way that dissociatives are. This is likely due to the way in which zolpidem's sedative effects render\n\n\n                    Context: \n                    This chunk details the dissociative and disconnective effects of zolpidem at moderate to heavy dosages, comparing them to dissociatives like DXM and ketamine. It explains subjective experiences such as visual disconnection and consciousness disconnection, clarifying their limitations due to zolpidem's sedative properties. These sections are crucial for understanding zolpidem's dissociative-like effects within the broader psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_24", "document_index": 304, "latency_s": 0.6549601999868173, "prompt_toks": 3769, "completion_toks": 75}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    DXM and ketamine . However, it is not capable of higher end cognitive disconnection in the same way that dissociatives are. This is likely due to the way in which zolpidem's sedative effects render the user unconscious at dosages far lower than one could consume to reach such a state.\n\n\n                    Context: \n                    This excerpt compares zolpidem's disconnection effects to dissociatives like DXM and ketamine, highlighting that zolpidem does not produce higher-level cognitive disconnection due to its sedative properties causing unconsciousness at lower doses. It emphasizes limitations in its dissociative-like effects within the broader discussion of physical, visual, and consciousness effects of zolpidem.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_25", "document_index": 304, "latency_s": 1.029027100012172, "prompt_toks": 3836, "completion_toks": 92}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Visual disconnection - This effect is only present at moderate to heavy recreational dosages and is comparable to that of a dissociatives such as DXM and ketamine . It commonly results in feeling as if one's sense of vision is distant or vague and being viewed through a screen or window. However, it is not capable of higher end visual disconnection such as holes, spaces and voids or hallucinatory structures in the same way that traditional dissociatives are. This is likely due to the way in which zolpidem's sedative effects render the user unconscious at dosages far lower than one could consume to reach such a state.\n\n\n                    Context: \n                    This chunk describes the visual disconnection effects of zolpidem at moderate to heavy doses, comparing them to dissociatives like DXM and ketamine. It details how these effects cause a sense of distant or vague vision without the higher-end hallucinations seen with dissociatives, likely due to zolpidem’s sedative properties causing unconsciousness at lower dosages. It is relevant for understanding zolpidem’s multi-sensory dissociative effects.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 75, "doc_id": "doc_304", "num_chunks": 27, "chunk_id": "304::chunk_26", "document_index": 304, "latency_s": 0.9407369999971706, "prompt_toks": 3829, "completion_toks": 89}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Consciousness disconnection - This effect is only present at moderate to heavy recreational dosages and is comparable to that of dissociatives such as DXM and ketamine . However, it is not capable of higher end cognitive disconnection in the same way that dissociatives are. This is likely due to the way in which zolpidem's sedative effects render the user unconscious at dosages far lower than one could consume to reach such a state.\nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk details zolpidem's dissociative effects related to consciousness disconnection, emphasizing that such effects occur only at moderate to heavy recreational doses and are limited compared to true dissociatives like DXM and ketamine, due to zolpidem's sedative-induced unconsciousness at lower dosages. It is part of the broader discussion on zolpidem's physical, cognitive, and disconnection effects in the full psychoactive profile.\n                "}
