{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_0", "document_index": 305, "latency_s": 0.9652971000032267, "prompt_toks": 1919, "completion_toks": 59}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    drug: Zopiclone\npsychonaut_name: Zopiclone\npsychonaut_url: https://psychonautwiki.org/wiki/Zopiclone\n\n\n                    Context: \n                    This chunk provides the basic identification details and link for Zopiclone on PsychonautWiki, serving as an introductory reference within the comprehensive document that covers its effects, chemistry, pharmacology, and legal status. It is essential for locating the main webpage and understanding the substance’s official categorization.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_1", "document_index": 305, "latency_s": 0.7512305999989621, "prompt_toks": 2190, "completion_toks": 52}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Infobox: Zopiclone | Chemical Nomenclature | Common names | Zimovane, Imovane | Substitutive name | Zopiclone | Systematic name | (RS)-6-(5-Chloropyridin-2-yl)-7-oxo-6,7-dihydro-5H-pyrrolo[3,4-b]pyrazin-5-yl 4-methylpiperazine-1-carboxylate | Class Membership | Psychoactive class | Depressant | / | Hallucinogen | Chemical class | Cyclopyrrolone | Routes of Administration | WARNING: | Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. | See responsible use section | . | ⇣ | Oral | Dosage | Bioavailability | 52 - 59% | [ | citation needed | ] | Threshold | 2 mg | Light | 3.5 - 5 mg | Common | 5 - 7.5 mg | Strong | 7.5 - 15 mg | Heavy | 15 mg + | Duration | Total | 3.5 - 9 hours | Onset | 10 - 30 minutes | Peak | 3 - 4 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources\n\n\n                    Context: \n                    This infobox provides essential chemical, pharmacological, and dosage information about Zopiclone, a depressant and cyclopyrrolone-class psychoactive substance, complementing the detailed effects and effects descriptions in the main document for comprehensive understanding and reference.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_2", "document_index": 305, "latency_s": 0.6121221999928821, "prompt_toks": 1936, "completion_toks": 60}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    3 - 4 hours | DISCLAIMER | : | PW's | dosage | information is gathered from users and | resources | for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. | Interactions\n\n\n                    Context: \n                    This chunk appears near the dosage and pharmacokinetic information section, providing details on zopiclone's duration of effects (3-4 hours) and including a standard disclaimer emphasizing that dosage recommendations are user-sourced for educational purposes only. It highlights the importance of verifying information and mentions potential interactions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_3", "document_index": 305, "latency_s": 1.312049100000877, "prompt_toks": 1929, "completion_toks": 66}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Summary: \nContents: \nChemistry: \nPharmacology: \nSubjective effects: \nToxicity and harm potential: \nLegal status: \nSee also: \nExternal links: \nReferences:\n\n\n                    Context: \n                    This chunk outlines the main sections of the comprehensive webpage on Zopiclone, including chemistry, pharmacology, effects, toxicity, legal status, and references. It provides an overview of key informational categories used to organize detailed data about the substance's properties, effects, and legal considerations, serving as a guide to its detailed profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_4", "document_index": 305, "latency_s": 0.871916300005978, "prompt_toks": 2081, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Physical effects: - Sedation - zopiclone is extremely sedating and can put the user into an overwhelmingly lethargic state. At higher levels, this causes users to suddenly feel as if they are extremely sleep deprived and have not slept for days, forcing them to sit or lay down and feel as if they are constantly on the verge of passing out. This sense of sleep deprivation increases proportional to dosage and can eventually become powerful enough to force a person into complete unconsciousness regardless of where they are or what they are doing at that moment. Respiratory depression Muscle relaxation Dizziness Motor control loss - This effect is pronounced and comparable to the motor control loss experienced on a heavy dose of alcohol. This typically results in users stumbling and an inability to walk in a straight line. As this may easily result in injury, one should avoid walking and using stairs while on zopiclone. Gustatory hallucination - Zopiclone is sometimes reported to leave a\n\n\n                    Context: \n                    This section details the physical effects of zopiclone, emphasizing its potent sedative properties and associated risks such as respiratory depression, muscle relaxation, dizziness, motor impairment, and metallic taste hallucinations. It is a crucial part of the comprehensive effects overview, aiding in understanding the substance's depressant action and potential hazards.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_5", "document_index": 305, "latency_s": 0.7297084000019822, "prompt_toks": 1938, "completion_toks": 68}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    to walk in a straight line. As this may easily result in injury, one should avoid walking and using stairs while on zopiclone. Gustatory hallucination - Zopiclone is sometimes reported to leave a metallic taste in one's mouth.\n\n\n                    Context: \n                    This chunk describes some of the physical effects of zopiclone, including motor control loss, which can cause unsteady walking and increase injury risk, as well as gustatory hallucinations, where users report a metallic taste in the mouth. These effects highlight the drug’s sedative and motor-impairing properties discussed throughout the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_6", "document_index": 305, "latency_s": 0.8491933000041172, "prompt_toks": 2069, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Sedation - zopiclone is extremely sedating and can put the user into an overwhelmingly lethargic state. At higher levels, this causes users to suddenly feel as if they are extremely sleep deprived and have not slept for days, forcing them to sit or lay down and feel as if they are constantly on the verge of passing out. This sense of sleep deprivation increases proportional to dosage and can eventually become powerful enough to force a person into complete unconsciousness regardless of where they are or what they are doing at that moment.\n- Respiratory depression\n- Muscle relaxation\n- Dizziness\n- Motor control loss - This effect is pronounced and comparable to the motor control loss experienced on a heavy dose of alcohol. This typically results in users stumbling and an inability to walk in a straight line. As this may easily result in injury, one should avoid walking and using stairs while on zopiclone.\n\n\n                    Context: \n                    This section details the physical effects of zopiclone, including sedation, respiratory depression, muscle relaxation, dizziness, and significant motor control loss, highlighting the risks of overdose and impaired coordination. It provides key information on the substance's sedative potency and potential for injury, making it relevant for understanding its physical toxicity profile within the full psychoactive effects overview.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_7", "document_index": 305, "latency_s": 0.6441930000000866, "prompt_toks": 1910, "completion_toks": 65}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Gustatory hallucination - Zopiclone is sometimes reported to leave a metallic taste in one's mouth.\n\n\n                    Context: \n                    This chunk describes a physical effect of zopiclone, specifically noting that it can cause a metallic taste in the mouth, classified as a gustatory hallucination. Its relevance lies in detailing the range of sensory distortions and side effects associated with the substance, providing users and researchers with specific information on common experiences during use.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_8", "document_index": 305, "latency_s": 0.7378150000004098, "prompt_toks": 2091, "completion_toks": 85}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    Cognitive effects: - The cognitive effects of zopiclone can be broken down into several components which progressively intensify proportional to dosage. The general head space of zopiclone is described by many as one of intense sedation, decreased inhibition and severe amnesia. It produces a large number of cognitive effects typical of most GABA-ergic depressants . Amnesia -  Compared to benzodiazepines , zopiclone can produce amnesia at much lower doses. One may potentially not remember exactly what happened while under the influence of a common dose. This is usually less intense than the amnesia produced by zolpidem . Anxiety suppression Thought deceleration Disinhibition Delusion Delirium Analysis suppression Euphoria -  Some users report euphoria from zopiclone, although this is short lived and usually exclusive to the onset of the experience and often followed by emotion suppression . Emotion suppression -  While zopiclone primarily suppresses anxiety , it also suppresses other\n\n\n                    Context: \n                    This excerpt details the cognitive effects of zopiclone, including sedation, amnesia, emotional suppression, and subjective states like euphoria and disinhibition. It elaborates on how these effects vary with dosage and compares amnesia severity to other sedatives like benzodiazepines and zolpidem. This section is essential for understanding zopiclone's impact on mental functions and its potential for cognitive impairment.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_9", "document_index": 305, "latency_s": 0.9052671000099508, "prompt_toks": 2004, "completion_toks": 76}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    lived and usually exclusive to the onset of the experience and often followed by emotion suppression . Emotion suppression -  While zopiclone primarily suppresses anxiety , it also suppresses other emotions in a similar but less intense fashion to antipsychotics . Time compression - This effect is mostly noticeable while under the influence of a high dose. Irritability - Combined with the strong disinhibiting effects of zopiclone, this effect can cause people under the influence of zopiclone to have violent behavior towards others and sometimes themselves. Increased music appreciation Compulsive redosing\n\n\n                    Context: \n                    This excerpt summarizes several subjective cognitive and emotional effects of zopiclone, including emotion suppression, high-dose time compression, irritability, increased music appreciation, and compulsive redosing tendencies. It is relevant for understanding the drug’s psychoactive profile, particularly its impact on mood, perception, and behavioral disinhibition, as detailed in the subjective effects section of the full document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_10", "document_index": 305, "latency_s": 0.6430113000096753, "prompt_toks": 2065, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Amnesia -  Compared to benzodiazepines , zopiclone can produce amnesia at much lower doses. One may potentially not remember exactly what happened while under the influence of a common dose. This is usually less intense than the amnesia produced by zolpidem .\n- Anxiety suppression\n- Thought deceleration\n- Disinhibition\n- Delusion\n- Delirium\n- Analysis suppression\n- Euphoria -  Some users report euphoria from zopiclone, although this is short lived and usually exclusive to the onset of the experience and often followed by emotion suppression .\n- Emotion suppression -  While zopiclone primarily suppresses anxiety , it also suppresses other emotions in a similar but less intense fashion to antipsychotics .\n- Time compression - This effect is mostly noticeable while under the influence of a high dose.\n\n\n                    Context: \n                    This excerpt summarizes the cognitive and subjective effects of zopiclone, including amnesia at low doses, emotional and thought suppression, euphoria, and time compression at high doses. It fits within the broader discussion of zopiclone's pharmacological profile, highlighting its impact on mental states and perception, which are important for understanding its psychoactive properties and potential risks.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_11", "document_index": 305, "latency_s": 0.9307357000070624, "prompt_toks": 1966, "completion_toks": 71}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Time compression - This effect is mostly noticeable while under the influence of a high dose.\n- Irritability - Combined with the strong disinhibiting effects of zopiclone, this effect can cause people under the influence of zopiclone to have violent behavior towards others and sometimes themselves.\n- Increased music appreciation\n- Compulsive redosing\nHistory and culture: \nLiterature:\n\n\n                    Context: \n                    This section details subjective effects of zopiclone, focusing on behavioral and perceptual changes at high doses, such as time compression, irritability, enhanced music appreciation, and tendencies for redosing. These effects are relevant for understanding the drug's psychoactive profile and potential risks, situating them within broader cognitive and emotional impacts discussed earlier in the document.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_12", "document_index": 305, "latency_s": 1.057801399991149, "prompt_toks": 2090, "completion_toks": 83}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Increased music appreciation\n- Compulsive redosing\nHistory and culture: \nLiterature: \nVisual effects: - Shadow people Acuity suppression Drifting ( melting , breathing , morphing and flowing ) - Visual drifting effects are the most prominent visual effects of this substance. They typically occur at strong doses, or when the user resists the urge to sleep.. They are similar to the distortions produced zolpidem and are usually less pronounced than those of deliriants . Like deliriant visuals, they are most prominent in low lighting. Depending on dose and lighting, they can be described as slow or fast in speed, static in permanence, smooth in motion, realistic in appearance, and simplistic or intricate. External hallucinations - At very high doses, zopiclone can produce external hallucinations that are similar to, but less pronounced than those of deliriants . Tracers - This effect is mild and typically only experienced at high doses.\n- Shadow people\n- Acuity suppression\n\n\n                    Context: \n                    This section details the visual effects associated with zopiclone use, including phenomena such as shadow people, acuity suppression, drifting visual effects, external hallucinations, and tracers, primarily at high doses or during sleep resistance. It provides descriptions of these hallucinations and distortions, emphasizing their appearance, duration, and lighting conditions, and highlights their occurrence as prominent visual phenomena linked to the drug's psychedelic profile.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_13", "document_index": 305, "latency_s": 0.9020201999956043, "prompt_toks": 2064, "completion_toks": 73}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Shadow people\n- Acuity suppression\n- Drifting ( melting , breathing , morphing and flowing ) - Visual drifting effects are the most prominent visual effects of this substance. They typically occur at strong doses, or when the user resists the urge to sleep.. They are similar to the distortions produced zolpidem and are usually less pronounced than those of deliriants . Like deliriant visuals, they are most prominent in low lighting. Depending on dose and lighting, they can be described as slow or fast in speed, static in permanence, smooth in motion, realistic in appearance, and simplistic or intricate.\n- External hallucinations - At very high doses, zopiclone can produce external hallucinations that are similar to, but less pronounced than those of deliriants .\n- Tracers - This effect is mild and typically only experienced at high doses.\n\n\n                    Context: \n                    This section details the visual and perceptual effects of zopiclone, including hallucinations such as shadow people, acuity suppression, drifting visuals, external hallucinations at high doses, and tracers. These effects are prominent at strong doses and resemble deliriant and zolpidem visuals, providing important information on the substance's psychedelic-like sensory distortions.\n                "}
{"metadata": {"source": "psychonaut_CSV", "row": 76, "doc_id": "doc_305", "num_chunks": 15, "chunk_id": "305::chunk_14", "document_index": 305, "latency_s": 0.7874306000012439, "prompt_toks": 2020, "completion_toks": 74}, "content": "Drug: Unknown | cid: N/A\nSource: psychonaut_CSV | Source description: ?\n\n                    Text: \n                    - Tracers - This effect is mild and typically only experienced at high doses.\nAuditory effects: - Auditory hallucinations - The auditory hallucinations of Zopiclone are mostly voices, and appear at higher doses. Sleep deprivation magnifies this effect.\n- Auditory hallucinations - The auditory hallucinations of Zopiclone are mostly voices, and appear at higher doses. Sleep deprivation magnifies this effect.\nMulti-sensory effects: \nTranspersonal effects: \nDisconnective effects: \nAfter effects: \nReagent results: \nPreparation methods: \nResearch: \nExamples: \nLegal issues: \nParadoxical effects: \nOther:\n\n\n                    Context: \n                    This chunk covers the visual and auditory effects of zopiclone, including visual drifting, hallucinations, and voices, primarily at high doses and under sleep deprivation. It supports the broader sections on subjective effects and hallucinations, providing specific details on sensory distortions and their intensity. These effects are important for understanding zopiclone’s psychoactive profile and potential risks.\n                "}
