{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_0", "document_index": 98, "latency_s": 0.9147739000036381, "prompt_toks": 15581, "completion_toks": 67}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybin mushrooms\n\n(Redirected from Psilocybin)\n\nDialog-warning.svg.png\n\nExercise caution when consuming wild psilocybin mushrooms.\n\nIf consuming mushrooms harvested in nature, it is important to understand the risk of mistakenly consuming a poisonous (potentially fatal) look-alike variety.\n\nPlease see this section for more information.\n\nSummary sheet: Psilocybin mushrooms\n\n\n                    Context: \n                    This excerpt provides a warning and overview related to psilocybin mushrooms, emphasizing the importance of caution when foraging wild varieties due to the risk of poisonous look-alikes. It introduces the topic with a summary sheet, aligning with the document's focus on safety, effects, and identification of psychedelic mushrooms within the broader comprehensive guide.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_1", "document_index": 98, "latency_s": 0.8832773000031011, "prompt_toks": 15777, "completion_toks": 91}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybin mushrooms  Purpose  Chemical Nomenclature Common names Psilocybin, Psilocybin mushrooms, Magic Mushrooms, Shrooms, 4-PO-DMT Substitutive name 4-Phosphoryloxy-N,N-dimethyltryptamine Systematic name 3-[2-(Dimethylamino)ethyl]-1H-indol-4-ol Class Membership Psychoactive class Psychedelic Chemical class Tryptamine Routes of Administration WARNING: Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. See responsible use section . ⇣ Oral Dosage Threshold 2.5 mg Psilocybin Light 2.5 - 10 mg Psilocybin Common 10 - 25 mg Psilocybin Strong 25 - 50 mg Psilocybin Heavy 50 mg Psilocybin + Duration Total 6 - 8 hours Onset 20 - 45 minutes Come up 1 - 1.5 hours Peak 2 - 2.5 hours [1] Offset 2.5 - 3.5 hours After effects 4 - 24 hours DISCLAIMER : PW's dosage information is gathered from users and resources for educational purposes only. It is not a recommendation and should be verified with other sources for\n\n\n                    Context: \n                    This excerpt provides a concise overview of psilocybin mushrooms, including their purpose, chemical nomenclature, common names, pharmacology, dosage guidelines, and safety warnings. It situates key information about their active compounds, effects, and recommended usage within the broader context of harm reduction and scientific understanding found in the full webpage. This chunk serves as a quick-reference summary of essential facts for users seeking detailed but accessible data on psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_2", "document_index": 98, "latency_s": 1.4214540000102716, "prompt_toks": 15557, "completion_toks": 65}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    effects 4 - 24 hours DISCLAIMER : PW's dosage information is gathered from users and resources for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. Interactions Cannabis Amphetamines Cocaine Tramadol Lithium\n\n\n                    Context: \n                    This chunk summarizes the post-effects duration and includes a disclaimer about dosage sources, highlighting the importance of harm reduction and safety when using psilocybin mushrooms. Its placement within the broader document emphasizes the need for responsible use and awareness of drug interactions, making it relevant for users seeking detailed information on effects, safety, and risks.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_3", "document_index": 98, "latency_s": 0.8878648999962024, "prompt_toks": 15651, "completion_toks": 74}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybe cubensis, one of the most common psilocybin-containing mushrooms.\n\nPsilocybin mushrooms (also known as magic mushrooms, psychedelic mushrooms, and shrooms) are a family of psychoactive fungi that contain psilocybin, a psychedelic substance of the tryptamine class. The mechanism of action is not fully known, although binding activity at serotonin receptors is thought to be involved.\n\nPsilocybin mushrooms occur on all continents and have been taxonomically classified into over 200 species, the most potent of which belong to the genus Psilocybe.[2] Based on imagery found in prehistoric rock art, they are thought to have been used by various human cultures since before recorded history.\n\n\n                    Context: \n                    This excerpt provides an overview of Psilocybe cubensis, a widely used psilocybin-containing mushroom, and introduces the broader family of psychoactive fungi known as psilocybin mushrooms. It highlights their global distribution, historical use, and biochemical nature, serving as foundational context within the comprehensive detailed information about psilocybin mushrooms covered in the full webpage.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_4", "document_index": 98, "latency_s": 0.9700496000004932, "prompt_toks": 15639, "completion_toks": 50}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    After being introduced to the Western world in the 1950s, they generated substantial public interest.[3] Along with LSD, they were incorporated into the youth counterculture movement of the 1960s. Widespread usage of psychedelics provoked a societal backlash, and they were prohibited in 1970.[citation needed]\n\nToday, they are among the most widely used psychedelic substances (partly due to the ease of personal cultivation and harvesting). As a part of the so-called \"psychedelic renaissance\",[4] they are currently being investigated in the treatment of a number of ailments including anxiety, depression, addiction, and other mental disorders.[3]\n\n\n                    Context: \n                    This excerpt discusses the historical introduction, cultural impact, and modern resurgence of psilocybin mushrooms research, highlighting their societal regulation and current therapeutic investigations, relevant to understanding the substance's background and contemporary significance within the broader document on psilocybin.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_5", "document_index": 98, "latency_s": 1.6076972000009846, "prompt_toks": 15688, "completion_toks": 66}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Subjective effects include visual geometry, hallucinatory states, time distortion, enhanced introspection, conceptual thinking, euphoria, and ego loss. The intensity and duration of effects can vary greatly depending on factors such as species and batch, which can complicate standardized dosing information (see this section). They are often described to evoke entheogenic, mystical-like, or transpersonal experiences that may facilitate self-reflection and personal growth.\n\nIn distinction to psychedelics like LSD, mescaline, and 2C-B, which may be described as \"stimulating\", \"cerebral\", and \"bright\", psilocybin mushrooms are typically described as having an \"earthy\", \"subliminal\", or \"dream-like\" quality. They also are reported to produce slightly more emotion enhancement, time distortion and ego loss than the aforementioned substances, as well as more nausea, confusion, and sedation.\n\n\n                    Context: \n                    This excerpt summarizes the subjective effects of psilocybin mushrooms, highlighting visual, cognitive, and emotional experiences, and compares their typical mental and sensory qualities to other psychedelics. Its relevance lies in detailing the nature and variability of effects, aiding understanding of dosage, safety, and experiential outcomes described in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_6", "document_index": 98, "latency_s": 1.7604881000006571, "prompt_toks": 15764, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Unlike most highly prohibited substances, psilocybin mushrooms have low abuse potential and are neither addictive nor physiologically toxic.[5] However, adverse psychological reactions such as severe anxiety, paranoia, delusions and psychosis are always possible, particularly among individuals predisposed to mental disorders.[6]\n\nIt is highly advised to use harm reduction practices if using this substance.\n\nContents\n\n1 History and culture\n\n1.1 Common names\n\n1.2 Research\n\n1.2.1 Neurogenesis\n\n1.2.2 Psychoplastogen\n\n2 Chemistry\n\n3 Pharmacology\n\n4 Subjective effects\n\n4.1 Physical effects\n\n4.2 Visual effects\n\n4.2.1 Enhancements\n\n4.2.2 Distortions\n\n4.2.3 Geometry\n\n4.2.4 Hallucinatory states\n\n4.3 Cognitive effects\n\n4.4 Auditory effects\n\n4.5 Multi-sensory effects\n\n4.6 Transpersonal effects\n\n4.7 Combination effects\n\n4.8 Experience reports\n\n5 Dosage and preparation\n\n5.1 Psilocybin\n\n5.1.1 Dosage calculation\n\n5.1.2 Psilocybe cubensis\n\n5.2 Preparation methods\n\n6 Natural occurrence\n\n6.1 Psilocybe\n\n\n                    Context: \n                    This section highlights the low abuse potential and safety profile of psilocybin mushrooms compared to other prohibited substances, while emphasizing the risk of adverse psychological effects in predisposed individuals. It underscores the importance of harm reduction practices and provides an outline of the key topics covered in the broader document, including history, chemistry, pharmacology, effects, dosage, and natural occurrence of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_7", "document_index": 98, "latency_s": 0.7689785999973537, "prompt_toks": 15756, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    4.8 Experience reports\n\n5 Dosage and preparation\n\n5.1 Psilocybin\n\n5.1.1 Dosage calculation\n\n5.1.2 Psilocybe cubensis\n\n5.2 Preparation methods\n\n6 Natural occurrence\n\n6.1 Psilocybe\n\n6.2 Panaeolus\n\n6.3 Gymnopilus\n\n6.4 Dictyonema\n\n6.5 Risk of species confusion\n\n7 Research\n\n7.1 Antidepressant effects\n\n8 Toxicity and harm potential\n\n8.1 Lethal dosage\n\n8.2 Psychosis and mental disorder risk\n\n8.3 Dependence and abuse potential\n\n8.4 Hallucinogen-perception persisting disorder (HPPD)\n\n8.5 Dangerous interactions\n\n9 Legal status\n\n10 See also\n\n11 External links\n\n11.1 Discussion\n\n12 Literature\n\n13 References\n\nHistory and culture\n\nCave art in Tassili n'Ajjer, Algeria (look at the shoulders and knees)\n\nA growing body of evidence suggests that psychoactive mushrooms have been used by humans in religious ceremonies for thousands of years. In Mesoamerica, they have been consumed in ritual ceremonies for 3000 years.[3]\n\n\n                    Context: \n                    This section provides an organized outline of key topics related to psilocybin mushrooms, including experience reports, dosage guidelines, natural occurrence, research on therapeutic effects, toxicity, legal status, and cultural history. It summarizes critical subtopics such as dosage calculations, species information, research findings, harm potential, and historical use, serving as a structured reference within the full detailed article on psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_8", "document_index": 98, "latency_s": 0.7059964000072796, "prompt_toks": 15660, "completion_toks": 55}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    For example, murals dated 9000 to 7000 BCE found in the Sahara desert in southeast Algeria depict horned beings dressed as dancers holding mushroom-like objects.[7] 6,000-year-old pictographs discovered near the Spanish town of Villar del Humo illustrate several mushrooms that have been tentatively identified as Psilocybe hispanica, a hallucinogenic species native to the area.[8]\n\nArchaeological artifacts from Mexico have also been interpreted by some scholars as evidence for ritual and ceremonial usage of psychoactive mushrooms in the Mayan and Aztec cultures of Mesoamerica.[citation needed] In Nahuatl, the language of the Aztecs, the mushrooms were called teonanácatl, or \"God's flesh\".\n\n\n                    Context: \n                    This excerpt details the historical use and cultural significance of psilocybin mushrooms, including prehistoric art depicting their use in Africa and ancient artifacts from Mesoamerica indicating ritualistic consumption by Mayan and Aztec cultures, highlighting their long-standing role in human spiritual practices.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_9", "document_index": 98, "latency_s": 0.9416354999993928, "prompt_toks": 15625, "completion_toks": 62}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Following the arrival of Spanish explorers to the New World in the 16th century, chroniclers reported the use of mushrooms by the natives for ceremonial and religious purposes. Accounts describe mushrooms being eaten in festivities for the accession of emperors and the celebration of successful business trips by merchants.[9]\n\nAfter the defeat of the Aztecs, the Spanish forbade traditional religious practices and rituals that they considered \"pagan idolatry\", including ceremonial mushroom use. For the next four centuries, the Indians of Mesoamerica hid their use of entheogens from the Spanish authorities.[citation needed]\n\n\n                    Context: \n                    This chunk discusses the historical use of psychoactive mushrooms in indigenous Mesoamerican cultures, highlighting their ceremonial and religious significance prior to Spanish colonization. It is relevant to the document's section on the history and cultural context of psilocybin mushrooms, emphasizing their long-standing spiritual use and subsequent suppression by Spanish authorities.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_10", "document_index": 98, "latency_s": 0.8374795999989146, "prompt_toks": 15680, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    American banker and amateur ethnomycologist R. Gordon Wasson studied the ritual use of psychoactive mushrooms by the native population of a Mazatec village in Mexico. In 1957, Wasson described the psychedelic visions that he experienced during these rituals in \"Seeking the Magic Mushroom\", an article published in Life magazine.[10] Later that year, they were accompanied on a follow-up expedition by French mycologist Roger Heim, who identified several of the mushrooms as Psilocybe species.[11]\n\nHeim cultivated the mushrooms in France, and sent samples for analysis to Albert Hofmann, a chemist employed by the Swiss pharmaceutical company Sandoz (now Novartis). Hofmann, who had in 1938 created LSD, led a research group that isolated and identified the psychoactive compounds from Psilocybe mexicana.[12][13]\n\n\n                    Context: \n                    This paragraph details key historical research on psilocybin mushrooms, highlighting R. Gordon Wasson's ethnomycological studies in Mexico, Albert Hofmann's chemical identification of active compounds, and the cultivation and analysis of Psilocybe species, providing context for the scientific and cultural background of psilocybin's discovery and study discussed in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_11", "document_index": 98, "latency_s": 0.7684663999971235, "prompt_toks": 15684, "completion_toks": 75}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    He and his colleagues later synthesized a number of compounds chemically related to the naturally occurring psilocybin, to see how structural changes would affect psychoactivity. These included 4-HO-DET and 4-AcO-DMT. Sandoz marketed and sold pure psilocybin under the name \"Indocybin\" to clinicians worldwide without any reports of serious complications.[14][15]\n\nIn the early 1960s, Harvard University became a testing ground for psilocybin via the efforts of Timothy Leary and his associates, Ralph Metzner and Richard Alpert, under a project known as the Harvard Psilocybin Project. Leary obtained synthesized psilocybin from Hofmann through Sandoz. Some studies, such as the Concord Prison Experiment, found promising results for psilocybin's utility in clinical psychiatry.[16][17]\n\n\n                    Context: \n                    This section details the synthesis and early medical use of psilocybin, highlighting compounds like 4-HO-DET and 4-AcO-DMT developed by Sandoz and the pioneering psychiatric research at Harvard in the 1960s led by Timothy Leary, including studies such as the Concord Prison Experiment that explored psilocybin's therapeutic potential.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_12", "document_index": 98, "latency_s": 0.8339521000016248, "prompt_toks": 15700, "completion_toks": 86}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Leary and Alpert's zealous advocacy for widespread hallucinogen use led to a well-publicized termination from Harvard. In response to concerns about the increase in unauthorized use of psychedelic substances by the general public, psychedelics like psilocybin began to receive negative press and faced increasingly restrictive laws.\n\nIn the United States, laws were passed in 1966 that prohibited the production, trade, or ingestion of hallucinogenic substances. Sandoz stopped producing LSD and psilocybin the same year.[18] Further backlash against LSD usage swept psilocybin along with it into the Schedule I category of illicit substances in 1970. Subsequent restrictions on the use of these substances in human research made funding for such projects difficult to obtain, and scientists who worked with psychedelic drugs faced being \"professionally marginalized\".[19]\n\nIn 1976 the book Psilocybin Magic Mushroom Grower's Guide was released, written by Terence McKenna.\n\n\n                    Context: \n                    This excerpt details the historical suppression of psilocybin research and advocacy, highlighting key figures like Leary and Alpert's influence, subsequent legal restrictions in the US including Schedule I classification, and notable publications such as McKenna's guide, illustrating the shift from cultural use to prohibition. It provides context on the legal and societal challenges faced by psilocybin psychedelics, pertinent to understanding their current status and research potential.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_13", "document_index": 98, "latency_s": 0.8662856000009924, "prompt_toks": 15696, "completion_toks": 74}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    In 1976 the book Psilocybin Magic Mushroom Grower's Guide was released, written by Terence McKenna.\n\nIn 1978 Paul Stamets released Psilocybe Mushrooms & Their Allies.\n\nIn the 1990s, psychedelic research gradually began to regain traction, particularly in Europe. Advances in the neurosciences and the availability of brain imaging techniques have provided a reason for using substances like psilocybin to probe the \"neural underpinnings of psychotic symptom formation including ego disorders and hallucinations\".[20]\n\nRecent studies in the United States have attracted attention from the popular press and thrust psilocybin into the vogue again.[21]\n\nCommon names\n\nPsilocybin mushrooms have a number of common names. These include: psychedelic mushrooms, magic mushrooms, shrooms, magic truffles, and boomers.\n\nThe combination with MDMA is known as hippie-flipping.\n\nResearch\n\nNeurogenesis\n\n\n                    Context: \n                    This excerpt details key historical publications, recent research trends, and common names associated with psilocybin mushrooms, highlighting their cultural significance, scientific investigation, and terminology. It contextualizes the development of psychedelic research, notable authors, and popular nomenclature, serving as a reference for both historical and contemporary understanding within the broader document on psilocybin and its effects.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_14", "document_index": 98, "latency_s": 0.9782333000039216, "prompt_toks": 15735, "completion_toks": 80}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    The combination with MDMA is known as hippie-flipping.\n\nResearch\n\nNeurogenesis\n\nA low dose (0.1 mg/kg) of psilocybin produced a trend toward increased neurogenesis in the mouse hippocampus 2 weeks after its administration, while a high dose (1 mg/kg) significantly decreased neurogenesis. These results suggest that the effects of psilocybin on neurogenesis are dose- and time-related.[22]\n\nPsychoplastogen\n\nPsilocybin is a psychoplastogen,[23] which refers to a compound capable of promoting rapid and sustained neuroplasticity.\n\nChemistry\n\nPsilocybin, or 4-phosphoryloxy-N,N-dimethyltryptamine (4-PO-DMT) is a prodrug that is converted into the pharmacologically active compound psilocin in the body by a dephosphorylation reaction mediated by alkaline phosphatase enzymes.[24] Both psilocybin and psilocin are organic tryptamine compounds. They are chemically related to the amino acid tryptophan, and structurally similar to the neurotransmitter serotonin.\n\n\n                    Context: \n                    This section summarizes recent research findings on psilocybin's neurobiological effects, including its dose-dependent influence on neurogenesis and its role as a psychoplastogen promoting neuroplasticity. It also briefly explains psilocybin's chemical structure as a prodrug convertible into psilocin, highlighting its relation to serotonin and its significance within the overall pharmacology of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_15", "document_index": 98, "latency_s": 0.6685828000045149, "prompt_toks": 15660, "completion_toks": 62}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Tryptamines share a core structure comprised of a bicyclic indole heterocycle attached at R3 to an amino group via an ethyl side chain. Psilocybin is substituted at R4 of its indole heterocycle with a phosphoryloxy (-PO) functional group. It also contains two methyl groups CH3- bound to the terminal amine RN. This makes psilocybin the 4-phosphoryloxy ring-substituted analog of DMT.[25]\n\nPsilocybin and psilocin occur in their pure forms as white crystalline powders. Both are unstable in light, particularly while in solution, although their stability at low temperatures in the dark under an inert atmosphere is very good.[26]\n\nPharmacology\n\n\n                    Context: \n                    This section provides detailed chemical and pharmacological information about psilocybin, including its molecular structure, stability in different conditions, and its relation to tryptamines like DMT, which is key for understanding its psychoactive properties and behavior within the larger context of psilocybin mushrooms discussed in this document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_16", "document_index": 98, "latency_s": 1.1588570000021718, "prompt_toks": 15670, "completion_toks": 70}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Pharmacology\n\nThe diagram above demonstrates the neural connections associated with sobriety in comparison to being under the influence of psilocybin as demonstrated through the use of MRI scans. The width of the links is proportional to their weight and the size of the nodes is proportional to their strength. Note that the proportion of heavy links between communities is much higher (and very different) in the psilocybin group, suggesting greater integration[27]\n\nFurther information: Serotonergic psychedelic\n\nPsilocybin acts as a prodrug to psilocin, meaning it is not active until it is converted into psilocin in the body. Upon entering the body, psilocybin is dephosphorylated to psilocin in the intestinal mucosa by alkaline phosphatase and nonspecific esterase.[3]\n\n\n                    Context: \n                    This excerpt from the pharmacology section details how psilocybin functions as a prodrug to psilocin, highlighting its conversion process in the body and the neural effects observed via MRI studies, emphasizing increased brain integration under its influence; it is essential for understanding the biochemical mechanisms and neural impacts of psilocybin contained in the full psychedelic profile.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_17", "document_index": 98, "latency_s": 1.1285238999989815, "prompt_toks": 15728, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocin's psychedelic effects are believed to come from its agonist activity on serotonin 5-HT2A/C and 5-HT1A receptors.[3] While 5-HT2A receptor agonism is considered necessary for hallucinogenic activity, the role of other receptor subtypes is much less understood.[3]\n\nUnlike LSD, psilocin has no significant effect on dopamine receptors and only affects the noradrenergic system at very high dosages.[28]\n\nPsilocybin has also been shown by fMRI imaging to have a dampening effect on certain brain regions, most notably the Default Mode Network.[citation needed]\n\nSubjective effects\n\nThe headspace of psilocybin mushrooms is typically described as extremely relaxing, profound and stoning in style compared to more stimulating psychedelics such as LSD or 2C-B. They are also regarded as being less clear-headed than other commonly used tryptamines such as 4-AcO-DMT, DMT and ayahuasca. This may be due to the presence of other alkaloids like norbaeocystin.\n\n\n                    Context: \n                    This excerpt discusses the pharmacological mechanisms and subjective effects of psilocin and psilocybin, highlighting their receptor activity, brain region impacts, and typical experiential qualities. It provides important details on how these compounds produce their psychedelic effects and their unique mental state compared to other psychedelics, situating this information within the broader context of psilocybin mushroom effects and neuropharmacology.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_18", "document_index": 98, "latency_s": 0.6980609000020195, "prompt_toks": 15655, "completion_toks": 72}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Disclaimer: The effects listed below cite the Subjective Effect Index (SEI), an open research literature based on anecdotal user reports and the personal analyses of PsychonautWiki contributors. As a result, they should be viewed with a healthy degree of skepticism.\n\nIt is also worth noting that these effects will not necessarily occur in a predictable or reliable manner, although higher doses are more liable to induce the full spectrum of effects. Likewise, adverse effects become increasingly likely with higher doses and may include addiction, severe injury, or death ☠.\n\nPhysical effects\n\nNeurogenesis[22]\n\nSedation - Psilocybin mushrooms are reported to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by excessive yawning.\n\n\n                    Context: \n                    This excerpt introduces a disclaimer about the anecdotal and subjective nature of reported effects of psilocybin mushrooms, emphasizing their unpredictability and the potential for adverse outcomes at higher doses. It also begins detailing physical effects, starting with sedation and relaxation, as part of the comprehensive information on psilocybin's effects and harm reduction considerations in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_19", "document_index": 98, "latency_s": 0.6950839000055566, "prompt_toks": 15628, "completion_toks": 60}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Physical effects\n\nNeurogenesis[22]\n\nSedation - Psilocybin mushrooms are reported to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by excessive yawning.\n\nSpontaneous bodily sensations - The \"body high\" of psilocybin can be described as a pleasurable, soft and all-encompassing tingling sensation or glow that steadily rises with the onset and hits its limit at the peak. Once the peak of the experience or sensation is reached it can feel incredibly euphoric and tranquil or heavy and immobilizing depending on the dose and setting.\n\n\n                    Context: \n                    This section details the physical effects of psilocybin mushrooms, including neurogenesis and sedative sensations, as part of the comprehensive effects overview. It highlights how these psychoactive fungi can induce relaxation, bodily sensations, and sensory experiences, essential for understanding safety and experience profiles within the broader drug information.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_20", "document_index": 98, "latency_s": 1.1898669000074733, "prompt_toks": 15656, "completion_toks": 99}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Perception of bodily heaviness- This effect corresponds to the general sense of sedation and relaxation that characterizes psilocybin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the experience. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens.[citation needed]\n\nTactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still present and unique in its character. It is repeatedly described as feeling very primitive in its nature often times with the small hairs on the user's arms or legs feeling slightly itchy or even ticklish against the skin.\n\n\n                    Context: \n                    This excerpt details two physical effects of psilocybin mushrooms: the sensation of bodily heaviness, which occurs mainly during the first half of the experience and is more pronounced in certain species like Psilocybe azurescens, and tactile enhancement, characterized by primitive sensations such as itching or ticklish feelings on the skin. These effects are part of the comprehensive description of psilocybin’s physical and perceptual impacts, supporting harm reduction and user awareness in the overall drug information guide.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_21", "document_index": 98, "latency_s": 0.5803090999979759, "prompt_toks": 15700, "completion_toks": 39}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually occurs around the peak of the experience or directly after. Users can feel as if they are physically part of or conjoined with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful.\n\nPain relief - This effect can be considered as less intense when compared with LSD. Like most psychedelics, this effects is likely a result of reductions in inflammation as well as from distortions in sensory processing. This effect, while common, is not guaranteed. An increase in pain perception is also possible.\n\nNausea - This effect can be greatly lessened or even completely avoided if the individual has an empty stomach prior to ingestion. It is often recommended that one either refrain from eating for approximately 6 to 8 hours beforehand, or eat a light meal 3 to 4 hours before if they are feeling physically fatigued.\n\nChanges in felt gravity\n\n\n                    Context: \n                    This section details the physical effects experienced during a psilocybin trip, including bodily sensations, pain perception, nausea management, and changes in felt gravity, providing essential harm reduction and experience insights.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_22", "document_index": 98, "latency_s": 1.2423783000122057, "prompt_toks": 15702, "completion_toks": 78}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Changes in felt gravity\n\nExcessive yawning - This effect seems to be uniquely pronounced among psilocybin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline. It typically occurs in combination with watery eyes.\n\nWatery eyes\n\nFrequent urination\n\nMuscle contractions\n\nOlfactory hallucination\n\nPupil dilation\n\nRunny nose\n\nIncreased salivation\n\nBrain zaps[citation needed] - Although this effect is very rare, it can still occur for those susceptible to it. This component is however much less common and intense than it is with serotonin releasing agents such as MDMA.\n\nSeizure[citation needed] - This is a rare effect but can happen in a small population of those who are predisposed to them, particularly while in physically taxing conditions such as being dehydrated, undernourished, overheated, or fatigued.\n\nVisual effects\n\nEnhancements\n\n\n                    Context: \n                    This segment details the physical and visual effects associated with psilocybin mushrooms, including changes in felt gravity such as yawning and watery eyes, as well as common physical symptoms like pupillary dilation, runny nose, and increased salivation. It highlights rare effects such as brain zaps and seizures, emphasizing their infrequency and possible predispositions, and transitions into visual effects enhancements.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_23", "document_index": 98, "latency_s": 1.0505911999935051, "prompt_toks": 15699, "completion_toks": 72}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Visual effects\n\nEnhancements\n\nColour enhancement - Relative to other psychedelics, this effect may appear to be more saturated.\n\nPattern recognition enhancement\n\nVisual acuity enhancement - This effect typically occurs prominently at lower doses and becomes increasingly suppressed as one raises the dose.[citation needed]\n\nDistortions\n\nDrifting (melting, flowing, breathing and morphing) - In comparison to other psychedelics, this effect can be described as highly detailed, realistic, slow and smooth in motion and static in appearance.\n\nColour shifting\n\nColour tinting\n\nVisual haze\n\nDiffraction\n\nTracers\n\nAfter images\n\nSymmetrical texture repetition\n\nPerspective distortions\n\nDepth perception distortions\n\nRecursion\n\nEnvironmental orbism\n\nScenery slicing\n\nGeometry\n\nThe visual geometry produced by psilocybin mushrooms can be described as more similar in appearance to that of 4-AcO-DMT, ayahuasca and 2C-E than LSD or 2C-B.\n\n\n                    Context: \n                    This excerpt details the visual effects section of the psilocybin mushrooms page, outlining common enhancements and distortions experienced during a trip, such as color saturation, pattern recognition, drifting visuals, and geometric patterns. It provides a focused overview of the characteristic visual phenomena associated with psilocybin, complementing the broader effects and safety information within the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_24", "document_index": 98, "latency_s": 1.2628047999896808, "prompt_toks": 15722, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Scenery slicing\n\nGeometry\n\nThe visual geometry produced by psilocybin mushrooms can be described as more similar in appearance to that of 4-AcO-DMT, ayahuasca and 2C-E than LSD or 2C-B.\n\nIt can be comprehensively described through its variations as intricate in complexity, abstract in form, organic in feel, structured in organization, brightly lit, and multicoloured in scheme, glossy in shading, soft in its edges, large in size, slow in speed, smooth in motion, rounded in its corners, non-immersive in-depth and consistent in intensity.\n\nIt has a very \"organic\" feel and at higher dosages is significantly more likely to result in states of Level 8B visual geometry over level 8A.\n\nHallucinatory states\n\nPsilocybin and its various other forms produce a full range of high level hallucinatory states in a fashion that is more consistent and reproducible than that of many other commonly used psychedelics. These effects generally include:\n\nMachinescapes\n\nTransformations\n\n\n                    Context: \n                    This section details the visual effects of psilocybin mushrooms, focusing on scenery slicing and geometry, describing intricate, organic, and multicolored visual patterns. It emphasizes the similarity to substances like 4-AcO-DMT and ayahuasca, and highlights high-level hallucinations such as machinescapes and transformations—key information for understanding psilocybin's perceptual impact.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_25", "document_index": 98, "latency_s": 0.7305845000082627, "prompt_toks": 15618, "completion_toks": 64}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Machinescapes\n\nTransformations\n\nInternal hallucination (autonomous entities; settings, sceneries, and landscapes; perspective hallucinations and scenarios and plots) - This effect is very consistent in dark environments at appropriately high dosages. They can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical, or transcendental nature in their overall theme.\n\n\n                    Context: \n                    This section describes the visual hallucination phenomena, specifically \"Machinescapes\" and \"Transformations,\" experienced under psilocybin mushrooms, emphasizing their consistent appearance in dark environments at high doses and their highly personal, surreal, and transcendental themes, which are key aspects of the subjective effects detailed in the document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_26", "document_index": 98, "latency_s": 0.7662699000065913, "prompt_toks": 15672, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    External hallucination (autonomous entities; settings, sceneries, and landscapes; perspective hallucinations and scenarios and plots) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical or transcendental nature in their overall theme.\n\nCognitive effects\n\nEmotion enhancement - This effect can be described as being more prominent, consistent and profound when compared to other traditional psychedelics such as mescaline or LSD. This can lead to strong feelings of compassion, urgency and even completely sporadic moments of intense emotional significance that can also be periodically affected by enhancement and suppression cycles.\n\n\n                    Context: \n                    This excerpt details the visual phenomenon of external hallucinations, emphasizing their prevalence in dark environments and their characteristic features, including believability and controllability. It is followed by a section on the cognitive effect of emotion enhancement, highlighting its intensity and emotional impact compared to other psychedelics. These insights are relevant to understanding the depth and variety of psilocybin mushroom effects covered in the comprehensive document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_27", "document_index": 98, "latency_s": 0.9327164999995148, "prompt_toks": 15679, "completion_toks": 59}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Empathy, affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a less consistent rate. The sociability enhancement in particular only occurs rarely and it appears to be more emotional.\n\nEuthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for several mental health problems.\n\nLanguage suppression - This effect can be described as a perceived inability or general unwillingness to talk aloud despite feeling perfectly capable of formulating coherent thoughts within one's internal narrative. It is much more common among inexperienced users.\n\nAnalysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n\n\n                    Context: \n                    This section summarizes subjective cognitive effects of psilocybin mushrooms, including enhanced empathy and sociability, the therapeutic potential of euphemia in psychedelic-assisted psychotherapy, language suppression, and increased introspective analysis, highlighting their significance within the broader discussion of psilocybin's psychological impacts.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_28", "document_index": 98, "latency_s": 0.8126726000045892, "prompt_toks": 15684, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n\nEnhancement and suppression cycles - This can be described as constant waves of extremely stimulated and profound thinking which are spontaneously surpassed in a cyclic fashion by waves of general thought suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes.\n\nFeelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or subsides once the primary effects begin. It should be noted that this effect is relatively consistent and normal for psilocybin and related tryptamines which is why a positive and well-informed mindset is key. Less regularly this aspect can also occur during the peak but will most often be met afterwards with sensations of euphoria, catharsis or rejuvenation.\n\nCognitive euphoria\n\nAutonomous voice communication\n\n\n                    Context: \n                    This section details specific cognitive and emotional effects of psilocybin mushrooms, including their consistent tendency to enhance introspection and stimulate cycles of intense and suppressed thinking, as well as common experiences like feelings of impending doom, cognitive euphoria, and autonomous voice communication. These effects are relevant for understanding the subjective mental states induced by psilocybin, and are key for harm reduction and safe usage.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_29", "document_index": 98, "latency_s": 0.5962754000065615, "prompt_toks": 15698, "completion_toks": 56}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Cognitive euphoria\n\nAutonomous voice communication\n\nSuggestibility enhancement\n\nConceptual thinking\n\nThought connectivity\n\nThought deceleration\n\nThought loops\n\nThought organization\n\nConfusion - This effect occurs at a higher rate than other psychedelics such as LSD or DMT. It is more commonly observed in users who are inexperienced with psilocybin, or psychedelics in general\n\nNovelty enhancement\n\nCreativity enhancement\n\nDelusion\n\nDéjà vu\n\nIncreased music appreciation\n\nImmersion enhancement\n\nMemory enhancement\n\nMemory suppression\n\nEgo death\n\nMindfulness\n\nSimultaneous emotions\n\nPersonal bias suppression\n\nEgo replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca, it can still spontaneously occur, usually with higher doses.\n\nPersonality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting.\n\nCatharsis\n\n\n                    Context: \n                    This section outlines various cognitive and psychological effects associated with psilocybin mushrooms, including enhancements in memory, creativity, and music appreciation, as well as effects like confusion, ego death, and ego replacement, emphasizing their significance within the broader discussion of subjective psychedelic experiences and safety considerations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_30", "document_index": 98, "latency_s": 0.9800592999963555, "prompt_toks": 15665, "completion_toks": 56}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Personality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting.\n\nCatharsis\n\nRejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocybin experience and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocybin and related tryptamines.\n\nAddiction suppression[29]\n\nTime distortion\n\nAuditory effects\n\nAuditory enhancement\n\nAuditory distortion\n\nAuditory hallucination\n\nMulti-sensory effects\n\n\n                    Context: \n                    This chunk outlines subjective effects of psilocybin mushrooms related to personality change, emotional release, and sensory distortions, including catharsis, rejuvenation, time distortion, auditory and multisensory effects, highlighting complex experiential components critical for understanding their psychoactive profile.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_31", "document_index": 98, "latency_s": 1.0094054999935906, "prompt_toks": 15670, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Addiction suppression[29]\n\nTime distortion\n\nAuditory effects\n\nAuditory enhancement\n\nAuditory distortion\n\nAuditory hallucination\n\nMulti-sensory effects\n\nSynaesthesia - In its fullest manifestation, this is a very rare and non-reproducible effect. Increasing the dosage can increase the likelihood of this occurring, but seems to only be a prominent part of the experience among those who are already predisposed to synaesthetic states.\n\nDosage independent intensity[citation needed]\n\nTranspersonal effects\n\nAnecdotally, these components are generally considered to be most consistent with the naturally-occurring entheogenic tryptamines such as ayahuasca, ibogaine and psilocybin. They are listed below as follows:\n\nSpirituality enhancement\n\nExistential self-realization\n\nUnity and interconnectedness\n\nCombination effects\n\n\n                    Context: \n                    This section details the spiritual, perceptual, and sensory effects of psilocybin mushrooms, including synaesthesia, auditory phenomena, and transpersonal experiences. It highlights the rarity and significance of these effects, their association with other entheogenic compounds, and their relevance to harm reduction and user experience understanding within the broader discussion of psilocybin's effects.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_32", "document_index": 98, "latency_s": 0.8653306999913184, "prompt_toks": 15696, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Spirituality enhancement\n\nExistential self-realization\n\nUnity and interconnectedness\n\nCombination effects\n\nCannabis - Cannabis majorly amplifies the sensory and cognitive effects of psilocybin mushrooms. This should be used with extreme caution, especially if one is not experienced with psychedelics. This interaction can also amplify the anxiety, confusion and delusion producing aspects of cannabis significantly. Those who choose to use this combination are advised to start off with only a fraction of their usual cannabis dose, and slow down the pace of their normal intake considerably.\n\nDissociatives - Dissociatives can enhance the geometry, euphoria, dissociation and hallucinatory effects of psilocybin mushrooms. Dissociative-induced holes, spaces, and voids while under the influence of psilocybin can result in significantly more vivid visuals than dissociatives alone, along with more intense internal hallucinations, confusion, nausea, delusions and increased risk of psychosis.\n\n\n                    Context: \n                    This excerpt discusses the combination effects of psilocybin mushrooms with other substances, highlighting how cannabis and dissociatives can significantly amplify the visual, cognitive, and perceptual experiences associated with psychedelics, while also increasing associated risks such as anxiety, confusion, nausea, and psychosis. It is part of a comprehensive overview of drug interactions under the section on effects and safety considerations of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_33", "document_index": 98, "latency_s": 0.7816931999986991, "prompt_toks": 15698, "completion_toks": 70}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    MDMA - MDMA enhances the visual, physical and cognitive effects of psilocybin. The synergy between these substances is unpredictable, and it is advised to start with lower dosages than one would take for either substance individually. The toxicity of this combination is unknown, although there is some evidence that suggests this may increase the the neurotoxic effects of MDMA.[30][31][32]\n\nAlcohol - This combination is not typically recommended due to alcohol’s potential to cause dehydration, nausea, and physical fatigue at higher doses. However, this combination is reasonably safe in low doses and, when used responsibly, can \"take the edge off a trip\" and reduce anxiety in a manner somewhat similar to benzodiazepines. With psilocybin mushrooms in particular it is often recommended that the user waits until the \"come down\" phase to consume alcohol due to the sometimes nauseating effects of mushrooms, especially within the first 2 - 3 hours of the experience.\n\n\n                    Context: \n                    This section discusses drug interactions involving psilocybin mushrooms, specifically focusing on how combining them with substances like MDMA and alcohol can alter effects and safety considerations. It highlights the unpredictable synergy with MDMA and the general caution against alcohol use, emphasizing harm reduction and the importance of responsible use within the larger context of toxicity and safe practices outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_34", "document_index": 98, "latency_s": 0.955399500002386, "prompt_toks": 15692, "completion_toks": 76}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Benzodiazepines - Depending on the dosage, benzodiazepines can slightly to completely reduce the intensity of the cognitive, physical and visual effects of a psilocybin trip. They can be very efficient at largely stopping or mitigating a bad trip at the cost of amnesia and reduced trip intensity. Caution is advised when acquiring them for this purpose, however, due to the high abuse potential they possess.\n\nPsychedelics - When used in combination with other psychedelics, the physical, cognitive and visual effects of each substance intensify and synergize strongly with each other. The synergy between those substances is unpredictable, and for this reason, is generally not advised. If choosing to combine psychedelics, it is recommended to start with lower dosages than one would take for either substance individually.\n\nExperience reports\n\nThere are currently 29 anecdotal reports which describe the effects of this compound within our experience index.\n\n\n                    Context: \n                    This excerpt discusses the interactions and safety considerations of combining psilocybin with benzodiazepines and other psychedelics, highlighting potential effects and risks. It also mentions the existing user anecdotal reports related to psilocybin experiences. These sections are relevant for understanding drug interactions, harm reduction, and user experiences within the broader context of psilocybin mushroom information.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_35", "document_index": 98, "latency_s": 0.7010603999951854, "prompt_toks": 15765, "completion_toks": 51}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Experience reports\n\nThere are currently 29 anecdotal reports which describe the effects of this compound within our experience index.\n\nExperience: 1.5g Psilocybe Cubensis - Analysis of body and mind\n\nExperience: 2g Psilocybe cubensis (Lemon Tek) + 0.25mg Cannabis (Bong) - Passing through The Doors to the Eternal Summer\n\nExperience:1.5 Grams Psilocybe Cubensis\n\nExperience:15g Psilocybe Mexicana Truffles - First experince\n\nExperience:15g psilocybe truffles - first experience\n\nExperience:1g of stars and love\n\nExperience:2 grams Psilocybe Cubensis + 2.7 grams Syrian Rue - The Psilohuasca Albino Fox\n\nExperience:2.5g - Swim's first mushroom trip\n\nExperience:2.5g Mushrooms + 500mg DMT\n\nExperience:2.5g Psilocybe Cubensis B+ strain - epiphany of nondualistic reality\n\nExperience:225ug LSD + 9g cubensis - Galactic Melt and the Meverse\n\nExperience:3 Grams of Mushrooms - Reset on my Life, Experiencing Satori and the Cosmic Perspective\n\n\n                    Context: \n                    This section lists anecdotal user experiences with psilocybin mushrooms, providing specific dosages and effects reported by individuals, which offers practical insights into the subjective effects, dosage variability, and personal reports that complement the scientific and harm reduction information throughout the document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_36", "document_index": 98, "latency_s": 0.8455680000042776, "prompt_toks": 15751, "completion_toks": 75}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Experience:225ug LSD + 9g cubensis - Galactic Melt and the Meverse\n\nExperience:3 Grams of Mushrooms - Reset on my Life, Experiencing Satori and the Cosmic Perspective\n\nExperience:3.5g psilocybe cubensis - Relinquishing of Material Chains/Fear and Desolation\n\nExperience:3g - I found god inside of myself\n\nExperience:4.5g - The Grand Introduction to Beauty and Fear\n\nExperience:4g - States of unity and interconnectedness\n\nExperience:5.3g psilocybe cubensis - Dimensional Circumstance and the Fabric of Understanding\n\nExperience:5g Mushrooms - Failed attempt at a Terence Mckenna style trip.\n\nExperience:A Strong Trip: Disconnecting from Reality and Forgetting the World\n\nExperience:Cubensis genius trials\n\nExperience:Mushrooms (~0.5 g) - Autonomous Voice\n\nExperience:Mushrooms and Snuff Films -- Trip Report (3.5 grams)\n\nExperience:Psilocybe Cubensis (2g, Oral) - First Spiritual Experience(?)\n\nExperience:Psilocybin Mushroom (0.16 g, Oral) - Dosage Independent Intensity\n\n\n                    Context: \n                    This collection of user experience reports provides anecdotal insights into the effects, dosages, and subjective experiences associated with various amounts of psilocybin mushrooms and LSD, supplementing the detailed effects and dosage information found in the main document. It highlights real-world trip descriptions, including intensity levels, personal reflections, and combination effects, useful for understanding typical user outcomes and safety considerations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_37", "document_index": 98, "latency_s": 1.2340069000056246, "prompt_toks": 15743, "completion_toks": 86}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Experience:Psilocybe Cubensis (2g, Oral) - First Spiritual Experience(?)\n\nExperience:Psilocybin Mushroom (0.16 g, Oral) - Dosage Independent Intensity\n\nExperience:Psilocybin mushrooms (~4.8 g) - A challenging first trip\n\nExperience:Psilocybin or O-Acetylpsilocin (8000mg oral) - Don't you see? Don't you realize?\n\nExperience:Psilocybin truffles (15g, tea) - Untitled\n\nExperience:Unknown dosage - An omniscient sphere\n\nExperience:~80-100 Psilocybe Subaeruginosa\n\nAdditional experience reports can be found here:\n\nErowid Experience Vaults: Mushrooms\n\nDosage and preparation\n\nThe dosage of psilocybin mushrooms depends on the potency of the mushroom (the total psilocybin and psilocin content of the mushrooms), which varies significantly both between species and within the same species. However, \"the most commonly used mushroom is Psilocybe cubensis, which contains 10–12 mg of psilocybin per gram of dried mushrooms\".[33]\n\n\n                    Context: \n                    This excerpt consolidates user-reported experiences with psilocybin mushrooms at various dosages and methods, emphasizing the variability and subjective effects of the substance. It highlights specific trip reports, including dose ranges from light to challenging levels, and notes that potency varies between species and within individual mushrooms. This information complements the detailed dosage, effects, and safety data provided in the larger guide to inform users about real-world experiences and dosage considerations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_38", "document_index": 98, "latency_s": 0.8874753000127384, "prompt_toks": 15781, "completion_toks": 88}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    The concentration of active psilocybin mushroom compounds varies not only from species to species, but also from mushroom to mushroom inside a given species, subspecies or variety. The same holds true even for different parts of the same mushroom.\n\nFor example, in the species Psilocybe samuiensis, the dried cap of the mushroom contains the most psilocybin at about 0.23%–0.90%. The mycelium contains about 0.24%–0.32%.[34]\n\nPsilocybin\n\nDosage calculation\n\nMath: Desired psilocybin from divided by the psilocybin strength of the strain. For example, if you want to consume 15 mg psilocybin (a common dose) from cubensis with 1% psilocybin content:\n\nPsilocybe cubensis\n\nMain article: Psilocybe cubensis (mycology)\n\nPsilocybe cubensis (also known as cubes) is one of the most commonly used species of psilocybin mushrooms. The doses for oral consumption for dried cubensis mushrooms are generally considered to be:\n\nThreshold: 0.25 - 0.5 g\n\nLight: 0.5 - 1 g\n\nCommon: 1 - 2.5 g\n\nStrong: 2.5 - 5 g\n\n\n                    Context: \n                    This section details the variability in psilocybin content across different mushroom species and even within individual mushrooms, providing specific examples like Psilocybe samuiensis. It also offers practical dosage calculations for Psilocybe cubensis, one of the most common species, including recommended dose ranges for different intensities. This information supports understanding potency differences and dosing in the context of safe and effective use of psilocybin-containing mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_39", "document_index": 98, "latency_s": 0.654537900001742, "prompt_toks": 15688, "completion_toks": 57}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Threshold: 0.25 - 0.5 g\n\nLight: 0.5 - 1 g\n\nCommon: 1 - 2.5 g\n\nStrong: 2.5 - 5 g\n\nHeavy: 5 g +\n\nPreparation methods\n\nPreparation methods for this compound within our tutorial index include:\n\nBrown rice flour psilocybin mushroom tek\n\nOutdoor mushroom cultivation\n\nMushroom chocolates\n\nMushroom tea\n\nPsilocybin mushroom lemon tek\n\nNatural occurrence\n\nBiological genera containing psilocybin mushrooms include Copelandia, Galerina, Gymnopilus, Inocybe, Mycena, Panaeolus, Pholiotina, Pluteus, and Psilocybe. Over 100 species are classified in the genus Psilocybe.\n\nSome common psilocybin and psilocin containing mushroom species include:\n\n\n                    Context: \n                    This segment provides detailed dosage ranges, preparation techniques, and natural occurrence information for psilocybin mushrooms, key topics within the broader discussion of psychedelic substances in the document. It aids understanding of safe consumption levels, cultivation methods, and species identification, essential for harm reduction and identification efforts.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_40", "document_index": 98, "latency_s": 1.1365359000046737, "prompt_toks": 15806, "completion_toks": 93}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Some common psilocybin and psilocin containing mushroom species include:\n\nPsilocybe Psilocybe semilanceata , also known as the liberty cap. Psilocybe atlantis Psilocybe azurescens Psilocybe brasiliensis Psilocybe caerulescens Psilocybe columbiana Psilocybe cubensis Psilocybe cyanescens Psilocybe galindoi Psilocybe laurae Psilocybe mexicana Psilocybe paulensis Psilocybe plutonia Psilocybe semilanceata Psilocybe subaeruginosa Psilocybe tampanensis Psilocybe weraroa Psilocybe wrightii Psilocybe zapotecorum Panaeolus Panaeolus cyanescens , also known as the pan cyan. Panaeolus africanus Panaeolus campanulatus Panaeolus cinctulus Panaeolus cyanescens Panaeolus subbalteatus Panaeolus venezolanus Gymnopilus Gymnopilus luteofolius Gymnopilus aeruginosus Gymnopilus luteofolius Gymnopilus luteus Gymnopilus purpuratus Dictyonema Dictyonema huaorani (This species is a lichen not a mushroom)\n\nRisk of species confusion\n\n\n                    Context: \n                    This section lists various mushroom species containing psilocybin and psilocin, highlighting common examples such as Psilocybe semilanceata and Psilocybe cubensis, as well as other genera like Panaeolus, Gymnopilus, and Dictyonema. It emphasizes the diversity of psychoactive fungi and underscores the risk of species confusion, which is critical for safe identification and avoiding poisonous look-alikes discussed elsewhere in the document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_41", "document_index": 98, "latency_s": 0.7233199999900535, "prompt_toks": 15656, "completion_toks": 61}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Risk of species confusion\n\nAs psilocybin mushrooms are capable of being harvested in nature, there is a major risk in misidentifying the mushroom species and accidentally consuming a poisonous (possibly lethal) variety. This risk can be avoided by educating oneself in advance on how to properly identify the correct species of mushroom and the potential look-alike mushrooms found within one's local area. Users are encouraged to learn from a mentor who is experienced in mushroom picking before doing it on their own.\n\nResearch\n\nAntidepressant effects\n\nWhile further research is needed to establish the utility of psilocybin and other psychedelics in treating depression, a pilot study has observed significantly decreased depression scores in terminal cancer patients six months after treatment with psilocybin.[35]\n\n\n                    Context: \n                    This section discusses the risks associated with harvesting psilocybin mushrooms in nature, emphasizing the danger of species misidentification and potential poisoning, and highlights the importance of proper identification and expert guidance. It also briefly mentions research findings on the antidepressant effects of psilocybin, illustrating its potential therapeutic benefits.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_42", "document_index": 98, "latency_s": 0.7572063999978127, "prompt_toks": 15673, "completion_toks": 72}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    An open-label study was carried out in 2016 in the UK to investigate the feasibility, safety and efficacy of psilocybin in treating patients with unipolar treatment-resistant depression with promising results; although the study was small and involved only twelve patients, seven of those patients met formal criteria for remission one week following psilocybin treatment and five of those were still in remission from their depression at three months.[36]\n\nThe mechanism behind this is not known as of yet, but researchers have suggested that psilocin's deactivation of the medial prefrontal cortex[37] (mPFC) may be relevant to its antidepressant effects, as the mPFC is known to be elevated in depression and normalized after effective treatment.[37] mPFC hyperactivity has been associated with trait rumination.[38]\n\n\n                    Context: \n                    This excerpt discusses clinical research on psilocybin's potential therapeutic effects for depression, highlighting a 2016 UK study showing remission in treatment-resistant cases and exploring possible neural mechanisms involving deactivation of the medial prefrontal cortex. It is relevant to the document's overview of research, mental health applications, and pharmacology of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_43", "document_index": 98, "latency_s": 0.9838470999966376, "prompt_toks": 15653, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Another possible factor to psilocybin's potential against depression may be that depressed patients with high levels of dysfunctional attitudes were found to have low levels of 5-HT(2A) agonism.[39][40]\n\nToxicity and harm potential\n\nTable from the 2010 DrugScience study ranking various drugs (legal and illegal) based on statements by drug-harm experts. This study rated \"mushroom\" the least harmful drug overall and for users, and the only drug that didn't get any scores for harm on others.[41]\n\nRadar plot showing relative physical harm, social harm, and dependence of benzodiazepines in comparison to other drugs.[42]\n\nFurther information: Responsible use § Hallucinogens\n\n\n                    Context: \n                    This excerpt discusses potential neurochemical factors contributing to psilocybin's antidepressant effects, specifically noting the relationship between high dysfunctional attitudes and low 5-HT(2A) receptor activity. It then transitions to a summary of the toxicity and harm potential of psilocybin mushrooms, highlighting their low overall harm ranking from the 2010 DrugScience study and comparing relative safety to other drugs.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_44", "document_index": 98, "latency_s": 0.9514608000026783, "prompt_toks": 15634, "completion_toks": 50}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Radar plot showing relative physical harm, social harm, and dependence of benzodiazepines in comparison to other drugs.[42]\n\nFurther information: Responsible use § Hallucinogens\n\nNumerous studies have found that psilocybin mushrooms are physiologically well-tolerated and has an extremely low toxicity relative to dose. There is no evidence for long-lasting effects on the brain or other organs and there are no documented deaths attributed to the direct effects of psilocybin mushrooms toxicity.[43]\n\nHowever, it is worth noting that while they may not be capable of causing direct bodily toxicity or death, their use can still present serious hazards.\n\n\n                    Context: \n                    This section discusses the toxicity, safety profile, and potential risks associated with psilocybin mushrooms, emphasizing their low physiological harm but cautioning about psychological dangers and interactions; it is relevant for harm reduction and understanding their relative safety compared to other substances.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_45", "document_index": 98, "latency_s": 0.8568572000076529, "prompt_toks": 15663, "completion_toks": 91}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    However, it is worth noting that while they may not be capable of causing direct bodily toxicity or death, their use can still present serious hazards.\n\nFor example, they are capable of strongly impairing the user's judgment and attention span, which may promote erratic or dangerous behaviors. In extreme cases, the user may experience powerful delusions e.g. that they are actually inside of a dream and therefore physically invincible, or that they are being \"chased by demons\". This may prompt them to jump off of a building or run into oncoming traffic.[43]\n\nAdditionally, intense negative experiences and psychotic episodes (i.e. \"bad trips\") can cause lasting psychological trauma if not properly managed or treated afterward. This is particularly a concern in non-supervised settings or when heavy doses are used.\n\n\n                    Context: \n                    This excerpt discusses the potential psychological and behavioral hazards associated with psilocybin mushroom use, emphasizing that despite low toxicity and death risk, they can impair judgment, lead to dangerous delusions, and cause lasting psychological trauma during bad trips, especially in unsupervised or high-dose scenarios. It highlights the importance of harm reduction and awareness of psychological risks within the broader context of the substance's effects, risks, and safety information provided in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_46", "document_index": 98, "latency_s": 0.9110786999954144, "prompt_toks": 15657, "completion_toks": 71}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Finally, it should be noted that evidence of psilocybin mushrooms' effectiveness as a mental health treatment only applies to the controlled procedures used in clinical settings. They are not considered the entire treatment because the current evidence suggests they must be combined with professional psychotherapy to produce lasting effects.\n\nWithout the appropriate safeguards, attempts at self-medicating with psilocybin mushrooms may actually worsen mental health issues.[citation needed]\n\nIt is strongly advised to use harm reduction practices if using this substance. These include:\n\nTaking the substance under the supervision of a tripsitter for one's first time or while experimenting with a higher dose\n\nStarting off with a dose in the low-common range and monitoring for unusual reactions (e.g. mania, delusions) or sensitivity\n\n\n                    Context: \n                    This excerpt emphasizes that psilocybin mushrooms' therapeutic benefits are established only through controlled clinical procedures and should be combined with professional psychotherapy. It highlights the risks of self-medicating without safeguards and recommends harm reduction practices, such as supervised use and dose monitoring, within the broader discussion of safety, risks, and responsible use outlined in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_47", "document_index": 98, "latency_s": 0.6746452999941539, "prompt_toks": 15722, "completion_toks": 56}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Starting off with a dose in the low-common range and monitoring for unusual reactions (e.g. mania, delusions) or sensitivity\n\nNot exceeding the listed heavy dose. If heavy doses are required, a tolerance break is advised instead. Heavy doses greatly increase the risk of negative effects\n\nKeeping a supply of benzodiazepines or antipsychotics (e.g. Seroquel) to abort the trip in the case of overwhelming anxiety or psychosis\n\nLethal dosage\n\nThe toxicity of psilocybin and psilocin is extremely low. In rats, the median lethal dose (LD50) of psilocybin when administered orally is 280 milligrams per kilogram (mg/kg).\n\nPsilocybin comprises approximately 1% of the weight of Psilocybe cubensis and so nearly 1.7 kilograms (3.7 lb) of dried mushrooms or 17 kilograms (37 lb) of fresh mushrooms would be required for a 60 kilogram (130 lb) person to reach the 280 mg/kg LD50 value of rats.\n\n\n                    Context: \n                    This section discusses dosing precautions and toxicity information for psilocybin mushrooms. It advises starting with low doses, monitoring for adverse reactions, and avoiding excessive doses, emphasizing the low physiological toxicity of psilocybin, with data on estimated lethal dosage levels based on animal studies.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_48", "document_index": 98, "latency_s": 0.8841211999970255, "prompt_toks": 15674, "completion_toks": 65}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Based on the results of animal studies, the lethal dose of psilocybin has been extrapolated to be 6 grams, 1000 times greater than the effective dose of 6 milligrams. Unlike many highly prohibited substances, it is effectively impossible to physically overdose on.\n\nPsychosis and mental disorder risk\n\nPsilocybin mushrooms can exacerbate symptoms (e.g. delusions, mania, psychosis) of various mental disorders. Additionally, they can precipitate the early onset of schizophrenia in vulnerable individuals.[43]\n\nThose with a personal or family history of mental disorders, particularly psychotic disorders like schizophrenia, should not use psilocybin mushrooms without consulting a qualified medical professional.\n\nDependence and abuse potential\n\nLike other serotonergic psychedelics, psilocybin mushrooms have low abuse and no physical dependence potential.[44]\n\n\n                    Context: \n                    This excerpt discusses the toxicity, safety margins, and mental health risks of psilocybin mushrooms, highlighting their low lethal dose and the potential for exacerbating psychosis and mental disorders in vulnerable individuals. It also emphasizes their low dependence and abuse potential, providing critical harm reduction information within the comprehensive overview of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_49", "document_index": 98, "latency_s": 0.6791293999995105, "prompt_toks": 15669, "completion_toks": 63}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Dependence and abuse potential\n\nLike other serotonergic psychedelics, psilocybin mushrooms have low abuse and no physical dependence potential.[44]\n\nThere are no literature reports of successful attempts to train animals to self-administer a serotonergic psychedelic, which is predictive of abuse liability, indicating that it does not have the necessary pharmacology to either initiate or maintain dependence.[44]\n\nAdditionally, there is no human clinical evidence that psilocybin mushrooms causes addiction. Finally, there is virtually no withdrawal syndrome when chronic use of psilocybin mushrooms is stopped.\n\nTolerance to the effects of psilocybin builds almost immediately after ingestion. After that, it takes about 3 days for the tolerance to be reduced to half and 7 days to be back at baseline (in the absence of further consumption).\n\n\n                    Context: \n                    This section addresses the dependence and abuse potential of psilocybin mushrooms, emphasizing their low risk compared to other substances. It highlights the lack of evidence for addiction or withdrawal symptoms, noting rapid tolerance development and recovery, which underscores their relatively safe profile within the broader discussion of toxicity, legal status, and harm reduction.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_50", "document_index": 98, "latency_s": 0.8415174999972805, "prompt_toks": 15670, "completion_toks": 68}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybin exhibits cross-tolerance with all psychedelics, meaning that after the consumption of psilocybin all psychedelics will have a reduced effect.\n\nHallucinogen-perception persisting disorder (HPPD)\n\nFurther information: Hallucinogen persisting perception disorder\n\nIn rare cases, psilocybin mushrooms may trigger hallucinogen persisting perception disorder (HPPD) in some individuals.[45] The cause is unclear; however, explanations in terms of psilocybin physically remaining in the body for months or years after consumption have been discounted by experimental evidence.\n\nSome say HPPD is a manifestation of post-traumatic stress disorder, not related to the direct action on brain chemistry, and varies according to the susceptibility of the individual to the disorder.[46]\n\nDangerous interactions\n\n\n                    Context: \n                    This section covers key risks and interactions of psilocybin mushrooms, including their cross-tolerance with other psychedelics, the rare occurrence of Hallucinogen Persisting Perception Disorder (HPPD), and potential dangerous drug interactions. It provides essential information for understanding the psychological and physiological safety concerns associated with psilocybin use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_51", "document_index": 98, "latency_s": 0.7691766999923857, "prompt_toks": 15624, "completion_toks": 74}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Dangerous interactions\n\nWarning: Many psychoactive substances that are reasonably safe to use on their own can suddenly become dangerous and even life-threatening when combined with certain other substances. The following list provides some known dangerous interactions (although it is not guaranteed to include all of them).\n\nAlways conduct independent research (e.g. Google, DuckDuckGo, PubMed) to ensure that a combination of two or more substances is safe to consume. Some of the listed interactions have been sourced from TripSit.\n\nAmphetamines - Stimulants increase anxiety levels and the risk of thought loops which can lead to negative experiences\n\n\n                    Context: \n                    This section details dangerous interactions between psilocybin mushrooms and other psychoactive substances, emphasizing the increased risks and potential hazards when combining substances. It highlights the importance of independent research to ensure safe use and includes specific examples such as amphetamines, cannabis, and others. This information is crucial for harm reduction and understanding the risks of polydrug use with psychedelics.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_52", "document_index": 98, "latency_s": 1.3407750000042142, "prompt_toks": 15697, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Amphetamines - Stimulants increase anxiety levels and the risk of thought loops which can lead to negative experiences\n\nCannabis:[47] Cannabis can have an unexpectedly strong and unpredictable synergy with psilocybin mushrooms. While it is commonly used to intensify or prolong the mushrooms' effects, caution is highly advised as mixing these substances can significantly increase the risk of anxiety, paranoia, panic attacks, and psychosis. Anecdotal reports often describe the ingestion of cannabis as the triggering event for a bad trip or psychosis. Users are advised to start off with only a fraction (e.g. 1/4th - 1/3rd) of their typical cannabis dose and space out hits to avoid accidental over-intake.\n\nCocaine - Stimulants increase anxiety levels and the risk of thought loops which can lead to negative experiences\n\nTramadol - Tramadol is well known to lower seizure threshold and psychedelics also cause occasional seizures.\n\n\n                    Context: \n                    This excerpt discusses dangerous drug interactions with psilocybin mushrooms, highlighting how substances like amphetamines, cannabis, cocaine, tramadol, and others can increase psychological risks such as anxiety, paranoia, seizures, and psychosis when combined with psychedelics. It emphasizes the importance of harm reduction and cautious use, fitting into the broader section on toxicity, harm potential, and safe practices within the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_53", "document_index": 98, "latency_s": 0.8367131999984849, "prompt_toks": 15688, "completion_toks": 69}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Tramadol - Tramadol is well known to lower seizure threshold and psychedelics also cause occasional seizures.\n\nLithium - Lithium is commonly prescribed in the treatment of bipolar disorder; however, studies find it can significantly increase the risk of and seizures when combined to psychedelics. As a result, this combination should be strictly avoided.\n\nLegal status\n\nInternationally, psilocybin (but not psilocybin mushrooms) is a Schedule I drug under the Convention on Psychotropic Substances.\n\n\"The cultivation of plants from which psychotropic substances are obtained is not controlled by the Vienna Convention. . . . Neither the crown (fruit, mescal button) of the Peyote cactus nor the roots of the plant Mimosa hostilis nor Psilocybe mushrooms themselves are included in Schedule 1, but only their respective principals, mescaline, DMT, and psilocin.\"\n\n\n                    Context: \n                    This excerpt discusses dangerous drug interactions and legal classifications related to psilocybin mushrooms, highlighting the seizure risk associated with substances like tramadol and lithium, and providing an overview of their legal status under international agreements and national laws. It situates key harm reduction and legal considerations within the broader context of psilocybin’s pharmacology and regulation.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_54", "document_index": 98, "latency_s": 0.8104623999970499, "prompt_toks": 15609, "completion_toks": 78}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Austria: Psilocybin containing mushrooms are illegal to possess in dried form, to sell and to offer, give or get somebody under the SMG (Suchtmittelgesetz Österreich). It is illegal to grow them with the intention of \"producing psychotropic substances\" (as psilocin and psilocybin) mentioned in BGBl. III Nr. 148/1997 .[48]\n\nBahamas: Psilocybin mushrooms are legal to possess, grow, and consume.[citation needed]\n\n\n                    Context: \n                    This chunk provides specific legal information on the possession, cultivation, and sale of psilocybin mushrooms in Austria and the Bahamas. It details that while psilocybin mushrooms are illegal in Austria under national law, they are legal to possess and consume in the Bahamas. This legal status section is part of the comprehensive overview of psilocybin mushroom laws worldwide included in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_55", "document_index": 98, "latency_s": 0.7403064999962226, "prompt_toks": 15695, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Bahamas: Psilocybin mushrooms are legal to possess, grow, and consume.[citation needed]\n\nBrazil: Psilocybin Mushrooms derived psychoactive substances targeted for unjustified consumption are illegal to possess, store, transport, import, export, prescribe, administer, sell and advertise, regardless of no intent of profit and in any form. Cultivation of the former, however, only under the premise of \"botanical purposes\", or similar, is perfectly allowed due to legal gap in which Psilocybe mushrooms themselves are not explicitly listed as sources of potential psychotropic substances. Use of Psilocybin containing mushrooms within religious cults are constitucionally and internationally protected from antidrug policies and are, likewise, allowed.[49]\n\nBritish Virgin Isles: The sale of mushrooms is illegal, but possession and consumption is legal.[citation needed]\n\nBulgaria: The sale of mushrooms is illegal, but possession and consumption is legal.[citation needed]\n\n\n                    Context: \n                    This section details the legal status of psilocybin mushrooms in various countries, highlighting differences in possession, sale, and cultivation laws. It provides specific examples such as legality in Bahamas and restrictions in Brazil, including nuances like religious protections and cultivation allowances. These legal distinctions are crucial for understanding jurisdictional risks and harm reduction strategies associated with psilocybin mushroom use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_56", "document_index": 98, "latency_s": 1.1051101999910315, "prompt_toks": 15715, "completion_toks": 74}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Bulgaria: The sale of mushrooms is illegal, but possession and consumption is legal.[citation needed]\n\nBelgium: Possession and sale of mushrooms have been illegal since 1988.[citation needed]\n\nCanada: Psilocybin and psilocin are illegal to possess, obtain or produce without a prescription or license as they are Schedule III under the Controlled Drugs and Substances Act; however, dried psilocybin mushrooms are openly sold on dozens of Canadian websites. Spores and growing kits are legal to possess. [50]\n\nCzech Republic: The distribution (including sale) of mushrooms is illegal, but consumption is legal. The possession of over 40 hallucinogenic caps is considered a crime if they contain more than 50mg of psilocin or the corresponding amount of psilocybin. The possession of more than 40g of hallucinogenic mycelium is considered a crime. If these limits are not exceeded, the act is considered a minor offense and a fine of up to 15 thousand CZK may be imposed.\n\n\n                    Context: \n                    This excerpt summarizes the legal status of psilocybin mushroom possession, sale, and cultivation across various countries, highlighting specific regulations in Bulgaria, Belgium, Canada, and the Czech Republic. It provides detailed legal distinctions such as what is permissible or criminalized, including possession limits and sale restrictions, making it relevant for understanding international drug laws related to psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_57", "document_index": 98, "latency_s": 0.7626596000045538, "prompt_toks": 15701, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Cyprus: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nDenmark: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nFinland: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nGermany: Psilocybin is illegal to produce, possess or sale under Schedule I of the Narcotics Act (Anlage I BtMG)[51]. Consumption is not illegal. The mushroom and spores by itself are not illegal and only become illegal when containing Psilocybin or Psilocin.\n\nGreece: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nIreland: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nIceland: The sale of Psilocybin mushrooms is illegal, but possession and consumption is legal.\n\n\n                    Context: \n                    This section summarizes the legal status of psilocybin mushrooms in various countries, highlighting differences in laws regarding possession, sale, cultivation, and consumption. It provides specific examples such as Cyprus, Denmark, Finland, Germany, Greece, Ireland, and Iceland, noting where mushrooms are illegal or where only certain activities like possession or sale are prohibited, which is essential for understanding legal considerations covered in the broader document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_58", "document_index": 98, "latency_s": 1.190963400003966, "prompt_toks": 15717, "completion_toks": 89}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Ireland: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nIceland: The sale of Psilocybin mushrooms is illegal, but possession and consumption is legal.\n\nIndia: Psilocybin mushrooms are illegal to possess, grow, sale, and consume. However, it is reported that many police departments in undeveloped areas are unaware of the prohibition.\n\nJapan: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nLatvia: Hallucinogenic mushrooms, psilocin and psilocybin are Schedule I controlled substances.[52]\n\nLuxembourg: Psilocybin is a prohibited substance[53]\n\nMexico: The possession, growth, sale and consumption of mushrooms is illegal. Rules are relaxed regarding religious use however.[citation needed]\n\nThe Netherlands: The possession, growth, sale and consumption of mushrooms is illegal. However, due to a legal loophole, psilocybin truffles can be legally possessed, grown, sold and consumed.[citation needed]\n\n\n                    Context: \n                    This chunk provides specific details on the legal status of psilocybin mushrooms in various countries, highlighting their classification and restrictions. It is relevant for understanding international drug laws and regulatory differences, complementing the broader section on legal status within the full document. Key points include the illegal status in countries like Ireland, India, Japan, Mexico, and the Netherlands, with notable legal loopholes in places like Iceland, Latvia, Luxembourg, and the Netherlands.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_59", "document_index": 98, "latency_s": 0.7247821999917505, "prompt_toks": 15692, "completion_toks": 63}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    New Zealand: Psilocybin is a Class A substance.[citation needed]\n\nNorway: Possession, growth, sale and consumption of mushrooms is illegal. Spores, even though not containing psilocybin, are also illegal.[citation needed]\n\nSweden: Sveriges riksdag added psilocybin mushrooms to schedule I (\"substances, plant materials and fungi which normally do not have medical use\") as narcotics in Sweden as of Aug 1, 1999, published by Medical Products Agency.[54]\n\nSwitzerland: Mushrooms of the species Conocybe, Panaeolus, Psilocybe and Stropharia are controlled under Verzechnis D.[55]\n\nTurkey: The possession, growth, sale and consumption of mushrooms is illegal.[citation needed]\n\nUnited Kingdom: According to the 2005 Drugs Act, fresh and prepared psilocybin mushrooms are Class A.[56]\n\n\n                    Context: \n                    This section details the legal status of psilocybin mushrooms across various countries, highlighting restrictions or classifications in New Zealand, Norway, Sweden, Switzerland, Turkey, and the United Kingdom. It provides critical legal information relevant for users seeking harm reduction and compliance guidance before using or possessing psilocybin-containing fungi globally.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_60", "document_index": 98, "latency_s": 0.9966546000068774, "prompt_toks": 15739, "completion_toks": 90}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    United Kingdom: According to the 2005 Drugs Act, fresh and prepared psilocybin mushrooms are Class A.[56]\n\nUnited States: Psilocybin and psilocin are Schedule I drugs under the Controlled Substances Act of 1970. This means it is illegal to manufacture, buy, possess, process, or distribute without a license from the Drug Enforcement Administration (DEA).[57]. Several US states and cities have decriminalised Psilocybin mushrooms.\n\nOregon: Oregon Measure 109 legalized the use of Psilocybin mushrooms to licensed service providers administering to individuals 21 years of age or older.\n\nColorado: Colorado proposition 122 legalizes psychedelic plants and fungi for adults age 21 and older.\n\nItaly: Psilocybin is a schedule I drug (Tabella 1). [58]\n\nSee also\n\nResponsible use\n\nEntheogen\n\nPsychedelic\n\nTryptamine\n\nDMT\n\nLSD\n\nMescaline\n\nExternal links\n\nPsilocybin mushrooms (Wikipedia)\n\nMagic truffle (Wikipedia)\n\nLegal status of psilocybin mushrooms (Wikipedia)\n\nPsilocybin (Wikipedia)\n\n\n                    Context: \n                    This chunk provides an overview of the legal status of psilocybin mushrooms in various countries, including the UK, US, Oregon, Colorado, and Italy, highlighting their classification as controlled substances or decriminalized regions. It situates within the broader discussion of the drug's legal regulations and harm reduction, emphasizing international variations and recent legal developments. These details are crucial for understanding the legal landscape and safe use considerations of psilocybin mushrooms worldwide.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_61", "document_index": 98, "latency_s": 1.0475675000052433, "prompt_toks": 15787, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psychedelic\n\nTryptamine\n\nDMT\n\nLSD\n\nMescaline\n\nExternal links\n\nPsilocybin mushrooms (Wikipedia)\n\nMagic truffle (Wikipedia)\n\nLegal status of psilocybin mushrooms (Wikipedia)\n\nPsilocybin (Wikipedia)\n\nPsilocybin therapy (Wikipedia)\n\nPsilocybin mushrooms (Erowid Vault)\n\nWorld Wide Distribution of Magic Mushrooms\n\nEnteogenic Mushrooms - philosophy of cultivation\n\nDiscussion\n\nThe Big & Dandy Psilocybin Mushrooms Thread (Bluelight)\n\nPsilocybin mushrooms, broken down and described (Disregard Everything I Say)\n\nLiterature\n\nMcKenna, Terence; McKenna, Dennis (1976). Psilocybin: Magic Mushroom Grower's Guide. Under the pseudonyms OT Oss and ON Oeric. Berkeley, CA: And/Or Press. ISBN 978-0-915904-13-6.\n\nPsilocybe Mushrooms & Their Allies (1978), Homestead Book Company, Template:ISBN\n\nPassie, T., Seifert, J., Schneider, U., & Emrich, H. M. (2002). The pharmacology of psilocybin. Addiction Biology, 7(4), 357-364. doi: 10.1080/1355621021000005937\n\n\n                    Context: \n                    This section provides key external references, including Wikipedia links, online resources, cultivation guides, discussion forums, and scholarly literature related to psilocybin mushrooms. It supports the document's comprehensive coverage of psychedelic substances by offering additional sources for research, legal status, and scientific studies. These references are crucial for users seeking in-depth information, cultivation techniques, and authoritative literature on psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_62", "document_index": 98, "latency_s": 0.7033229999942705, "prompt_toks": 15806, "completion_toks": 54}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Passie, T., Seifert, J., Schneider, U., & Emrich, H. M. (2002). The pharmacology of psilocybin. Addiction Biology, 7(4), 357-364. doi: 10.1080/1355621021000005937\n\nTylš, F., Páleníček, T., & Horáček, J. (2014). Psilocybin–summary of knowledge and new perspectives. European Neuropsychopharmacology, 24(3), 342-356. doi: 10.1016/j.euroneuro.2013.12.006\n\nVollenweider, F. X., & Kometer, M. (2010). The neurobiology of psychedelic drugs: implications for the treatment of mood disorders. Nature Reviews Neuroscience, 11(9), 642-651. doi: 10.1038/nrn2884\n\nAgurell, S., & Nilsson, J. G. L. (1968). Biosynthesis of Psilocybin Part II*, Incorporation of Labelled Tryptamine Derivatives. Acta Chemica Scandainavica, 22(4). 1210-1218. https://pdfs.semanticscholar.org/a7b9/965618d632ff7de3a96fed11c9455b615d94.pdf\n\nReferences\n\n\n                    Context: \n                    This excerpt listing key scientific references supports the detailed discussion of psilocybin's pharmacology, neurobiology, and biosynthesis, providing foundational research citations within the broader overview of psilocybin mushrooms' effects, chemistry, and medical potential detailed in the full webpage.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_63", "document_index": 98, "latency_s": 1.0795015999901807, "prompt_toks": 15826, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    References\n\n↑ Pablo Mallaroni, Natasha L. Mason , Johannes T. Reckweg, Riccardo Paci, Sabrina Ritscher, Stefan W. Toennes, Eef L. Theunissen, Kim P.C. Kuypers, Johannes G. Ramaekers (May 2023). \"Assessment of the acute effects of 2C-B vs psilocybin on subjective experience, mood and cognition\". Clinical Pharmacology and Therapeutics. doi:10.1002/cpt.2958.\n\n↑ Guzmán, G., Allen, J. W., Gartz, J. (1998). \"A worldwide geographical distribution of the neurotropic fungi, an analysis and discussion\". Ann. Mus. Civ. Rovereto. 14: 189–280.\n\n↑ 3.0 3.1 3.2 3.3 3.4 3.5 Tylš, F., Páleníček, T., Horáček, J. (March 2014). \"Psilocybin – Summary of knowledge and new perspectives\". European Neuropsychopharmacology. 24 (3): 342–356. doi:10.1016/j.euroneuro.2013.12.006. ISSN 0924-977X.\n\n↑ Sessa, B. (2012). The psychedelic renaissance: reassassing the role of psychedelic drugs in 21st century psychiatry and society. Muswell Hill Press. ISBN 9781908995001.\n\n\n                    Context: \n                    This references section contains scholarly citations related to topics covered in the full document on psilocybin mushrooms, including their effects, distribution, and recent research findings. It supports key points in the article, such as geographic distribution, pharmacological summaries, and evolving scientific perspectives on psychedelic use. These references are essential for verifying the information and facilitating further research within the overall context of drug effects and history.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_64", "document_index": 98, "latency_s": 1.0142228000040632, "prompt_toks": 15846, "completion_toks": 78}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Sessa, B. (2012). The psychedelic renaissance: reassassing the role of psychedelic drugs in 21st century psychiatry and society. Muswell Hill Press. ISBN 9781908995001.\n\n↑ Lüscher, C., Ungless, M. A. (14 November 2006). \"The Mechanistic Classification of Addictive Drugs\". PLoS Medicine. 3 (11): e437. doi:10.1371/journal.pmed.0030437. ISSN 1549-1676.\n\n↑ Strassman, R. J. (October 1984). \"ADVERSE REACTIONS TO PSYCHEDELIC DRUGS. A REVIEW OF THE LITERATURE:\". The Journal of Nervous and Mental Disease. 172 (10): 577–595. doi:10.1097/00005053-198410000-00001. ISSN 0022-3018.\n\n↑ Samorini, G. (1992). \"The oldest representations of hallucinogenic mushrooms in the world (Sahara Desert, 9000-7000 BP)\". Integration. 2 (3): 69–78.\n\n↑ Akers, B. P., Ruiz, J. F., Piper, A., Ruck, C. A. P. (June 2011). \"A Prehistoric Mural in Spain Depicting Neurotropic Psilocybe Mushrooms?\". Economic Botany. 65 (2): 121–128. doi:10.1007/s12231-011-9152-5. ISSN 0013-0001.\n\n\n                    Context: \n                    This excerpt cites scholarly references related to the historical, cultural, and adverse effects of psilocybin mushrooms, supporting their ancient use, impact on addiction, and potential negative reactions. It is relevant for understanding the biological, anthropological, and safety aspects discussed within the broader context of the full document on psilocybin mushrooms. These references enhance the credibility and detail of the information provided.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_65", "document_index": 98, "latency_s": 0.7778436000080546, "prompt_toks": 15764, "completion_toks": 78}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Hofmann, A. (1980). \"The Mexican relatives of LSD\". LSD, my problem child. McGraw-Hill. ISBN 9780070293250.\n\n↑ Wasson, R. G. (1957). \"Seeking the Magic Mushroom\". Life. 42 (19): 100–120. ISSN 0024-3019.\n\n↑ Heim, R. (1957). \"Notes préliminaires sur les agarics hallucinogènes du Mexique (Preliminary notes on the hallucination-producing agarics of Mexico)\". Revue de Mycologie (in French). 22 (1): 58–79.\n\n↑ Hofmann, A., Heim, R., Brack, A., Kobel, H. (March 1958). \"Psilocybin, ein psychotroper Wirkstoff aus dem mexikanischen Rauschpilz Psilocybe mexicana Heim (Psilocybin, a psychotropic drug from the Mexican magic mushroom Psilocybe mexicana Heim)\". Experientia (in German). 14 (3): 107–109. doi:10.1007/BF02159243. ISSN 0014-4754.\n\n\n                    Context: \n                    This citation-rich snippet references early scientific and historical research on psilocybin mushrooms, including key studies by Hofmann, Wasson, and Heim from the 1950s and 1980s. It provides foundational sources on the discovery, chemical analysis, and ethnomycological studies of psychedelic fungi, relevant for understanding the historical context and scientific background presented in the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_66", "document_index": 98, "latency_s": 0.7978917000000365, "prompt_toks": 15788, "completion_toks": 57}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Hofmann, A., Heim, R., Brack, A., Kobel, H., Frey, A., Ott, H., Petrzilka, Th., Troxler, F. (1959). \"Psilocybin und Psilocin, zwei psychotrope Wirkstoffe aus mexikanischen Rauschpilzen (Psilocybin and psilocin, two psychotropic substances in Mexican magic mushrooms)\". Helvetica Chimica Acta (in German). 42 (5): 1557–1572. doi:10.1002/hlca.19590420518. ISSN 0018-019X.\n\n↑ Marley, G. (9 September 2010). \"Psilocybin: gateway to the soul or just a good high?\". Chanterelle Dreams, Amanita Nightmares: The Love, Lore, and Mystique of Mushrooms. Chelsea Green Publishing. p. 166. ISBN 9781603582803.\n\n↑ Passie, T., Seifert, J., Schneider, U., Emrich, H. M. (October 2002). \"The pharmacology of psilocybin\". Addiction Biology. 7 (4): 357–364. doi:10.1080/1355621021000005937. ISSN 1355-6215.\n\n\n                    Context: \n                    This chunk includes key scholarly references on psilocybin's chemical properties and historical research, including early studies by Hofmann et al. and reviews of its pharmacology, which support the scientific foundation of the full webpage on psilocybin mushrooms' chemistry, effects, and history.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_67", "document_index": 98, "latency_s": 0.9807241999951657, "prompt_toks": 15826, "completion_toks": 75}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Passie, T., Seifert, J., Schneider, U., Emrich, H. M. (October 2002). \"The pharmacology of psilocybin\". Addiction Biology. 7 (4): 357–364. doi:10.1080/1355621021000005937. ISSN 1355-6215.\n\n↑ Leary, T., Litwin, G. H., Metzner, R. (December 1963). \"REACTIONS TO PSILOCYBJN ADMINISTERED IN A SUPPORTIVE ENVIRONMENT:\". The Journal of Nervous and Mental Disease. 137 (6): 561–573. doi:10.1097/00005053-196312000-00007. ISSN 0022-3018.\n\n↑ Timothy, L., Ralph, M., Madison, P., Gunther, W., Ralph, S., Sara, K. (1965). \"A new behavior change program using psilocybin\". Psychotherapy: Theory, Research & Practice. 2 (2): 61–72. doi:10.1037/h0088612. ISSN 0033-3204. .\n\n↑ Matsushima, Y., Eguchi, F., Kikukawa, T., Matsuda, T. (2009). \"Historical overview of psychoactive mushrooms\". Inflammation and Regeneration. 29 (1): 47–58. doi:10.2492/inflammregen.29.47. ISSN 1880-9693.\n\n\n                    Context: \n                    This chunk lists key academic references related to the pharmacology, historical use, and research of psilocybin mushrooms, supporting the detailed information provided in the full document. These sources include foundational studies on psilocybin's effects, historical overviews, and behavioral research, making it essential for validating and further exploring the scientific and cultural context of psilocybin use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_68", "document_index": 98, "latency_s": 1.0873821999994107, "prompt_toks": 15707, "completion_toks": 84}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Griffiths, R. R., Grob, C. S. (December 2010). \"Hallucinogens as Medicine\". Scientific American. 303 (6): 76–79. doi:10.1038/scientificamerican1210-76. ISSN 0036-8733.\n\n↑ Studerus, E., Kometer, M., Hasler, F., Vollenweider, F. X. (November 2011). \"Acute, subacute and long-term subjective effects of psilocybin in healthy humans: a pooled analysis of experimental studies\". Journal of Psychopharmacology. 25 (11): 1434–1452. doi:10.1177/0269881110382466. ISSN 0269-8811.\n\n↑ Keim, B. (1 July 2008). \"Psilocybin study hints at rebirth of hallucinogen research\". Wired. Retrieved 8 August 2011.\n\n\n                    Context: \n                    This excerpt provides key references to scientific studies and articles that support the therapeutic potential and effects of psilocybin and hallucinogens. It includes citations from notable sources such as Scientific American and the Journal of Psychopharmacology, highlighting research on medicinal uses, subjective effects, and the revival of hallucinogen research, and is relevant to the sections discussing the scientific understanding and ongoing research of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_69", "document_index": 98, "latency_s": 1.1441121000098065, "prompt_toks": 15822, "completion_toks": 86}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Keim, B. (1 July 2008). \"Psilocybin study hints at rebirth of hallucinogen research\". Wired. Retrieved 8 August 2011.\n\n↑ 22.0 22.1 Dos Santos, RG; Osório, FL; Crippa, JA; Riba, J; Zuardi, AW; Hallak, JE (June 2016). \"Antidepressive, anxiolytic, and antiaddictive effects of ayahuasca, psilocybin and lysergic acid diethylamide (LSD): a systematic review of clinical trials published in the last 25 years\". Therapeutic advances in psychopharmacology. 6 (3): 193–213. doi:10.1177/2045125316638008. PMC 4910400 . PMID 27354908. CS1 maint: PMC format (link)\n\n↑ Vargas, MV; Meyer, R; Avanes, AA; Rus, M; Olson, DE (2021). \"Psychedelics and Other Psychoplastogens for Treating Mental Illness\". Frontiers in psychiatry. 12: 727117. doi:10.3389/fpsyt.2021.727117. PMC 8520991 Check |pmc= value (help). PMID 34671279.\n\n↑ Gilbert, J., Senyuva, H. (2009). Bioactive Compounds in Foods. John Wiley & Sons. ISBN 9781444302295.\n\n\n                    Context: \n                    This chunk includes references to scientific research on psilocybin and related psychedelics, highlighting their potential therapeutic effects such as antidepressant, anxiolytic, and antiaddictive properties, as well as their role as psychoplastogens. It supports the document's emphasis on the evolving scientific understanding and medical relevance of psilocybin mushrooms, enriching the overall information on their effects, research, and harm potential.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_70", "document_index": 98, "latency_s": 0.7778461999987485, "prompt_toks": 15821, "completion_toks": 78}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Gilbert, J., Senyuva, H. (2009). Bioactive Compounds in Foods. John Wiley & Sons. ISBN 9781444302295.\n\n↑ Horita, A., Weber, L. J. (1 January 1961). \"Dephosphorylation of Psilocybin to Psilocin by Alkaline Phosphatase\". Experimental Biology and Medicine. 106 (1): 32–34. doi:10.3181/00379727-106-26228. ISSN 1535-3702.\n\n↑ Anastos, N., Barnett, N. W., Pfeffer, F. M., Lewis, S. W. (April 2006). \"Investigation into the temporal stability of aqueous standard solutions of psilocin and psilocybin using high performance liquid chromatography\". Science & Justice. 46 (2): 91–96. doi:10.1016/S1355-0306(06)71579-9. ISSN 1355-0306.\n\n↑ Petri, G., Expert, P., Turkheimer, F., Carhart-Harris, R., Nutt, D., Hellyer, P. J., Vaccarino, F. (6 December 2014). \"Homological scaffolds of brain functional networks\". Journal of The Royal Society Interface. 11 (101): 20140873. doi:10.1098/rsif.2014.0873. ISSN 1742-5689.\n\n\n                    Context: \n                    This section provides detailed scientific references related to psilocybin and psilocin, focusing on their bioactive compounds, biochemical processes like dephosphorylation, analytical stability studies, and neural network research. These references underpin the pharmacological and neurobiological aspects discussed in the broader document about psilocybin mushrooms, supporting understanding of their chemistry, stability, and brain effects.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_71", "document_index": 98, "latency_s": 0.6972980999998981, "prompt_toks": 15793, "completion_toks": 57}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Jerome, L. (2007), Psilocybin Investigator’s Brochure (PDF), Multidisciplinary Association for Psychedelic Studies (MAPS).\n\n↑ Johnson, M. W., Garcia-Romeu, A., Cosimano, M. P., Griffiths, R. R. (November 2014). \"Pilot study of the 5-HT 2A R agonist psilocybin in the treatment of tobacco addiction\". Journal of Psychopharmacology. 28 (11): 983–992. doi:10.1177/0269881114548296. ISSN 0269-8811.\n\n↑ Armstrong, B. D., Paik, E., Chhith, S., Lelievre, V., Waschek, J. A., Howard, S. G. (September 2004). \"Potentiation of (DL)-3,4-methylenedioxymethamphetamine (MDMA)-induced toxicity by the serotonin 2A receptior partial agonist d-lysergic acid diethylamide (LSD), and the protection of same by the serotonin 2A/2C receptor antagonist MDL 11,939\". Neuroscience Research Communications. 35 (2): 83–95. doi:10.1002/nrc.20023. ISSN 0893-6609.\n\n\n                    Context: \n                    This chunk contains references to scientific studies on psilocybin, including research on its therapeutic potential for addiction, toxicity, and receptor interactions. These citations support key pharmacological and clinical information in the document, emphasizing evidence-based findings related to psilocybin’s effects and safety profile.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_72", "document_index": 98, "latency_s": 1.0307319999992615, "prompt_toks": 15847, "completion_toks": 74}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Gudelsky, G. A., Yamamoto, B. K., Frank Nash, J. (November 1994). \"Potentiation of 3,4-methylenedioxymethamphetamine-induced dopamine release and serotonin neurotoxicity by 5-HT2 receptor agonists\". European Journal of Pharmacology. 264 (3): 325–330. doi:10.1016/0014-2999(94)90669-6. ISSN 0014-2999.\n\n↑ Capela, J. P., Fernandes, E., Remião, F., Bastos, M. L., Meisel, A., Carvalho, F. (July 2007). \"Ecstasy induces apoptosis via 5-HT(2A)-receptor stimulation in cortical neurons\". Neurotoxicology. 28 (4): 868–875. doi:10.1016/j.neuro.2007.04.005. ISSN 0161-813X.\n\n↑ https://www.sciencedirect.com/topics/immunology-and-microbiology/psilocybin\n\n↑ Gartz, J., Allen, J. W., Merlin, M. D. (July 1994). \"Ethnomycology, biochemistry, and cultivation of Psilocybe samuiensis Guzmán, Bandala and Allen, a new psychoactive fungus from Koh Samui, Thailand\". Journal of Ethnopharmacology. 43 (2): 73–80. doi:10.1016/0378-8741(94)90006-X. ISSN 0378-8741.\n\n\n                    Context: \n                    This selected excerpt provides important scientific references and research studies related to psilocybin and its interaction with other substances, as well as ethnomycological findings on psychoactive mushrooms. It enhances the credibility and depth of the broader article by citing key pharmacological and ethnobotanical research, supporting the discussion on psilocybin’s effects, chemistry, and natural occurrence.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_73", "document_index": 98, "latency_s": 1.0376637000008486, "prompt_toks": 15771, "completion_toks": 51}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Grob, C. S., Danforth, A. L., Chopra, G. S., Hagerty, M., McKay, C. R., Halberstadt, A. L., Greer, G. R. (3 January 2011). \"Pilot Study of Psilocybin Treatment for Anxiety in Patients With Advanced-Stage Cancer\". Archives of General Psychiatry. 68 (1): 71. doi:10.1001/archgenpsychiatry.2010.116. ISSN 0003-990X.\n\n↑ Carhart-Harris, R. L., Bolstridge, M., Rucker, J., Day, C. M. J., Erritzoe, D., Kaelen, M., Bloomfield, M., Rickard, J. A., Forbes, B., Feilding, A., Taylor, D., Pilling, S., Curran, V. H., Nutt, D. J. (July 2016). \"Psilocybin with psychological support for treatment-resistant depression: an open-label feasibility study\". The Lancet Psychiatry. 3 (7): 619–627. doi:10.1016/S2215-0366(16)30065-7. ISSN 2215-0366.\n\n\n                    Context: \n                    This chunk cites key scientific studies on psilocybin’s therapeutic potential, including research on its use for anxiety in cancer patients and treatment-resistant depression, highlighting the substance’s ongoing clinical investigation within the broader discussion of psilocybin mushrooms and their effects.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_74", "document_index": 98, "latency_s": 0.8071463999949628, "prompt_toks": 15772, "completion_toks": 69}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ 37.0 37.1 Carhart-Harris, R. L., Erritzoe, D., Williams, T., Stone, J. M., Reed, L. J., Colasanti, A., Tyacke, R. J., Leech, R., Malizia, A. L., Murphy, K., Hobden, P., Evans, J., Feilding, A., Wise, R. G., Nutt, D. J. (7 February 2012). \"Neural correlates of the psychedelic state as determined by fMRI studies with psilocybin\". Proceedings of the National Academy of Sciences. 109 (6): 2138–2143. doi:10.1073/pnas.1119598109. ISSN 0027-8424.\n\n↑ Farb, N. A. S., Anderson, A. K., Bloch, R. T., Segal, Z. V. (August 2011). \"Mood-Linked Responses in Medial Prefrontal Cortex Predict Relapse in Patients with Recurrent Unipolar Depression\". Biological Psychiatry. 70 (4): 366–372. doi:10.1016/j.biopsych.2011.03.009. ISSN 0006-3223.\n\n\n                    Context: \n                    This section presents key scientific studies on the neural and psychological effects of psilocybin, including fMRI research on brain connectivity and responses in depression. It provides empirical evidence supporting the neurobiological and mood-related mechanisms underlying psilocybin's therapeutic potential, making it highly relevant for understanding its clinical applications and effects described in the broader document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_75", "document_index": 98, "latency_s": 0.6612534000014421, "prompt_toks": 15872, "completion_toks": 49}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Bhagwagar, Z., Hinz, R., Taylor, M., Fancy, S., Cowen, P., Grasby, P. (September 2006). \"Increased 5-HT 2A Receptor Binding in Euthymic, Medication-Free Patients Recovered From Depression: A Positron Emission Study With [ 11 C]MDL 100,907\". American Journal of Psychiatry. 163 (9): 1580–1587. doi:10.1176/ajp.2006.163.9.1580. ISSN 0002-953X.\n\n↑ Meyer, J. H., McMain, S., Kennedy, S. H., Korman, L., Brown, G. M., DaSilva, J. N., Wilson, A. A., Blak, T., Eynan-Harvey, R., Goulding, V. S., Houle, S., Links, P. (January 2003). \"Dysfunctional Attitudes and 5-HT2 Receptors During Depression and Self-Harm\". American Journal of Psychiatry. 160 (1): 90–99. doi:10.1176/appi.ajp.160.1.90. ISSN 0002-953X.\n\n↑ Nutt DJ, King LA, Phillips LD (November 2010). \"Drug harms in the UK: a multicriteria decision analysis\". Lancet. 376 (9752): 1558–1565. CiteSeerX 10.1.1.690.1283 . doi:10.1016/S0140-6736(10)61462-6. PMID 21036393. Unknown parameter |s2cid= ignored (help)\n\n\n                    Context: \n                    This chunk contains references to scientific studies on serotonin receptor activity, depression, and drug harm assessments, providing evidence-based citations that support sections on the pharmacology, psychological effects, and safety profile of psilocybin mushrooms discussed earlier in the document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_76", "document_index": 98, "latency_s": 0.8067287000012584, "prompt_toks": 15893, "completion_toks": 80}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Nutt, D., King, L. A., Saulsbury, W., Blakemore, C. (24 March 2007). \"Development of a rational scale to assess the harm of drugs of potential misuse\". The Lancet. 369 (9566): 1047–1053. doi:10.1016/S0140-6736(07)60464-4. ISSN 0140-6736.\n\n↑ 43.0 43.1 43.2 Nichols, David E. (2004). \"Hallucinogens\". Pharmacology & Therapeutics. 101 (2): 131–181. doi:10.1016/j.pharmthera.2003.11.002. eISSN 1879-016X. ISSN 0163-7258. OCLC 04981366.\n\n↑ 44.0 44.1 Johnson, M. W., Griffiths, R. R., Hendricks, P. S., Henningfield, J. E. (November 2018). \"The abuse potential of medical psilocybin according to the 8 factors of the Controlled Substances Act\". Neuropharmacology. 142: 143–166. doi:10.1016/j.neuropharm.2018.05.012. ISSN 0028-3908.\n\n↑ Halpern, J. H.; Pope Jr, H. G. (2003). \"Hallucinogen persisting perception disorder: what do we know after 50 years?\" (PDF). Drug and Alcohol Dependence. 69 (2): 109–119. doi:10.1016/S0376-8716(02)00306-X. ISSN 0376-8716. PMID 12609692.\n\n↑ Lysergic acid diethylamide\n\n\n                    Context: \n                    This chunk includes key references and studies on the harm assessment and abuse potential of psilocybin and other hallucinogens, situating the document's discussions on toxicity, safety, and legal status within authoritative scientific and regulatory research. It highlights scholarly sources that evaluate drug harm scales, pharmacological reviews, and the long-term effects of hallucinogen use, emphasizing the scientific foundation of the information provided.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_77", "document_index": 98, "latency_s": 0.8674148999998579, "prompt_toks": 15806, "completion_toks": 76}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Lysergic acid diethylamide\n\n↑ TripSit Factsheets - Mushrooms\n\n↑ Unternehmensberatung, A., § 27 SMG (Suchtmittelgesetz), Unerlaubter Umgang mit Suchtgiften - JUSLINE Österreich\n\n↑ All acording to articles (artigos) 2 and 33, Lei nº 11.343 of 23/8/2006, referring to numbers 160 and 161 of chart F2 (lista F2) of the Portaria SVS/MS nº 344 of 12/5/1998, last amended by Resolução de Diretoria Colegiada - RDC nº 835 of 13/12/2023, as of 29/2/2024.\n\n↑ Branch, L. S. (2022), Consolidated federal laws of Canada, Controlled Drugs and Substances Act\n\n↑ Anlage I BtMG - Einzelnorm\n\n↑ Zaudējis spēku - Noteikumi par Latvijā kontrolējamajām narkotiskajām vielām, psihotropajām vielām un prekursoriem\n\n↑ Legilux\n\n↑ \"Sidan kunde inte visas (#404) - Läkemedelsverket\". 25 September 2013. Archived from the original on 25 September 2013.\n\n\n                    Context: \n                    This chunk provides detailed references related to the legal status and regulations of psilocybin mushrooms across various countries, including Austria, Canada, Latvia, and others. It includes legal citations, regulatory articles, and official sources, emphasizing the legal nuances, restrictions, and classifications pertinent to psilocybin-containing fungi, and complements the broader discussion of legal considerations within the full document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "num_chunks": 79, "chunk_id": "98::chunk_78", "document_index": 98, "latency_s": 1.1198950999969384, "prompt_toks": 15712, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Legilux\n\n↑ \"Sidan kunde inte visas (#404) - Läkemedelsverket\". 25 September 2013. Archived from the original on 25 September 2013.\n\n↑ \"Verordnung des EDI über die Verzeichnisse der Betäubungsmittel, psychotropen Stoffe, Vorläuferstoffe und Hilfschemikalien\" (in German). Bundeskanzlei [Federal Chancellery of Switzerland]. Retrieved January 1, 2020.\n\n↑ Participation, E., Drugs Act 2005\n\n↑ FDA - Controlled Substances Act, 2017\n\n↑ LEGGE 16 maggio 2014, n. 79 https://www.gazzettaufficiale.it/eli/id/2014/05/20/14G00090/sg\n\nRetrieved from ‘https://psychonautwiki.org/w/index.php?title=Psilocybin_mushrooms&oldid=162645’\n\n\n                    Context: \n                    This chunk includes references to legal and regulatory sources related to psilocybin mushrooms, such as Swiss, Swedish, and international drug laws, as well as official regulatory agencies' documents. It provides legal context and is essential for understanding the legal status and regulations discussed throughout the full guide on psilocybin mushrooms. Its relevance lies in supporting legal considerations and harm reduction information within the overall document.\n                "}
