{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_0", "document_index": 98, "latency_s": 31.082961899985094, "prompt_toks": 15538, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybin mushrooms\n\n(Redirected from Psilocybin)\n\nDialog-warning.svg.png\n\nExercise caution when consuming wild psilocybin mushrooms.\n\nIf consuming mushrooms harvested in nature, it is important to understand the risk of mistakenly consuming a poisonous (potentially fatal) look-alike variety.\n\nPlease see this section for more information.\n\nSummary sheet: Psilocybin mushrooms\n\n\n                    Context: \n                    This introductory section serves as a warning about the dangers of misidentifying wild psilocybin mushrooms, highlighting the risk of consuming poisonous lookalike species. It precedes the document's summary sheet and is part of broader safety and harm reduction information presented at the start of a comprehensive overview of psilocybin mushrooms, their effects, risks, and usage.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_1", "document_index": 98, "latency_s": 30.49710659997072, "prompt_toks": 15734, "completion_toks": 71}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybin mushrooms  Purpose  Chemical Nomenclature Common names Psilocybin, Psilocybin mushrooms, Magic Mushrooms, Shrooms, 4-PO-DMT Substitutive name 4-Phosphoryloxy-N,N-dimethyltryptamine Systematic name 3-[2-(Dimethylamino)ethyl]-1H-indol-4-ol Class Membership Psychoactive class Psychedelic Chemical class Tryptamine Routes of Administration WARNING: Always start with lower doses due to differences between individual body weight, tolerance, metabolism, and personal sensitivity. See responsible use section . ⇣ Oral Dosage Threshold 2.5 mg Psilocybin Light 2.5 - 10 mg Psilocybin Common 10 - 25 mg Psilocybin Strong 25 - 50 mg Psilocybin Heavy 50 mg Psilocybin + Duration Total 6 - 8 hours Onset 20 - 45 minutes Come up 1 - 1.5 hours Peak 2 - 2.5 hours [1] Offset 2.5 - 3.5 hours After effects 4 - 24 hours DISCLAIMER : PW's dosage information is gathered from users and resources for educational purposes only. It is not a recommendation and should be verified with other sources for\n\n\n                    Context: \n                    This chunk is from the summary infobox at the beginning of the psilocybin mushrooms page, providing quick reference chemical names, common aliases, drug classification, administration methods, dosage guidelines, duration, onset, and safety warnings. It serves as an overview before the main, detailed sections on effects, pharmacology, history, preparation, and legal status.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_2", "document_index": 98, "latency_s": 32.97901549999369, "prompt_toks": 15514, "completion_toks": 67}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    effects 4 - 24 hours DISCLAIMER : PW's dosage information is gathered from users and resources for educational purposes only. It is not a recommendation and should be verified with other sources for accuracy. Interactions Cannabis Amphetamines Cocaine Tramadol Lithium\n\n\n                    Context: \n                    This chunk appears within the dosage and duration summary in the introductory infobox for psilocybin mushrooms, outlining the typical after-effects timeframe (4–24 hours), a disclaimer regarding the informational nature of dosage data, and lists common drug interactions, immediately following dosage guidelines and preceding the main article content on effects, risks, and interactions.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_3", "document_index": 98, "latency_s": 30.21894659998361, "prompt_toks": 15608, "completion_toks": 72}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybe cubensis, one of the most common psilocybin-containing mushrooms.\n\nPsilocybin mushrooms (also known as magic mushrooms, psychedelic mushrooms, and shrooms) are a family of psychoactive fungi that contain psilocybin, a psychedelic substance of the tryptamine class. The mechanism of action is not fully known, although binding activity at serotonin receptors is thought to be involved.\n\nPsilocybin mushrooms occur on all continents and have been taxonomically classified into over 200 species, the most potent of which belong to the genus Psilocybe.[2] Based on imagery found in prehistoric rock art, they are thought to have been used by various human cultures since before recorded history.\n\n\n                    Context: \n                    This passage introduces psilocybin mushrooms, highlighting their psychoactive properties, the central role of the compound psilocybin, their uncertain mechanism of action, global distribution, taxonomic diversity, and evidence of ancient human use—serving as an overview before the document expands into detailed sections on history, chemistry, effects, harm reduction, and legal status.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_4", "document_index": 98, "latency_s": 32.622933500038926, "prompt_toks": 15596, "completion_toks": 71}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    After being introduced to the Western world in the 1950s, they generated substantial public interest.[3] Along with LSD, they were incorporated into the youth counterculture movement of the 1960s. Widespread usage of psychedelics provoked a societal backlash, and they were prohibited in 1970.[citation needed]\n\nToday, they are among the most widely used psychedelic substances (partly due to the ease of personal cultivation and harvesting). As a part of the so-called \"psychedelic renaissance\",[4] they are currently being investigated in the treatment of a number of ailments including anxiety, depression, addiction, and other mental disorders.[3]\n\n\n                    Context: \n                    This passage appears in the introductory section of the Psilocybin mushrooms page, summarizing their historical journey from their introduction to Western culture in the 1950s, their role in the 1960s counterculture, resulting prohibition, and their modern resurgence both in recreational use and clinical research as part of the \"psychedelic renaissance.\"\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_5", "document_index": 98, "latency_s": 27.989033100020606, "prompt_toks": 15645, "completion_toks": 47}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Subjective effects include visual geometry, hallucinatory states, time distortion, enhanced introspection, conceptual thinking, euphoria, and ego loss. The intensity and duration of effects can vary greatly depending on factors such as species and batch, which can complicate standardized dosing information (see this section). They are often described to evoke entheogenic, mystical-like, or transpersonal experiences that may facilitate self-reflection and personal growth.\n\nIn distinction to psychedelics like LSD, mescaline, and 2C-B, which may be described as \"stimulating\", \"cerebral\", and \"bright\", psilocybin mushrooms are typically described as having an \"earthy\", \"subliminal\", or \"dream-like\" quality. They also are reported to produce slightly more emotion enhancement, time distortion and ego loss than the aforementioned substances, as well as more nausea, confusion, and sedation.\n\n\n                    Context: \n                    This excerpt is from the introductory overview section of the psilocybin mushrooms page, specifically describing the typical subjective effects, qualitative differences from other psychedelics, and challenges in standardizing dosing due to variability between species and batches.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_6", "document_index": 98, "latency_s": 31.852023800020106, "prompt_toks": 15721, "completion_toks": 92}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Unlike most highly prohibited substances, psilocybin mushrooms have low abuse potential and are neither addictive nor physiologically toxic.[5] However, adverse psychological reactions such as severe anxiety, paranoia, delusions and psychosis are always possible, particularly among individuals predisposed to mental disorders.[6]\n\nIt is highly advised to use harm reduction practices if using this substance.\n\nContents\n\n1 History and culture\n\n1.1 Common names\n\n1.2 Research\n\n1.2.1 Neurogenesis\n\n1.2.2 Psychoplastogen\n\n2 Chemistry\n\n3 Pharmacology\n\n4 Subjective effects\n\n4.1 Physical effects\n\n4.2 Visual effects\n\n4.2.1 Enhancements\n\n4.2.2 Distortions\n\n4.2.3 Geometry\n\n4.2.4 Hallucinatory states\n\n4.3 Cognitive effects\n\n4.4 Auditory effects\n\n4.5 Multi-sensory effects\n\n4.6 Transpersonal effects\n\n4.7 Combination effects\n\n4.8 Experience reports\n\n5 Dosage and preparation\n\n5.1 Psilocybin\n\n5.1.1 Dosage calculation\n\n5.1.2 Psilocybe cubensis\n\n5.2 Preparation methods\n\n6 Natural occurrence\n\n6.1 Psilocybe\n\n\n                    Context: \n                    This chunk appears at the end of the introductory overview about psilocybin mushrooms, immediately after summarizing their pharmacological risk profile and prior to the main section headings (\"Contents\") that outline the document structure. It highlights their low abuse potential and lack of physiological toxicity, but cautions about possible psychological risks and recommends harm reduction. This situates it as a transition from the introduction to the comprehensive, sectioned exploration of psilocybin mushrooms that follows.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_7", "document_index": 98, "latency_s": 32.47695849998854, "prompt_toks": 15713, "completion_toks": 47}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    4.8 Experience reports\n\n5 Dosage and preparation\n\n5.1 Psilocybin\n\n5.1.1 Dosage calculation\n\n5.1.2 Psilocybe cubensis\n\n5.2 Preparation methods\n\n6 Natural occurrence\n\n6.1 Psilocybe\n\n6.2 Panaeolus\n\n6.3 Gymnopilus\n\n6.4 Dictyonema\n\n6.5 Risk of species confusion\n\n7 Research\n\n7.1 Antidepressant effects\n\n8 Toxicity and harm potential\n\n8.1 Lethal dosage\n\n8.2 Psychosis and mental disorder risk\n\n8.3 Dependence and abuse potential\n\n8.4 Hallucinogen-perception persisting disorder (HPPD)\n\n8.5 Dangerous interactions\n\n9 Legal status\n\n10 See also\n\n11 External links\n\n11.1 Discussion\n\n12 Literature\n\n13 References\n\nHistory and culture\n\nCave art in Tassili n'Ajjer, Algeria (look at the shoulders and knees)\n\nA growing body of evidence suggests that psychoactive mushrooms have been used by humans in religious ceremonies for thousands of years. In Mesoamerica, they have been consumed in ritual ceremonies for 3000 years.[3]\n\n\n                    Context: \n                    This chunk comprises the table of contents for the Psilocybin mushrooms article, immediately followed by the beginning of the \"History and culture\" section, which outlines evidence of the use of psychoactive mushrooms in ancient religious and ritual contexts.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_8", "document_index": 98, "latency_s": 29.504263600043487, "prompt_toks": 15617, "completion_toks": 80}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    For example, murals dated 9000 to 7000 BCE found in the Sahara desert in southeast Algeria depict horned beings dressed as dancers holding mushroom-like objects.[7] 6,000-year-old pictographs discovered near the Spanish town of Villar del Humo illustrate several mushrooms that have been tentatively identified as Psilocybe hispanica, a hallucinogenic species native to the area.[8]\n\nArchaeological artifacts from Mexico have also been interpreted by some scholars as evidence for ritual and ceremonial usage of psychoactive mushrooms in the Mayan and Aztec cultures of Mesoamerica.[citation needed] In Nahuatl, the language of the Aztecs, the mushrooms were called teonanácatl, or \"God's flesh\".\n\n\n                    Context: \n                    This passage appears in the \"History and culture\" section of the psilocybin mushrooms article, providing archaeological and ethnographic evidence of ancient and pre-Columbian use of psychoactive mushrooms in ritual and ceremonial contexts across different regions, including prehistoric North Africa, Spain, and Mesoamerica, and references the term \"teonanácatl\" used by the Aztecs.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_9", "document_index": 98, "latency_s": 31.82231319998391, "prompt_toks": 15582, "completion_toks": 69}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Following the arrival of Spanish explorers to the New World in the 16th century, chroniclers reported the use of mushrooms by the natives for ceremonial and religious purposes. Accounts describe mushrooms being eaten in festivities for the accession of emperors and the celebration of successful business trips by merchants.[9]\n\nAfter the defeat of the Aztecs, the Spanish forbade traditional religious practices and rituals that they considered \"pagan idolatry\", including ceremonial mushroom use. For the next four centuries, the Indians of Mesoamerica hid their use of entheogens from the Spanish authorities.[citation needed]\n\n\n                    Context: \n                    This excerpt appears in the \"History and culture\" section, specifically discussing the early colonial period in Mesoamerica and the suppression of indigenous ceremonial psilocybin mushroom use by Spanish conquerors. It follows earlier coverage of prehistoric and pre-Columbian traditions and precedes modern rediscovery and scientific study of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_10", "document_index": 98, "latency_s": 31.75696650001919, "prompt_toks": 15637, "completion_toks": 105}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    American banker and amateur ethnomycologist R. Gordon Wasson studied the ritual use of psychoactive mushrooms by the native population of a Mazatec village in Mexico. In 1957, Wasson described the psychedelic visions that he experienced during these rituals in \"Seeking the Magic Mushroom\", an article published in Life magazine.[10] Later that year, they were accompanied on a follow-up expedition by French mycologist Roger Heim, who identified several of the mushrooms as Psilocybe species.[11]\n\nHeim cultivated the mushrooms in France, and sent samples for analysis to Albert Hofmann, a chemist employed by the Swiss pharmaceutical company Sandoz (now Novartis). Hofmann, who had in 1938 created LSD, led a research group that isolated and identified the psychoactive compounds from Psilocybe mexicana.[12][13]\n\n\n                    Context: \n                    This passage appears in the \"History and culture\" section of the document, describing key events in the modern Western rediscovery of psilocybin mushrooms. It details how R. Gordon Wasson's 1957 ethnomycological research in Mexico, followed by collaboration with mycologist Roger Heim and chemist Albert Hofmann, led to the isolation and identification of psilocybin as the psychoactive component in Psilocybe mushrooms—a pivotal moment that influenced subsequent scientific investigation and public awareness of psychedelic mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_11", "document_index": 98, "latency_s": 29.694005299999844, "prompt_toks": 15641, "completion_toks": 100}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    He and his colleagues later synthesized a number of compounds chemically related to the naturally occurring psilocybin, to see how structural changes would affect psychoactivity. These included 4-HO-DET and 4-AcO-DMT. Sandoz marketed and sold pure psilocybin under the name \"Indocybin\" to clinicians worldwide without any reports of serious complications.[14][15]\n\nIn the early 1960s, Harvard University became a testing ground for psilocybin via the efforts of Timothy Leary and his associates, Ralph Metzner and Richard Alpert, under a project known as the Harvard Psilocybin Project. Leary obtained synthesized psilocybin from Hofmann through Sandoz. Some studies, such as the Concord Prison Experiment, found promising results for psilocybin's utility in clinical psychiatry.[16][17]\n\n\n                    Context: \n                    This passage appears in the \"History and culture\" section of the Psilocybin mushrooms article, detailing advances in the isolation, synthesis, and clinical use of psilocybin by Albert Hofmann and colleagues, as well as early research and experimentation in the 1960s, notably the Harvard Psilocybin Project led by Timothy Leary. It follows the discussion of psilocybin's traditional use and introduction to the West, and precedes explanations of ensuing legal and cultural changes.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_12", "document_index": 98, "latency_s": 31.473483900015708, "prompt_toks": 15657, "completion_toks": 129}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Leary and Alpert's zealous advocacy for widespread hallucinogen use led to a well-publicized termination from Harvard. In response to concerns about the increase in unauthorized use of psychedelic substances by the general public, psychedelics like psilocybin began to receive negative press and faced increasingly restrictive laws.\n\nIn the United States, laws were passed in 1966 that prohibited the production, trade, or ingestion of hallucinogenic substances. Sandoz stopped producing LSD and psilocybin the same year.[18] Further backlash against LSD usage swept psilocybin along with it into the Schedule I category of illicit substances in 1970. Subsequent restrictions on the use of these substances in human research made funding for such projects difficult to obtain, and scientists who worked with psychedelic drugs faced being \"professionally marginalized\".[19]\n\nIn 1976 the book Psilocybin Magic Mushroom Grower's Guide was released, written by Terence McKenna.\n\n\n                    Context: \n                    This passage appears in the \"History and culture\" section of the psilocybin mushrooms article, following earlier discussion of traditional and Mesoamerican ritual use, their introduction to the Western world, and early clinical research. It describes the shift in public perception and legal policy in the 1960s and 1970s—detailing negative press, criminalization, and research restrictions—culminating in the Schedule I classification of psilocybin. It precedes information about underground cultivation literature emerging in the 1970s, notably Terence McKenna's grower's guide, and contextualizes the modern psychedelic renaissance discussed later.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_13", "document_index": 98, "latency_s": 32.20618719997583, "prompt_toks": 15653, "completion_toks": 111}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    In 1976 the book Psilocybin Magic Mushroom Grower's Guide was released, written by Terence McKenna.\n\nIn 1978 Paul Stamets released Psilocybe Mushrooms & Their Allies.\n\nIn the 1990s, psychedelic research gradually began to regain traction, particularly in Europe. Advances in the neurosciences and the availability of brain imaging techniques have provided a reason for using substances like psilocybin to probe the \"neural underpinnings of psychotic symptom formation including ego disorders and hallucinations\".[20]\n\nRecent studies in the United States have attracted attention from the popular press and thrust psilocybin into the vogue again.[21]\n\nCommon names\n\nPsilocybin mushrooms have a number of common names. These include: psychedelic mushrooms, magic mushrooms, shrooms, magic truffles, and boomers.\n\nThe combination with MDMA is known as hippie-flipping.\n\nResearch\n\nNeurogenesis\n\n\n                    Context: \n                    This chunk appears in the \"History and culture\" section of the document, detailing the resurgence of psilocybin research and literature from the mid-1970s through the 1990s, including influential books and renewed scientific interest, particularly in Europe and the United States. It also transitions into the \"Common names\" and \"Research\" sections, introducing terminology and contemporary scientific investigations into psilocybin mushrooms (e.g., neurogenesis), reflecting the document's comprehensive overview of psilocybin mushrooms' cultural, scientific, and social significance.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_14", "document_index": 98, "latency_s": 29.949892000004184, "prompt_toks": 15692, "completion_toks": 88}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    The combination with MDMA is known as hippie-flipping.\n\nResearch\n\nNeurogenesis\n\nA low dose (0.1 mg/kg) of psilocybin produced a trend toward increased neurogenesis in the mouse hippocampus 2 weeks after its administration, while a high dose (1 mg/kg) significantly decreased neurogenesis. These results suggest that the effects of psilocybin on neurogenesis are dose- and time-related.[22]\n\nPsychoplastogen\n\nPsilocybin is a psychoplastogen,[23] which refers to a compound capable of promoting rapid and sustained neuroplasticity.\n\nChemistry\n\nPsilocybin, or 4-phosphoryloxy-N,N-dimethyltryptamine (4-PO-DMT) is a prodrug that is converted into the pharmacologically active compound psilocin in the body by a dephosphorylation reaction mediated by alkaline phosphatase enzymes.[24] Both psilocybin and psilocin are organic tryptamine compounds. They are chemically related to the amino acid tryptophan, and structurally similar to the neurotransmitter serotonin.\n\n\n                    Context: \n                    This passage appears in the early \"Research\" and \"Chemistry\" sections of the Psilocybin mushrooms article, following a brief summary and history. It discusses the combination of psilocybin with MDMA (\"hippie-flipping\"), recent findings on psilocybin’s effects on neurogenesis, its classification as a psychoplastogen, and details of its chemical nature and conversion to the active compound psilocin in the body.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_15", "document_index": 98, "latency_s": 30.52291849994799, "prompt_toks": 15617, "completion_toks": 67}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Tryptamines share a core structure comprised of a bicyclic indole heterocycle attached at R3 to an amino group via an ethyl side chain. Psilocybin is substituted at R4 of its indole heterocycle with a phosphoryloxy (-PO) functional group. It also contains two methyl groups CH3- bound to the terminal amine RN. This makes psilocybin the 4-phosphoryloxy ring-substituted analog of DMT.[25]\n\nPsilocybin and psilocin occur in their pure forms as white crystalline powders. Both are unstable in light, particularly while in solution, although their stability at low temperatures in the dark under an inert atmosphere is very good.[26]\n\nPharmacology\n\n\n                    Context: \n                    This chunk appears in the \"Chemistry\" section of the Psilocybin mushrooms article, describing the molecular structure and physical properties of psilocybin and psilocin, and immediately precedes the \"Pharmacology\" section, which discusses how psilocybin is metabolized and its mechanism of action in the body.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_16", "document_index": 98, "latency_s": 32.149861000012606, "prompt_toks": 15627, "completion_toks": 108}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Pharmacology\n\nThe diagram above demonstrates the neural connections associated with sobriety in comparison to being under the influence of psilocybin as demonstrated through the use of MRI scans. The width of the links is proportional to their weight and the size of the nodes is proportional to their strength. Note that the proportion of heavy links between communities is much higher (and very different) in the psilocybin group, suggesting greater integration[27]\n\nFurther information: Serotonergic psychedelic\n\nPsilocybin acts as a prodrug to psilocin, meaning it is not active until it is converted into psilocin in the body. Upon entering the body, psilocybin is dephosphorylated to psilocin in the intestinal mucosa by alkaline phosphatase and nonspecific esterase.[3]\n\n\n                    Context: \n                    This chunk is from the \"Pharmacology\" section of the Psilocybin mushrooms page, following the chemistry overview and preceding detailed descriptions of subjective effects. It explains the physiological mechanism of psilocybin, its conversion to the active compound psilocin in the body, and references neural imaging studies illustrating the brain's altered connectivity under psilocybin compared to sobriety. This section provides crucial context for understanding psilocybin’s neurobiological action within the greater discussion of its effects, risks, and therapeutic research.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_17", "document_index": 98, "latency_s": 30.7832021000213, "prompt_toks": 15685, "completion_toks": 111}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocin's psychedelic effects are believed to come from its agonist activity on serotonin 5-HT2A/C and 5-HT1A receptors.[3] While 5-HT2A receptor agonism is considered necessary for hallucinogenic activity, the role of other receptor subtypes is much less understood.[3]\n\nUnlike LSD, psilocin has no significant effect on dopamine receptors and only affects the noradrenergic system at very high dosages.[28]\n\nPsilocybin has also been shown by fMRI imaging to have a dampening effect on certain brain regions, most notably the Default Mode Network.[citation needed]\n\nSubjective effects\n\nThe headspace of psilocybin mushrooms is typically described as extremely relaxing, profound and stoning in style compared to more stimulating psychedelics such as LSD or 2C-B. They are also regarded as being less clear-headed than other commonly used tryptamines such as 4-AcO-DMT, DMT and ayahuasca. This may be due to the presence of other alkaloids like norbaeocystin.\n\n\n                    Context: \n                    This chunk appears within the \"Pharmacology\" section of the psilocybin mushrooms article, immediately following discussion of psilocybin's conversion to psilocin in the body. It details the neuropharmacological mechanisms—specifically psilocin's action on serotonin receptors, its limited interaction with dopamine and noradrenergic systems, and fMRI evidence of brain network effects—transitioning into the subsequent section on \"Subjective effects,\" which compares the experiential qualities of psilocybin mushrooms to other psychedelics.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_18", "document_index": 98, "latency_s": 34.81680349999806, "prompt_toks": 15612, "completion_toks": 88}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Disclaimer: The effects listed below cite the Subjective Effect Index (SEI), an open research literature based on anecdotal user reports and the personal analyses of PsychonautWiki contributors. As a result, they should be viewed with a healthy degree of skepticism.\n\nIt is also worth noting that these effects will not necessarily occur in a predictable or reliable manner, although higher doses are more liable to induce the full spectrum of effects. Likewise, adverse effects become increasingly likely with higher doses and may include addiction, severe injury, or death ☠.\n\nPhysical effects\n\nNeurogenesis[22]\n\nSedation - Psilocybin mushrooms are reported to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by excessive yawning.\n\n\n                    Context: \n                    This chunk introduces the Subjective Effect Index (SEI) disclaimer and begins the detailed section on the subjective and physical effects of psilocybin mushrooms, discussing user-reported experiences such as neurogenesis and sedation. It is part of the broader \"Subjective effects\" section that outlines the range of possible physical, cognitive, visual, and other effects induced by psilocybin mushrooms, as described in the main body of the webpage.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_19", "document_index": 98, "latency_s": 27.030979399976786, "prompt_toks": 15585, "completion_toks": 76}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Physical effects\n\nNeurogenesis[22]\n\nSedation - Psilocybin mushrooms are reported to be relaxing, stoning and mildly sedating. This sense of sedation is often accompanied by excessive yawning.\n\nSpontaneous bodily sensations - The \"body high\" of psilocybin can be described as a pleasurable, soft and all-encompassing tingling sensation or glow that steadily rises with the onset and hits its limit at the peak. Once the peak of the experience or sensation is reached it can feel incredibly euphoric and tranquil or heavy and immobilizing depending on the dose and setting.\n\n\n                    Context: \n                    This chunk appears in the \"Subjective effects\" section of the psilocybin mushrooms page, specifically under \"Physical effects,\" where the document details the various physiological sensations and bodily experiences commonly reported after consuming psilocybin mushrooms. It is part of a broader overview of user-reported subjective effects, which also include visual, cognitive, auditory, and multi-sensory phenomena.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_20", "document_index": 98, "latency_s": 31.169431300018914, "prompt_toks": 15613, "completion_toks": 69}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Perception of bodily heaviness- This effect corresponds to the general sense of sedation and relaxation that characterizes psilocybin experiences, this manifests as a bodily heaviness that discourages movement but is typically only prominent during the first half of the experience. This particular physical effect seems to be more commonly experienced and pronounced with certain “woodlover” species of mushrooms such as Psilocybe azurescens.[citation needed]\n\nTactile enhancement - This effect is less prominent than with that of LSD or 2C-B but is still present and unique in its character. It is repeatedly described as feeling very primitive in its nature often times with the small hairs on the user's arms or legs feeling slightly itchy or even ticklish against the skin.\n\n\n                    Context: \n                    This chunk appears in the \"Physical effects\" subsection of \"Subjective effects,\" detailing specific bodily sensations users may experience after consuming psilocybin mushrooms, including feelings of heaviness and enhanced tactile perception; these descriptions are part of a broader overview of the various physical, visual, cognitive, and emotional effects induced by psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_21", "document_index": 98, "latency_s": 30.56397019996075, "prompt_toks": 15657, "completion_toks": 56}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Changes in felt bodily form - This effect is often accompanied by a sense of warmth or unity and usually occurs around the peak of the experience or directly after. Users can feel as if they are physically part of or conjoined with other objects. This is usually reported as feeling comfortable in its sensations and even peaceful.\n\nPain relief - This effect can be considered as less intense when compared with LSD. Like most psychedelics, this effects is likely a result of reductions in inflammation as well as from distortions in sensory processing. This effect, while common, is not guaranteed. An increase in pain perception is also possible.\n\nNausea - This effect can be greatly lessened or even completely avoided if the individual has an empty stomach prior to ingestion. It is often recommended that one either refrain from eating for approximately 6 to 8 hours beforehand, or eat a light meal 3 to 4 hours before if they are feeling physically fatigued.\n\nChanges in felt gravity\n\n\n                    Context: \n                    This chunk appears within the \"Subjective effects\" section, specifically under \"Physical effects,\" detailing specific bodily sensations and reactions—such as changes in felt bodily form, pain relief, nausea, and altered perceptions of gravity—that users may experience during a psilocybin mushroom experience.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_22", "document_index": 98, "latency_s": 31.586118399980478, "prompt_toks": 15659, "completion_toks": 87}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Changes in felt gravity\n\nExcessive yawning - This effect seems to be uniquely pronounced among psilocybin and related tryptamines. It can occur to a lesser degree on LSD and very rarely on psychedelic phenethylamines like mescaline. It typically occurs in combination with watery eyes.\n\nWatery eyes\n\nFrequent urination\n\nMuscle contractions\n\nOlfactory hallucination\n\nPupil dilation\n\nRunny nose\n\nIncreased salivation\n\nBrain zaps[citation needed] - Although this effect is very rare, it can still occur for those susceptible to it. This component is however much less common and intense than it is with serotonin releasing agents such as MDMA.\n\nSeizure[citation needed] - This is a rare effect but can happen in a small population of those who are predisposed to them, particularly while in physically taxing conditions such as being dehydrated, undernourished, overheated, or fatigued.\n\nVisual effects\n\nEnhancements\n\n\n                    Context: \n                    This chunk appears in the \"Subjective effects\" section under \"Physical effects\" of psilocybin mushrooms, listing various bodily side effects such as excessive yawning, watery eyes, muscle contractions, and rare occurrences like brain zaps or seizures. It immediately precedes the discussion of \"Visual effects\" and falls within a detailed breakdown of the sensory, physical, and cognitive experiences associated with psilocybin mushroom use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_23", "document_index": 98, "latency_s": 30.81169190001674, "prompt_toks": 15656, "completion_toks": 77}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Visual effects\n\nEnhancements\n\nColour enhancement - Relative to other psychedelics, this effect may appear to be more saturated.\n\nPattern recognition enhancement\n\nVisual acuity enhancement - This effect typically occurs prominently at lower doses and becomes increasingly suppressed as one raises the dose.[citation needed]\n\nDistortions\n\nDrifting (melting, flowing, breathing and morphing) - In comparison to other psychedelics, this effect can be described as highly detailed, realistic, slow and smooth in motion and static in appearance.\n\nColour shifting\n\nColour tinting\n\nVisual haze\n\nDiffraction\n\nTracers\n\nAfter images\n\nSymmetrical texture repetition\n\nPerspective distortions\n\nDepth perception distortions\n\nRecursion\n\nEnvironmental orbism\n\nScenery slicing\n\nGeometry\n\nThe visual geometry produced by psilocybin mushrooms can be described as more similar in appearance to that of 4-AcO-DMT, ayahuasca and 2C-E than LSD or 2C-B.\n\n\n                    Context: \n                    This chunk appears within the \"Subjective effects\" section of the document, specifically under \"Visual effects,\" where it details the types of visual enhancements and distortions experienced during psilocybin mushroom use, including color and pattern changes, visual acuity, geometric visuals, and perceptual alterations, as part of a comprehensive overview of the substance's physical, cognitive, and sensory effects.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_24", "document_index": 98, "latency_s": 31.430675000010524, "prompt_toks": 15679, "completion_toks": 87}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Scenery slicing\n\nGeometry\n\nThe visual geometry produced by psilocybin mushrooms can be described as more similar in appearance to that of 4-AcO-DMT, ayahuasca and 2C-E than LSD or 2C-B.\n\nIt can be comprehensively described through its variations as intricate in complexity, abstract in form, organic in feel, structured in organization, brightly lit, and multicoloured in scheme, glossy in shading, soft in its edges, large in size, slow in speed, smooth in motion, rounded in its corners, non-immersive in-depth and consistent in intensity.\n\nIt has a very \"organic\" feel and at higher dosages is significantly more likely to result in states of Level 8B visual geometry over level 8A.\n\nHallucinatory states\n\nPsilocybin and its various other forms produce a full range of high level hallucinatory states in a fashion that is more consistent and reproducible than that of many other commonly used psychedelics. These effects generally include:\n\nMachinescapes\n\nTransformations\n\n\n                    Context: \n                    This section is part of the detailed description of the subjective effects of psilocybin mushrooms, specifically focusing on the visual effects users may experience. It outlines the unique visual geometry and hallucinatory states induced by psilocybin mushrooms, comparing them to other psychedelics, and provides qualitative characteristics of visuals such as complexity, organic qualities, and vividness, as well as types of hallucinations like machinescapes and transformations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_25", "document_index": 98, "latency_s": 30.921881399990525, "prompt_toks": 15575, "completion_toks": 80}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Machinescapes\n\nTransformations\n\nInternal hallucination (autonomous entities; settings, sceneries, and landscapes; perspective hallucinations and scenarios and plots) - This effect is very consistent in dark environments at appropriately high dosages. They can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical, or transcendental nature in their overall theme.\n\n\n                    Context: \n                    This passage appears within the \"Subjective effects\" section, specifically detailing the high-level hallucinatory experiences induced by psilocybin mushrooms. It describes the nature and characteristics of visual and internal hallucinations, such as \"machinescapes,\" \"transformations,\" and immersive \"internal hallucinations\" involving autonomous entities, settings, and scenarios, especially at higher dosages and in dark environments.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_26", "document_index": 98, "latency_s": 31.147790400020313, "prompt_toks": 15629, "completion_toks": 77}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    External hallucination (autonomous entities; settings, sceneries, and landscapes; perspective hallucinations and scenarios and plots) - These are more common within dark environments and can be comprehensively described through their variations as lucid in believability, interactive in style, new experiences in content, autonomous in controllability, geometry-based in style and almost exclusively of a personal, religious, spiritual, science-fiction, fantasy, surreal, nonsensical or transcendental nature in their overall theme.\n\nCognitive effects\n\nEmotion enhancement - This effect can be described as being more prominent, consistent and profound when compared to other traditional psychedelics such as mescaline or LSD. This can lead to strong feelings of compassion, urgency and even completely sporadic moments of intense emotional significance that can also be periodically affected by enhancement and suppression cycles.\n\n\n                    Context: \n                    This passage is part of the \"Subjective effects\" section, specifically detailing the range of perceptual and cognitive experiences induced by psilocybin mushrooms. It follows the discussion of visual and internal hallucinations and describes the characteristics of external hallucinations, then transitions into listing cognitive effects starting with emotion enhancement, comparing these effects to other psychedelics and explaining their emotional intensity and variability.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_27", "document_index": 98, "latency_s": 32.732817100011744, "prompt_toks": 15636, "completion_toks": 60}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Empathy, affection, and sociability enhancement - This effect differs from MDMA and other entactogens in that it isn't as central to the experience, feels less forced and more natural and is experienced at a less consistent rate. The sociability enhancement in particular only occurs rarely and it appears to be more emotional.\n\nEuthymia - This effect manifests itself acutely for all classical psychedelics when one to three doses are combined with a psychotherapy treatment program. When comparing meta analyses, psychedelic psychotherapy greatly outperforms \"gold standard\" treatments for several mental health problems.\n\nLanguage suppression - This effect can be described as a perceived inability or general unwillingness to talk aloud despite feeling perfectly capable of formulating coherent thoughts within one's internal narrative. It is much more common among inexperienced users.\n\nAnalysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n\n\n                    Context: \n                    This chunk appears within the \"Cognitive effects\" subsection of the broader \"Subjective effects\" section, detailing specific psychological changes experienced during psilocybin mushroom use, such as empathy, language, and analytical thinking alterations, alongside other cognitive, emotional, and perceptual effects discussed throughout the section.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_28", "document_index": 98, "latency_s": 28.80788370000664, "prompt_toks": 15641, "completion_toks": 54}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Analysis enhancement - This effect is consistent in its manifestation and outrospection dominant.\n\nEnhancement and suppression cycles - This can be described as constant waves of extremely stimulated and profound thinking which are spontaneously surpassed in a cyclic fashion by waves of general thought suppression and mental intoxication. These two states seem to switch between each other in a consistent loop once every 20 to 60 minutes.\n\nFeelings of impending doom - This effect is usually only experienced during the come up phase but typically completely passes or subsides once the primary effects begin. It should be noted that this effect is relatively consistent and normal for psilocybin and related tryptamines which is why a positive and well-informed mindset is key. Less regularly this aspect can also occur during the peak but will most often be met afterwards with sensations of euphoria, catharsis or rejuvenation.\n\nCognitive euphoria\n\nAutonomous voice communication\n\n\n                    Context: \n                    This chunk appears within the \"Cognitive effects\" section of the psilocybin mushrooms document, detailing specific psychological and mental experiences reported by users under the influence of psilocybin, such as analysis enhancement, thought cycles, emotional responses, and unique cognitive phenomena.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_29", "document_index": 98, "latency_s": 31.710730999999214, "prompt_toks": 15655, "completion_toks": 88}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Cognitive euphoria\n\nAutonomous voice communication\n\nSuggestibility enhancement\n\nConceptual thinking\n\nThought connectivity\n\nThought deceleration\n\nThought loops\n\nThought organization\n\nConfusion - This effect occurs at a higher rate than other psychedelics such as LSD or DMT. It is more commonly observed in users who are inexperienced with psilocybin, or psychedelics in general\n\nNovelty enhancement\n\nCreativity enhancement\n\nDelusion\n\nDéjà vu\n\nIncreased music appreciation\n\nImmersion enhancement\n\nMemory enhancement\n\nMemory suppression\n\nEgo death\n\nMindfulness\n\nSimultaneous emotions\n\nPersonal bias suppression\n\nEgo replacement - Although this effect is rare and more likely to occur with certain psychedelics like DMT or ayahuasca, it can still spontaneously occur, usually with higher doses.\n\nPersonality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting.\n\nCatharsis\n\n\n                    Context: \n                    This chunk is part of the \"Cognitive effects\" subsection under \"Subjective effects\" of psilocybin mushrooms, listing and briefly describing various psychological and experiential outcomes that users may experience, such as cognitive euphoria, confusion, ego death, creativity enhancement, and more. This section situates these cognitive phenomena among other physical, visual, auditory, and transpersonal effects detailed in the broader \"Subjective effects\" section.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_30", "document_index": 98, "latency_s": 31.39282450004248, "prompt_toks": 15622, "completion_toks": 98}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Personality regression - Although this effect is rare it can still manifest spontaneously and is thought to depend primarily on the user's set and setting.\n\nCatharsis\n\nRejuvenation - While this component can occur spontaneously at any point, it typically follows a difficult phase of the experience, if not the entire experience itself. It is however almost always felt during the offset of a psilocybin experience and tends to slowly transition into the after effects which are generally described as positive. These positive or mindful after effects are sometimes referred to as an \"afterglow\" and is both common and consistent for psilocybin and related tryptamines.\n\nAddiction suppression[29]\n\nTime distortion\n\nAuditory effects\n\nAuditory enhancement\n\nAuditory distortion\n\nAuditory hallucination\n\nMulti-sensory effects\n\n\n                    Context: \n                    This excerpt details several cognitive, emotional, and perceptual effects experienced during psilocybin mushroom intoxication, specifically rare phenomena like personality regression, cathartic episodes, feelings of rejuvenation and afterglow, addiction suppression, and time distortion, followed by a transition into auditory and multi-sensory effects; it appears within the comprehensive list of subjective effects and user experiences related to psilocybin mushrooms’ physical, cognitive, perceptual, and transpersonal impacts described in the document.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_31", "document_index": 98, "latency_s": 31.11782459996175, "prompt_toks": 15627, "completion_toks": 130}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Addiction suppression[29]\n\nTime distortion\n\nAuditory effects\n\nAuditory enhancement\n\nAuditory distortion\n\nAuditory hallucination\n\nMulti-sensory effects\n\nSynaesthesia - In its fullest manifestation, this is a very rare and non-reproducible effect. Increasing the dosage can increase the likelihood of this occurring, but seems to only be a prominent part of the experience among those who are already predisposed to synaesthetic states.\n\nDosage independent intensity[citation needed]\n\nTranspersonal effects\n\nAnecdotally, these components are generally considered to be most consistent with the naturally-occurring entheogenic tryptamines such as ayahuasca, ibogaine and psilocybin. They are listed below as follows:\n\nSpirituality enhancement\n\nExistential self-realization\n\nUnity and interconnectedness\n\nCombination effects\n\n\n                    Context: \n                    This chunk appears within the \"Subjective effects\" section of the document, specifically detailing the cognitive, auditory, multi-sensory, transpersonal, and combination effects associated with psilocybin mushroom use. It immediately follows descriptions of various cognitive effects and precedes more specific details about the unique subjective experiences users may encounter, providing an overview of phenomena such as addiction suppression, time distortion, enhanced sensory perception, synaesthesia, and profound transpersonal experiences like spirituality enhancement and unity. This section serves to comprehensively enumerate and characterize the range of internal experiences reported after psilocybin ingestion before transitioning to information about polydrug interactions and experience reports.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_32", "document_index": 98, "latency_s": 30.68739049998112, "prompt_toks": 15653, "completion_toks": 75}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Spirituality enhancement\n\nExistential self-realization\n\nUnity and interconnectedness\n\nCombination effects\n\nCannabis - Cannabis majorly amplifies the sensory and cognitive effects of psilocybin mushrooms. This should be used with extreme caution, especially if one is not experienced with psychedelics. This interaction can also amplify the anxiety, confusion and delusion producing aspects of cannabis significantly. Those who choose to use this combination are advised to start off with only a fraction of their usual cannabis dose, and slow down the pace of their normal intake considerably.\n\nDissociatives - Dissociatives can enhance the geometry, euphoria, dissociation and hallucinatory effects of psilocybin mushrooms. Dissociative-induced holes, spaces, and voids while under the influence of psilocybin can result in significantly more vivid visuals than dissociatives alone, along with more intense internal hallucinations, confusion, nausea, delusions and increased risk of psychosis.\n\n\n                    Context: \n                    This chunk is from the \"Subjective effects\" section of the psilocybin mushrooms page, specifically under \"Transpersonal effects\" and \"Combination effects,\" describing the potential spiritual, existential, and unity-related experiences induced by psilocybin, as well as the effects and cautions of combining psilocybin mushrooms with other substances like cannabis and dissociatives.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_33", "document_index": 98, "latency_s": 31.303758800029755, "prompt_toks": 15655, "completion_toks": 71}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    MDMA - MDMA enhances the visual, physical and cognitive effects of psilocybin. The synergy between these substances is unpredictable, and it is advised to start with lower dosages than one would take for either substance individually. The toxicity of this combination is unknown, although there is some evidence that suggests this may increase the the neurotoxic effects of MDMA.[30][31][32]\n\nAlcohol - This combination is not typically recommended due to alcohol’s potential to cause dehydration, nausea, and physical fatigue at higher doses. However, this combination is reasonably safe in low doses and, when used responsibly, can \"take the edge off a trip\" and reduce anxiety in a manner somewhat similar to benzodiazepines. With psilocybin mushrooms in particular it is often recommended that the user waits until the \"come down\" phase to consume alcohol due to the sometimes nauseating effects of mushrooms, especially within the first 2 - 3 hours of the experience.\n\n\n                    Context: \n                    This chunk appears within the \"Combination effects\" section of the psilocybin mushrooms page, where the effects, risks, and interactions of combining psilocybin mushrooms with other substances—such as MDMA and alcohol—are described to inform users about potential synergies, adverse effects, and harm reduction recommendations when using psilocybin alongside other drugs.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_34", "document_index": 98, "latency_s": 31.052935799991246, "prompt_toks": 15649, "completion_toks": 71}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Benzodiazepines - Depending on the dosage, benzodiazepines can slightly to completely reduce the intensity of the cognitive, physical and visual effects of a psilocybin trip. They can be very efficient at largely stopping or mitigating a bad trip at the cost of amnesia and reduced trip intensity. Caution is advised when acquiring them for this purpose, however, due to the high abuse potential they possess.\n\nPsychedelics - When used in combination with other psychedelics, the physical, cognitive and visual effects of each substance intensify and synergize strongly with each other. The synergy between those substances is unpredictable, and for this reason, is generally not advised. If choosing to combine psychedelics, it is recommended to start with lower dosages than one would take for either substance individually.\n\nExperience reports\n\nThere are currently 29 anecdotal reports which describe the effects of this compound within our experience index.\n\n\n                    Context: \n                    This chunk appears within the \"Combination effects\" section of the psilocybin mushrooms overview, detailing how combining psilocybin with benzodiazepines or other psychedelics can alter or intensify effects, including guidance and cautions for users. It is followed by the \"Experience reports\" section, which provides anecdotal trip descriptions.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_35", "document_index": 98, "latency_s": 30.90265270002419, "prompt_toks": 15722, "completion_toks": 81}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Experience reports\n\nThere are currently 29 anecdotal reports which describe the effects of this compound within our experience index.\n\nExperience: 1.5g Psilocybe Cubensis - Analysis of body and mind\n\nExperience: 2g Psilocybe cubensis (Lemon Tek) + 0.25mg Cannabis (Bong) - Passing through The Doors to the Eternal Summer\n\nExperience:1.5 Grams Psilocybe Cubensis\n\nExperience:15g Psilocybe Mexicana Truffles - First experince\n\nExperience:15g psilocybe truffles - first experience\n\nExperience:1g of stars and love\n\nExperience:2 grams Psilocybe Cubensis + 2.7 grams Syrian Rue - The Psilohuasca Albino Fox\n\nExperience:2.5g - Swim's first mushroom trip\n\nExperience:2.5g Mushrooms + 500mg DMT\n\nExperience:2.5g Psilocybe Cubensis B+ strain - epiphany of nondualistic reality\n\nExperience:225ug LSD + 9g cubensis - Galactic Melt and the Meverse\n\nExperience:3 Grams of Mushrooms - Reset on my Life, Experiencing Satori and the Cosmic Perspective\n\n\n                    Context: \n                    This section lists anecdotal experience reports from users who have consumed psilocybin mushrooms or related combinations, illustrating the range of subjective effects discussed earlier in the document. It appears within the broader discussion of subjective effects, following detailed descriptions of physical, visual, cognitive, and combination effects. These reports provide practical, user-based perspectives that complement the preceding scientific and descriptive information about psilocybin mushroom experiences.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_36", "document_index": 98, "latency_s": 31.720553400053177, "prompt_toks": 15708, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Experience:225ug LSD + 9g cubensis - Galactic Melt and the Meverse\n\nExperience:3 Grams of Mushrooms - Reset on my Life, Experiencing Satori and the Cosmic Perspective\n\nExperience:3.5g psilocybe cubensis - Relinquishing of Material Chains/Fear and Desolation\n\nExperience:3g - I found god inside of myself\n\nExperience:4.5g - The Grand Introduction to Beauty and Fear\n\nExperience:4g - States of unity and interconnectedness\n\nExperience:5.3g psilocybe cubensis - Dimensional Circumstance and the Fabric of Understanding\n\nExperience:5g Mushrooms - Failed attempt at a Terence Mckenna style trip.\n\nExperience:A Strong Trip: Disconnecting from Reality and Forgetting the World\n\nExperience:Cubensis genius trials\n\nExperience:Mushrooms (~0.5 g) - Autonomous Voice\n\nExperience:Mushrooms and Snuff Films -- Trip Report (3.5 grams)\n\nExperience:Psilocybe Cubensis (2g, Oral) - First Spiritual Experience(?)\n\nExperience:Psilocybin Mushroom (0.16 g, Oral) - Dosage Independent Intensity\n\n\n                    Context: \n                    This chunk is part of the \"Experience reports\" section, which lists anecdotal accounts describing individual users' effects and personal experiences with various dosages of psilocybin mushrooms and combinations with other psychedelics. These reports illustrate the subjective variability of mushroom experiences referenced throughout the document and provide practical, real-world examples complementing the preceding discussions on effects, dosage, preparation, and harm reduction.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_37", "document_index": 98, "latency_s": 30.93096179998247, "prompt_toks": 15700, "completion_toks": 71}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Experience:Psilocybe Cubensis (2g, Oral) - First Spiritual Experience(?)\n\nExperience:Psilocybin Mushroom (0.16 g, Oral) - Dosage Independent Intensity\n\nExperience:Psilocybin mushrooms (~4.8 g) - A challenging first trip\n\nExperience:Psilocybin or O-Acetylpsilocin (8000mg oral) - Don't you see? Don't you realize?\n\nExperience:Psilocybin truffles (15g, tea) - Untitled\n\nExperience:Unknown dosage - An omniscient sphere\n\nExperience:~80-100 Psilocybe Subaeruginosa\n\nAdditional experience reports can be found here:\n\nErowid Experience Vaults: Mushrooms\n\nDosage and preparation\n\nThe dosage of psilocybin mushrooms depends on the potency of the mushroom (the total psilocybin and psilocin content of the mushrooms), which varies significantly both between species and within the same species. However, \"the most commonly used mushroom is Psilocybe cubensis, which contains 10–12 mg of psilocybin per gram of dried mushrooms\".[33]\n\n\n                    Context: \n                    This chunk is from the \"Experience reports\" and \"Dosage and preparation\" sections of the Psilocybin mushrooms page, listing user-submitted accounts of psilocybin mushroom experiences and transitioning into guidance on dosages, emphasizing the variability in psilocybin content between mushroom species and providing typical potency information for Psilocybe cubensis.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_38", "document_index": 98, "latency_s": 30.589275200036354, "prompt_toks": 15738, "completion_toks": 51}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    The concentration of active psilocybin mushroom compounds varies not only from species to species, but also from mushroom to mushroom inside a given species, subspecies or variety. The same holds true even for different parts of the same mushroom.\n\nFor example, in the species Psilocybe samuiensis, the dried cap of the mushroom contains the most psilocybin at about 0.23%–0.90%. The mycelium contains about 0.24%–0.32%.[34]\n\nPsilocybin\n\nDosage calculation\n\nMath: Desired psilocybin from divided by the psilocybin strength of the strain. For example, if you want to consume 15 mg psilocybin (a common dose) from cubensis with 1% psilocybin content:\n\nPsilocybe cubensis\n\nMain article: Psilocybe cubensis (mycology)\n\nPsilocybe cubensis (also known as cubes) is one of the most commonly used species of psilocybin mushrooms. The doses for oral consumption for dried cubensis mushrooms are generally considered to be:\n\nThreshold: 0.25 - 0.5 g\n\nLight: 0.5 - 1 g\n\nCommon: 1 - 2.5 g\n\nStrong: 2.5 - 5 g\n\n\n                    Context: \n                    This chunk is from the \"Dosage and preparation\" section of the psilocybin mushrooms document, detailing how psilocybin content varies between and within mushroom species and providing specific dosage guidelines and calculation methods for dried Psilocybe cubensis.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_39", "document_index": 98, "latency_s": 32.72116240003379, "prompt_toks": 15645, "completion_toks": 97}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Threshold: 0.25 - 0.5 g\n\nLight: 0.5 - 1 g\n\nCommon: 1 - 2.5 g\n\nStrong: 2.5 - 5 g\n\nHeavy: 5 g +\n\nPreparation methods\n\nPreparation methods for this compound within our tutorial index include:\n\nBrown rice flour psilocybin mushroom tek\n\nOutdoor mushroom cultivation\n\nMushroom chocolates\n\nMushroom tea\n\nPsilocybin mushroom lemon tek\n\nNatural occurrence\n\nBiological genera containing psilocybin mushrooms include Copelandia, Galerina, Gymnopilus, Inocybe, Mycena, Panaeolus, Pholiotina, Pluteus, and Psilocybe. Over 100 species are classified in the genus Psilocybe.\n\nSome common psilocybin and psilocin containing mushroom species include:\n\n\n                    Context: \n                    This section details recommended oral dosage ranges for dried Psilocybe cubensis mushrooms (threshold to heavy), followed by common preparation methods (e.g., cultivation techniques, consumption preparations). It then introduces the natural occurrence and taxonomy of psilocybin-containing mushrooms, listing major biological genera and species known to produce psilocybin and psilocin. This content fits within the broader dosage, preparation, and species identification guidance provided for safe and informed use of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_40", "document_index": 98, "latency_s": 30.22632470005192, "prompt_toks": 15763, "completion_toks": 86}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Some common psilocybin and psilocin containing mushroom species include:\n\nPsilocybe Psilocybe semilanceata , also known as the liberty cap. Psilocybe atlantis Psilocybe azurescens Psilocybe brasiliensis Psilocybe caerulescens Psilocybe columbiana Psilocybe cubensis Psilocybe cyanescens Psilocybe galindoi Psilocybe laurae Psilocybe mexicana Psilocybe paulensis Psilocybe plutonia Psilocybe semilanceata Psilocybe subaeruginosa Psilocybe tampanensis Psilocybe weraroa Psilocybe wrightii Psilocybe zapotecorum Panaeolus Panaeolus cyanescens , also known as the pan cyan. Panaeolus africanus Panaeolus campanulatus Panaeolus cinctulus Panaeolus cyanescens Panaeolus subbalteatus Panaeolus venezolanus Gymnopilus Gymnopilus luteofolius Gymnopilus aeruginosus Gymnopilus luteofolius Gymnopilus luteus Gymnopilus purpuratus Dictyonema Dictyonema huaorani (This species is a lichen not a mushroom)\n\nRisk of species confusion\n\n\n                    Context: \n                    This chunk appears within the \"Natural occurrence\" section of the Psilocybin mushrooms webpage, listing notable genera and species of mushrooms known to contain psilocybin or psilocin. It provides specific examples of psychoactive mushrooms from genera such as Psilocybe, Panaeolus, Gymnopilus, and Dictyonema, immediately before discussing the risk of confusing these with toxic look-alike species.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_41", "document_index": 98, "latency_s": 30.721272099995986, "prompt_toks": 15613, "completion_toks": 57}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Risk of species confusion\n\nAs psilocybin mushrooms are capable of being harvested in nature, there is a major risk in misidentifying the mushroom species and accidentally consuming a poisonous (possibly lethal) variety. This risk can be avoided by educating oneself in advance on how to properly identify the correct species of mushroom and the potential look-alike mushrooms found within one's local area. Users are encouraged to learn from a mentor who is experienced in mushroom picking before doing it on their own.\n\nResearch\n\nAntidepressant effects\n\nWhile further research is needed to establish the utility of psilocybin and other psychedelics in treating depression, a pilot study has observed significantly decreased depression scores in terminal cancer patients six months after treatment with psilocybin.[35]\n\n\n                    Context: \n                    This section follows the list of psilocybin-containing mushroom genera and species, highlighting the dangers of misidentification and the importance of proper education when foraging. It then transitions into research on psilocybin’s antidepressant effects, including findings from initial studies on its therapeutic potential.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_42", "document_index": 98, "latency_s": 32.41185629996471, "prompt_toks": 15630, "completion_toks": 113}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    An open-label study was carried out in 2016 in the UK to investigate the feasibility, safety and efficacy of psilocybin in treating patients with unipolar treatment-resistant depression with promising results; although the study was small and involved only twelve patients, seven of those patients met formal criteria for remission one week following psilocybin treatment and five of those were still in remission from their depression at three months.[36]\n\nThe mechanism behind this is not known as of yet, but researchers have suggested that psilocin's deactivation of the medial prefrontal cortex[37] (mPFC) may be relevant to its antidepressant effects, as the mPFC is known to be elevated in depression and normalized after effective treatment.[37] mPFC hyperactivity has been associated with trait rumination.[38]\n\n\n                    Context: \n                    This passage appears in the \"Research – Antidepressant effects\" section of the Psilocybin mushrooms page, discussing clinical studies on psilocybin's potential for treating depression. It summarizes a 2016 UK open-label study demonstrating promising remission rates in patients with treatment-resistant depression, and explores possible mechanisms involving changes to brain regions (notably the medial prefrontal cortex) associated with depressive symptoms. This section follows broader content on history, chemistry, pharmacology, subjective effects, and precedes discussions on toxicity, harm potential, and legal status.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_43", "document_index": 98, "latency_s": 30.49132129998179, "prompt_toks": 15610, "completion_toks": 76}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Another possible factor to psilocybin's potential against depression may be that depressed patients with high levels of dysfunctional attitudes were found to have low levels of 5-HT(2A) agonism.[39][40]\n\nToxicity and harm potential\n\nTable from the 2010 DrugScience study ranking various drugs (legal and illegal) based on statements by drug-harm experts. This study rated \"mushroom\" the least harmful drug overall and for users, and the only drug that didn't get any scores for harm on others.[41]\n\nRadar plot showing relative physical harm, social harm, and dependence of benzodiazepines in comparison to other drugs.[42]\n\nFurther information: Responsible use § Hallucinogens\n\n\n                    Context: \n                    This section appears after discussion of psilocybin's possible antidepressant mechanisms and presents information on the safety profile of psilocybin mushrooms. It introduces comparative studies highlighting their low physical and social harm relative to other drugs, and serves as the opening to a broader discussion on toxicity, harm potential, and responsible use, transitioning from research on therapeutic effects to safety and risk considerations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_44", "document_index": 98, "latency_s": 30.67768929997692, "prompt_toks": 15591, "completion_toks": 95}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Radar plot showing relative physical harm, social harm, and dependence of benzodiazepines in comparison to other drugs.[42]\n\nFurther information: Responsible use § Hallucinogens\n\nNumerous studies have found that psilocybin mushrooms are physiologically well-tolerated and has an extremely low toxicity relative to dose. There is no evidence for long-lasting effects on the brain or other organs and there are no documented deaths attributed to the direct effects of psilocybin mushrooms toxicity.[43]\n\nHowever, it is worth noting that while they may not be capable of causing direct bodily toxicity or death, their use can still present serious hazards.\n\n\n                    Context: \n                    This chunk appears in the \"Toxicity and harm potential\" section, following a discussion of research on psilocybin's antidepressant effects and just before details on lethal dosage, psychological risks, dependence, and harm reduction practices. It introduces the physical safety profile of psilocybin mushrooms, highlighting their low toxicity and lack of documented fatality, while cautioning that significant risks exist due to impaired judgement and psychological hazards, and leads into further discussion about these risks.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_45", "document_index": 98, "latency_s": 31.020905899989884, "prompt_toks": 15620, "completion_toks": 79}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    However, it is worth noting that while they may not be capable of causing direct bodily toxicity or death, their use can still present serious hazards.\n\nFor example, they are capable of strongly impairing the user's judgment and attention span, which may promote erratic or dangerous behaviors. In extreme cases, the user may experience powerful delusions e.g. that they are actually inside of a dream and therefore physically invincible, or that they are being \"chased by demons\". This may prompt them to jump off of a building or run into oncoming traffic.[43]\n\nAdditionally, intense negative experiences and psychotic episodes (i.e. \"bad trips\") can cause lasting psychological trauma if not properly managed or treated afterward. This is particularly a concern in non-supervised settings or when heavy doses are used.\n\n\n                    Context: \n                    This chunk comes from the \"Toxicity and harm potential\" section of the Psilocybin mushrooms page. It highlights that, while psilocybin mushrooms are physiologically safe and not directly toxic, they can still present serious psychological and behavioral risks such as impaired judgment, dangerous delusions, and lasting trauma from negative experiences, especially in unsupervised or high-dose situations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_46", "document_index": 98, "latency_s": 31.075218899990432, "prompt_toks": 15614, "completion_toks": 85}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Finally, it should be noted that evidence of psilocybin mushrooms' effectiveness as a mental health treatment only applies to the controlled procedures used in clinical settings. They are not considered the entire treatment because the current evidence suggests they must be combined with professional psychotherapy to produce lasting effects.\n\nWithout the appropriate safeguards, attempts at self-medicating with psilocybin mushrooms may actually worsen mental health issues.[citation needed]\n\nIt is strongly advised to use harm reduction practices if using this substance. These include:\n\nTaking the substance under the supervision of a tripsitter for one's first time or while experimenting with a higher dose\n\nStarting off with a dose in the low-common range and monitoring for unusual reactions (e.g. mania, delusions) or sensitivity\n\n\n                    Context: \n                    This passage appears in the \"Toxicity and harm potential\" section, emphasizing that the therapeutic benefits of psilocybin mushrooms are only demonstrated in clinical, professionally supervised settings and should not be conflated with unsupervised self-medication, which may worsen mental health. It introduces key harm reduction guidelines and cautions for safe use, following discussion of physiological safety, psychological risks, and potential hazards associated with misuse.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_47", "document_index": 98, "latency_s": 30.88557680003578, "prompt_toks": 15679, "completion_toks": 61}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Starting off with a dose in the low-common range and monitoring for unusual reactions (e.g. mania, delusions) or sensitivity\n\nNot exceeding the listed heavy dose. If heavy doses are required, a tolerance break is advised instead. Heavy doses greatly increase the risk of negative effects\n\nKeeping a supply of benzodiazepines or antipsychotics (e.g. Seroquel) to abort the trip in the case of overwhelming anxiety or psychosis\n\nLethal dosage\n\nThe toxicity of psilocybin and psilocin is extremely low. In rats, the median lethal dose (LD50) of psilocybin when administered orally is 280 milligrams per kilogram (mg/kg).\n\nPsilocybin comprises approximately 1% of the weight of Psilocybe cubensis and so nearly 1.7 kilograms (3.7 lb) of dried mushrooms or 17 kilograms (37 lb) of fresh mushrooms would be required for a 60 kilogram (130 lb) person to reach the 280 mg/kg LD50 value of rats.\n\n\n                    Context: \n                    This chunk appears in the \"Toxicity and harm potential\" section of the psilocybin mushrooms article, specifically within the list of recommended harm reduction practices and immediately before the subsection on lethal dosage, which discusses the extremely low toxicity and high lethal dose of psilocybin relative to typical use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_48", "document_index": 98, "latency_s": 32.832285700016655, "prompt_toks": 15631, "completion_toks": 95}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Based on the results of animal studies, the lethal dose of psilocybin has been extrapolated to be 6 grams, 1000 times greater than the effective dose of 6 milligrams. Unlike many highly prohibited substances, it is effectively impossible to physically overdose on.\n\nPsychosis and mental disorder risk\n\nPsilocybin mushrooms can exacerbate symptoms (e.g. delusions, mania, psychosis) of various mental disorders. Additionally, they can precipitate the early onset of schizophrenia in vulnerable individuals.[43]\n\nThose with a personal or family history of mental disorders, particularly psychotic disorders like schizophrenia, should not use psilocybin mushrooms without consulting a qualified medical professional.\n\nDependence and abuse potential\n\nLike other serotonergic psychedelics, psilocybin mushrooms have low abuse and no physical dependence potential.[44]\n\n\n                    Context: \n                    This chunk is from the \"Toxicity and harm potential\" section of the Psilocybin mushrooms page. It follows information about the low toxicity and lethal dosage of psilocybin, then details risks of psychosis and mental health exacerbation, especially for those with or predisposed to mental disorders, and discusses the low abuse and dependence potential of psilocybin mushrooms. This section addresses safety, psychological risks, and dependence concerns associated with psilocybin use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_49", "document_index": 98, "latency_s": 29.32327210000949, "prompt_toks": 15626, "completion_toks": 85}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Dependence and abuse potential\n\nLike other serotonergic psychedelics, psilocybin mushrooms have low abuse and no physical dependence potential.[44]\n\nThere are no literature reports of successful attempts to train animals to self-administer a serotonergic psychedelic, which is predictive of abuse liability, indicating that it does not have the necessary pharmacology to either initiate or maintain dependence.[44]\n\nAdditionally, there is no human clinical evidence that psilocybin mushrooms causes addiction. Finally, there is virtually no withdrawal syndrome when chronic use of psilocybin mushrooms is stopped.\n\nTolerance to the effects of psilocybin builds almost immediately after ingestion. After that, it takes about 3 days for the tolerance to be reduced to half and 7 days to be back at baseline (in the absence of further consumption).\n\n\n                    Context: \n                    This section discusses the dependence and abuse potential of psilocybin mushrooms, highlighting their low risk for addiction and physical dependence. It is part of the broader \"Toxicity and harm potential\" area of the document, which evaluates safety, adverse effects, and harm reduction practices related to psilocybin mushroom use. The section supports the overall theme of risk assessment and user safety in the context of psychoactive substance use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_50", "document_index": 98, "latency_s": 31.474703899992164, "prompt_toks": 15627, "completion_toks": 97}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psilocybin exhibits cross-tolerance with all psychedelics, meaning that after the consumption of psilocybin all psychedelics will have a reduced effect.\n\nHallucinogen-perception persisting disorder (HPPD)\n\nFurther information: Hallucinogen persisting perception disorder\n\nIn rare cases, psilocybin mushrooms may trigger hallucinogen persisting perception disorder (HPPD) in some individuals.[45] The cause is unclear; however, explanations in terms of psilocybin physically remaining in the body for months or years after consumption have been discounted by experimental evidence.\n\nSome say HPPD is a manifestation of post-traumatic stress disorder, not related to the direct action on brain chemistry, and varies according to the susceptibility of the individual to the disorder.[46]\n\nDangerous interactions\n\n\n                    Context: \n                    This chunk appears in the \"Toxicity and harm potential\" section of the psilocybin mushrooms article. It discusses the phenomenon of cross-tolerance (where consuming psilocybin diminishes the effects of other psychedelics) and the rare risk of hallucinogen persisting perception disorder (HPPD) after use, followed by a transition to dangerous substance interactions. This section is focused on the potential risks and adverse effects associated with psilocybin mushroom use.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_51", "document_index": 98, "latency_s": 30.58404949994292, "prompt_toks": 15581, "completion_toks": 82}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Dangerous interactions\n\nWarning: Many psychoactive substances that are reasonably safe to use on their own can suddenly become dangerous and even life-threatening when combined with certain other substances. The following list provides some known dangerous interactions (although it is not guaranteed to include all of them).\n\nAlways conduct independent research (e.g. Google, DuckDuckGo, PubMed) to ensure that a combination of two or more substances is safe to consume. Some of the listed interactions have been sourced from TripSit.\n\nAmphetamines - Stimulants increase anxiety levels and the risk of thought loops which can lead to negative experiences\n\n\n                    Context: \n                    This chunk appears in the \"Toxicity and harm potential\" section of the psilocybin mushrooms article, specifically detailing warnings about combining psilocybin mushrooms with other substances. It lists dangerous drug interactions that can increase risks when psilocybin is used concurrently with substances like amphetamines, cannabis, cocaine, tramadol, or lithium, emphasizing the importance of independent research and harm reduction practices.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_52", "document_index": 98, "latency_s": 31.809849000012036, "prompt_toks": 15654, "completion_toks": 94}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Amphetamines - Stimulants increase anxiety levels and the risk of thought loops which can lead to negative experiences\n\nCannabis:[47] Cannabis can have an unexpectedly strong and unpredictable synergy with psilocybin mushrooms. While it is commonly used to intensify or prolong the mushrooms' effects, caution is highly advised as mixing these substances can significantly increase the risk of anxiety, paranoia, panic attacks, and psychosis. Anecdotal reports often describe the ingestion of cannabis as the triggering event for a bad trip or psychosis. Users are advised to start off with only a fraction (e.g. 1/4th - 1/3rd) of their typical cannabis dose and space out hits to avoid accidental over-intake.\n\nCocaine - Stimulants increase anxiety levels and the risk of thought loops which can lead to negative experiences\n\nTramadol - Tramadol is well known to lower seizure threshold and psychedelics also cause occasional seizures.\n\n\n                    Context: \n                    This chunk appears in the \"Dangerous interactions\" subsection of the \"Toxicity and harm potential\" section. It lists specific substances (amphetamines, cannabis, cocaine, tramadol) that may cause hazardous or unpredictable effects when combined with psilocybin mushrooms, emphasizing the risks of increased anxiety, psychosis, seizures, and negative experiences. The guidance is aimed at users seeking information on drug-drug interactions and harm reduction when using psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_53", "document_index": 98, "latency_s": 31.27970680000726, "prompt_toks": 15645, "completion_toks": 65}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Tramadol - Tramadol is well known to lower seizure threshold and psychedelics also cause occasional seizures.\n\nLithium - Lithium is commonly prescribed in the treatment of bipolar disorder; however, studies find it can significantly increase the risk of and seizures when combined to psychedelics. As a result, this combination should be strictly avoided.\n\nLegal status\n\nInternationally, psilocybin (but not psilocybin mushrooms) is a Schedule I drug under the Convention on Psychotropic Substances.\n\n\"The cultivation of plants from which psychotropic substances are obtained is not controlled by the Vienna Convention. . . . Neither the crown (fruit, mescal button) of the Peyote cactus nor the roots of the plant Mimosa hostilis nor Psilocybe mushrooms themselves are included in Schedule 1, but only their respective principals, mescaline, DMT, and psilocin.\"\n\n\n                    Context: \n                    This chunk is part of the \"Dangerous interactions\" section, listing substances that can interact harmfully with psilocybin mushrooms (specifically noting tramadol and lithium), and is immediately followed by the \"Legal status\" section which outlines the international and national scheduling of psilocybin and psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_54", "document_index": 98, "latency_s": 30.401017799973488, "prompt_toks": 15566, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Austria: Psilocybin containing mushrooms are illegal to possess in dried form, to sell and to offer, give or get somebody under the SMG (Suchtmittelgesetz Österreich). It is illegal to grow them with the intention of \"producing psychotropic substances\" (as psilocin and psilocybin) mentioned in BGBl. III Nr. 148/1997 .[48]\n\nBahamas: Psilocybin mushrooms are legal to possess, grow, and consume.[citation needed]\n\n\n                    Context: \n                    This chunk appears in the \"Legal status\" section of the document, which presents a country-by-country overview of the legality of psilocybin mushrooms and related substances worldwide. It specifically lists the laws governing the possession, cultivation, sale, and consumption of psilocybin mushrooms in Austria and the Bahamas, as part of a comprehensive legal summary for different nations.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_55", "document_index": 98, "latency_s": 30.35306519997539, "prompt_toks": 15652, "completion_toks": 35}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Bahamas: Psilocybin mushrooms are legal to possess, grow, and consume.[citation needed]\n\nBrazil: Psilocybin Mushrooms derived psychoactive substances targeted for unjustified consumption are illegal to possess, store, transport, import, export, prescribe, administer, sell and advertise, regardless of no intent of profit and in any form. Cultivation of the former, however, only under the premise of \"botanical purposes\", or similar, is perfectly allowed due to legal gap in which Psilocybe mushrooms themselves are not explicitly listed as sources of potential psychotropic substances. Use of Psilocybin containing mushrooms within religious cults are constitucionally and internationally protected from antidrug policies and are, likewise, allowed.[49]\n\nBritish Virgin Isles: The sale of mushrooms is illegal, but possession and consumption is legal.[citation needed]\n\nBulgaria: The sale of mushrooms is illegal, but possession and consumption is legal.[citation needed]\n\n\n                    Context: \n                    This chunk is part of the \"Legal status\" section, which lists the legal classification, restrictions, and allowances regarding psilocybin mushrooms in different countries and regions worldwide.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_56", "document_index": 98, "latency_s": 31.084492399997544, "prompt_toks": 15672, "completion_toks": 48}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Bulgaria: The sale of mushrooms is illegal, but possession and consumption is legal.[citation needed]\n\nBelgium: Possession and sale of mushrooms have been illegal since 1988.[citation needed]\n\nCanada: Psilocybin and psilocin are illegal to possess, obtain or produce without a prescription or license as they are Schedule III under the Controlled Drugs and Substances Act; however, dried psilocybin mushrooms are openly sold on dozens of Canadian websites. Spores and growing kits are legal to possess. [50]\n\nCzech Republic: The distribution (including sale) of mushrooms is illegal, but consumption is legal. The possession of over 40 hallucinogenic caps is considered a crime if they contain more than 50mg of psilocin or the corresponding amount of psilocybin. The possession of more than 40g of hallucinogenic mycelium is considered a crime. If these limits are not exceeded, the act is considered a minor offense and a fine of up to 15 thousand CZK may be imposed.\n\n\n                    Context: \n                    This chunk is part of the \"Legal status\" section, which provides a country-by-country overview of the legality of psilocybin mushrooms, detailing specific laws and regulations regarding their possession, sale, cultivation, and use around the world.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_57", "document_index": 98, "latency_s": 31.388449800026137, "prompt_toks": 15658, "completion_toks": 48}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Cyprus: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nDenmark: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nFinland: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nGermany: Psilocybin is illegal to produce, possess or sale under Schedule I of the Narcotics Act (Anlage I BtMG)[51]. Consumption is not illegal. The mushroom and spores by itself are not illegal and only become illegal when containing Psilocybin or Psilocin.\n\nGreece: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nIreland: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nIceland: The sale of Psilocybin mushrooms is illegal, but possession and consumption is legal.\n\n\n                    Context: \n                    This chunk is part of the \"Legal status\" section, which provides a country-by-country overview of the legal status of psilocybin mushrooms, specifying whether possession, cultivation, sale, or consumption is permitted or prohibited in each jurisdiction.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_58", "document_index": 98, "latency_s": 30.842724599991925, "prompt_toks": 15674, "completion_toks": 48}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Ireland: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nIceland: The sale of Psilocybin mushrooms is illegal, but possession and consumption is legal.\n\nIndia: Psilocybin mushrooms are illegal to possess, grow, sale, and consume. However, it is reported that many police departments in undeveloped areas are unaware of the prohibition.\n\nJapan: Psilocybin mushrooms are illegal to possess, grow, sale, and consume.[citation needed]\n\nLatvia: Hallucinogenic mushrooms, psilocin and psilocybin are Schedule I controlled substances.[52]\n\nLuxembourg: Psilocybin is a prohibited substance[53]\n\nMexico: The possession, growth, sale and consumption of mushrooms is illegal. Rules are relaxed regarding religious use however.[citation needed]\n\nThe Netherlands: The possession, growth, sale and consumption of mushrooms is illegal. However, due to a legal loophole, psilocybin truffles can be legally possessed, grown, sold and consumed.[citation needed]\n\n\n                    Context: \n                    This chunk is from the \"Legal status\" section, listing the legality of psilocybin mushrooms in various countries, specifically detailing their legal status in Ireland, Iceland, India, Japan, Latvia, Luxembourg, Mexico, and the Netherlands.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_59", "document_index": 98, "latency_s": 31.44907959998818, "prompt_toks": 15649, "completion_toks": 62}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    New Zealand: Psilocybin is a Class A substance.[citation needed]\n\nNorway: Possession, growth, sale and consumption of mushrooms is illegal. Spores, even though not containing psilocybin, are also illegal.[citation needed]\n\nSweden: Sveriges riksdag added psilocybin mushrooms to schedule I (\"substances, plant materials and fungi which normally do not have medical use\") as narcotics in Sweden as of Aug 1, 1999, published by Medical Products Agency.[54]\n\nSwitzerland: Mushrooms of the species Conocybe, Panaeolus, Psilocybe and Stropharia are controlled under Verzechnis D.[55]\n\nTurkey: The possession, growth, sale and consumption of mushrooms is illegal.[citation needed]\n\nUnited Kingdom: According to the 2005 Drugs Act, fresh and prepared psilocybin mushrooms are Class A.[56]\n\n\n                    Context: \n                    This chunk is part of the \"Legal status\" section, listing the legal classification of psilocybin mushrooms in various countries around the world. It provides country-specific legal information, including schedules, bans, and regulatory details, as part of a broader international survey on psilocybin mushrooms' legal status.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_60", "document_index": 98, "latency_s": 31.098400399961974, "prompt_toks": 15696, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    United Kingdom: According to the 2005 Drugs Act, fresh and prepared psilocybin mushrooms are Class A.[56]\n\nUnited States: Psilocybin and psilocin are Schedule I drugs under the Controlled Substances Act of 1970. This means it is illegal to manufacture, buy, possess, process, or distribute without a license from the Drug Enforcement Administration (DEA).[57]. Several US states and cities have decriminalised Psilocybin mushrooms.\n\nOregon: Oregon Measure 109 legalized the use of Psilocybin mushrooms to licensed service providers administering to individuals 21 years of age or older.\n\nColorado: Colorado proposition 122 legalizes psychedelic plants and fungi for adults age 21 and older.\n\nItaly: Psilocybin is a schedule I drug (Tabella 1). [58]\n\nSee also\n\nResponsible use\n\nEntheogen\n\nPsychedelic\n\nTryptamine\n\nDMT\n\nLSD\n\nMescaline\n\nExternal links\n\nPsilocybin mushrooms (Wikipedia)\n\nMagic truffle (Wikipedia)\n\nLegal status of psilocybin mushrooms (Wikipedia)\n\nPsilocybin (Wikipedia)\n\n\n                    Context: \n                    This chunk is from the \"Legal status\" section of the Psilocybin mushrooms document. It provides country-specific and regional legal information about psilocybin mushrooms, detailing their classification and regulation in the United Kingdom, United States (including state laws in Oregon and Colorado), and Italy, followed by a \"See also\" list and links to related external resources.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_61", "document_index": 98, "latency_s": 31.206226599984802, "prompt_toks": 15744, "completion_toks": 58}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Psychedelic\n\nTryptamine\n\nDMT\n\nLSD\n\nMescaline\n\nExternal links\n\nPsilocybin mushrooms (Wikipedia)\n\nMagic truffle (Wikipedia)\n\nLegal status of psilocybin mushrooms (Wikipedia)\n\nPsilocybin (Wikipedia)\n\nPsilocybin therapy (Wikipedia)\n\nPsilocybin mushrooms (Erowid Vault)\n\nWorld Wide Distribution of Magic Mushrooms\n\nEnteogenic Mushrooms - philosophy of cultivation\n\nDiscussion\n\nThe Big & Dandy Psilocybin Mushrooms Thread (Bluelight)\n\nPsilocybin mushrooms, broken down and described (Disregard Everything I Say)\n\nLiterature\n\nMcKenna, Terence; McKenna, Dennis (1976). Psilocybin: Magic Mushroom Grower's Guide. Under the pseudonyms OT Oss and ON Oeric. Berkeley, CA: And/Or Press. ISBN 978-0-915904-13-6.\n\nPsilocybe Mushrooms & Their Allies (1978), Homestead Book Company, Template:ISBN\n\nPassie, T., Seifert, J., Schneider, U., & Emrich, H. M. (2002). The pharmacology of psilocybin. Addiction Biology, 7(4), 357-364. doi: 10.1080/1355621021000005937\n\n\n                    Context: \n                    This chunk appears at the end of the document, providing \"See also\" links to related psychedelic substances, external resources for further reading, community discussion threads, and references to notable literature about psilocybin mushrooms, helping users explore additional information and deepen their understanding beyond the main article content.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_62", "document_index": 98, "latency_s": 31.34987919998821, "prompt_toks": 15763, "completion_toks": 61}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    Passie, T., Seifert, J., Schneider, U., & Emrich, H. M. (2002). The pharmacology of psilocybin. Addiction Biology, 7(4), 357-364. doi: 10.1080/1355621021000005937\n\nTylš, F., Páleníček, T., & Horáček, J. (2014). Psilocybin–summary of knowledge and new perspectives. European Neuropsychopharmacology, 24(3), 342-356. doi: 10.1016/j.euroneuro.2013.12.006\n\nVollenweider, F. X., & Kometer, M. (2010). The neurobiology of psychedelic drugs: implications for the treatment of mood disorders. Nature Reviews Neuroscience, 11(9), 642-651. doi: 10.1038/nrn2884\n\nAgurell, S., & Nilsson, J. G. L. (1968). Biosynthesis of Psilocybin Part II*, Incorporation of Labelled Tryptamine Derivatives. Acta Chemica Scandainavica, 22(4). 1210-1218. https://pdfs.semanticscholar.org/a7b9/965618d632ff7de3a96fed11c9455b615d94.pdf\n\nReferences\n\n\n                    Context: \n                    This chunk is part of the \"Literature\" section toward the end of the document, providing key academic references and foundational scientific studies related to the chemistry, pharmacology, neurobiology, and biosynthesis of psilocybin, supporting the informational content covered throughout the page on psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_63", "document_index": 98, "latency_s": 31.234353000007104, "prompt_toks": 15783, "completion_toks": 62}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    References\n\n↑ Pablo Mallaroni, Natasha L. Mason , Johannes T. Reckweg, Riccardo Paci, Sabrina Ritscher, Stefan W. Toennes, Eef L. Theunissen, Kim P.C. Kuypers, Johannes G. Ramaekers (May 2023). \"Assessment of the acute effects of 2C-B vs psilocybin on subjective experience, mood and cognition\". Clinical Pharmacology and Therapeutics. doi:10.1002/cpt.2958.\n\n↑ Guzmán, G., Allen, J. W., Gartz, J. (1998). \"A worldwide geographical distribution of the neurotropic fungi, an analysis and discussion\". Ann. Mus. Civ. Rovereto. 14: 189–280.\n\n↑ 3.0 3.1 3.2 3.3 3.4 3.5 Tylš, F., Páleníček, T., Horáček, J. (March 2014). \"Psilocybin – Summary of knowledge and new perspectives\". European Neuropsychopharmacology. 24 (3): 342–356. doi:10.1016/j.euroneuro.2013.12.006. ISSN 0924-977X.\n\n↑ Sessa, B. (2012). The psychedelic renaissance: reassassing the role of psychedelic drugs in 21st century psychiatry and society. Muswell Hill Press. ISBN 9781908995001.\n\n\n                    Context: \n                    This chunk is from the \"References\" section at the end of the Psilocybin mushrooms webpage, listing academic sources cited throughout the article. It provides full bibliographic details for studies and literature underpinning the preceding content on chemistry, effects, history, and legal status of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_64", "document_index": 98, "latency_s": 31.153595999989193, "prompt_toks": 15803, "completion_toks": 50}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Sessa, B. (2012). The psychedelic renaissance: reassassing the role of psychedelic drugs in 21st century psychiatry and society. Muswell Hill Press. ISBN 9781908995001.\n\n↑ Lüscher, C., Ungless, M. A. (14 November 2006). \"The Mechanistic Classification of Addictive Drugs\". PLoS Medicine. 3 (11): e437. doi:10.1371/journal.pmed.0030437. ISSN 1549-1676.\n\n↑ Strassman, R. J. (October 1984). \"ADVERSE REACTIONS TO PSYCHEDELIC DRUGS. A REVIEW OF THE LITERATURE:\". The Journal of Nervous and Mental Disease. 172 (10): 577–595. doi:10.1097/00005053-198410000-00001. ISSN 0022-3018.\n\n↑ Samorini, G. (1992). \"The oldest representations of hallucinogenic mushrooms in the world (Sahara Desert, 9000-7000 BP)\". Integration. 2 (3): 69–78.\n\n↑ Akers, B. P., Ruiz, J. F., Piper, A., Ruck, C. A. P. (June 2011). \"A Prehistoric Mural in Spain Depicting Neurotropic Psilocybe Mushrooms?\". Economic Botany. 65 (2): 121–128. doi:10.1007/s12231-011-9152-5. ISSN 0013-0001.\n\n\n                    Context: \n                    This chunk is part of the references section at the end of the Psilocybin mushrooms webpage, listing academic sources and literature cited throughout the article to support claims about history, effects, pharmacology, and cultural uses of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_65", "document_index": 98, "latency_s": 31.498246100032702, "prompt_toks": 15721, "completion_toks": 80}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Hofmann, A. (1980). \"The Mexican relatives of LSD\". LSD, my problem child. McGraw-Hill. ISBN 9780070293250.\n\n↑ Wasson, R. G. (1957). \"Seeking the Magic Mushroom\". Life. 42 (19): 100–120. ISSN 0024-3019.\n\n↑ Heim, R. (1957). \"Notes préliminaires sur les agarics hallucinogènes du Mexique (Preliminary notes on the hallucination-producing agarics of Mexico)\". Revue de Mycologie (in French). 22 (1): 58–79.\n\n↑ Hofmann, A., Heim, R., Brack, A., Kobel, H. (March 1958). \"Psilocybin, ein psychotroper Wirkstoff aus dem mexikanischen Rauschpilz Psilocybe mexicana Heim (Psilocybin, a psychotropic drug from the Mexican magic mushroom Psilocybe mexicana Heim)\". Experientia (in German). 14 (3): 107–109. doi:10.1007/BF02159243. ISSN 0014-4754.\n\n\n                    Context: \n                    These references are part of the historical section detailing the discovery and study of psilocybin mushrooms, specifically highlighting the pivotal mid-20th century research and publications by R. Gordon Wasson, Roger Heim, and Albert Hofmann, which documented the identification, chemical isolation, and synthesis of psilocybin from Mexican Psilocybe species, establishing the scientific foundation for modern psychedelic studies.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_66", "document_index": 98, "latency_s": 32.346670099999756, "prompt_toks": 15745, "completion_toks": 55}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Hofmann, A., Heim, R., Brack, A., Kobel, H., Frey, A., Ott, H., Petrzilka, Th., Troxler, F. (1959). \"Psilocybin und Psilocin, zwei psychotrope Wirkstoffe aus mexikanischen Rauschpilzen (Psilocybin and psilocin, two psychotropic substances in Mexican magic mushrooms)\". Helvetica Chimica Acta (in German). 42 (5): 1557–1572. doi:10.1002/hlca.19590420518. ISSN 0018-019X.\n\n↑ Marley, G. (9 September 2010). \"Psilocybin: gateway to the soul or just a good high?\". Chanterelle Dreams, Amanita Nightmares: The Love, Lore, and Mystique of Mushrooms. Chelsea Green Publishing. p. 166. ISBN 9781603582803.\n\n↑ Passie, T., Seifert, J., Schneider, U., Emrich, H. M. (October 2002). \"The pharmacology of psilocybin\". Addiction Biology. 7 (4): 357–364. doi:10.1080/1355621021000005937. ISSN 1355-6215.\n\n\n                    Context: \n                    This chunk is part of the References section at the end of the Psilocybin mushrooms article, listing key scientific publications and sources cited throughout the document. These particular references pertain to the discovery, chemistry, and pharmacology of psilocybin and psilocin.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_67", "document_index": 98, "latency_s": 29.646629800030496, "prompt_toks": 15783, "completion_toks": 44}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Passie, T., Seifert, J., Schneider, U., Emrich, H. M. (October 2002). \"The pharmacology of psilocybin\". Addiction Biology. 7 (4): 357–364. doi:10.1080/1355621021000005937. ISSN 1355-6215.\n\n↑ Leary, T., Litwin, G. H., Metzner, R. (December 1963). \"REACTIONS TO PSILOCYBJN ADMINISTERED IN A SUPPORTIVE ENVIRONMENT:\". The Journal of Nervous and Mental Disease. 137 (6): 561–573. doi:10.1097/00005053-196312000-00007. ISSN 0022-3018.\n\n↑ Timothy, L., Ralph, M., Madison, P., Gunther, W., Ralph, S., Sara, K. (1965). \"A new behavior change program using psilocybin\". Psychotherapy: Theory, Research & Practice. 2 (2): 61–72. doi:10.1037/h0088612. ISSN 0033-3204. .\n\n↑ Matsushima, Y., Eguchi, F., Kikukawa, T., Matsuda, T. (2009). \"Historical overview of psychoactive mushrooms\". Inflammation and Regeneration. 29 (1): 47–58. doi:10.2492/inflammregen.29.47. ISSN 1880-9693.\n\n\n                    Context: \n                    This chunk appears in the \"References\" section at the end of the document, listing academic sources that support preceding content on the pharmacology, clinical studies, and history of psilocybin mushrooms discussed throughout the article.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_68", "document_index": 98, "latency_s": 31.644881699990947, "prompt_toks": 15664, "completion_toks": 53}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Griffiths, R. R., Grob, C. S. (December 2010). \"Hallucinogens as Medicine\". Scientific American. 303 (6): 76–79. doi:10.1038/scientificamerican1210-76. ISSN 0036-8733.\n\n↑ Studerus, E., Kometer, M., Hasler, F., Vollenweider, F. X. (November 2011). \"Acute, subacute and long-term subjective effects of psilocybin in healthy humans: a pooled analysis of experimental studies\". Journal of Psychopharmacology. 25 (11): 1434–1452. doi:10.1177/0269881110382466. ISSN 0269-8811.\n\n↑ Keim, B. (1 July 2008). \"Psilocybin study hints at rebirth of hallucinogen research\". Wired. Retrieved 8 August 2011.\n\n\n                    Context: \n                    This chunk is part of the references section at the end of the Psilocybin mushrooms article, listing sources that provide scientific and journalistic support for information throughout the main text, including the medical use, subjective effects, and modern research resurgence of psilocybin.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_69", "document_index": 98, "latency_s": 31.051483499992173, "prompt_toks": 15779, "completion_toks": 51}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Keim, B. (1 July 2008). \"Psilocybin study hints at rebirth of hallucinogen research\". Wired. Retrieved 8 August 2011.\n\n↑ 22.0 22.1 Dos Santos, RG; Osório, FL; Crippa, JA; Riba, J; Zuardi, AW; Hallak, JE (June 2016). \"Antidepressive, anxiolytic, and antiaddictive effects of ayahuasca, psilocybin and lysergic acid diethylamide (LSD): a systematic review of clinical trials published in the last 25 years\". Therapeutic advances in psychopharmacology. 6 (3): 193–213. doi:10.1177/2045125316638008. PMC 4910400 . PMID 27354908. CS1 maint: PMC format (link)\n\n↑ Vargas, MV; Meyer, R; Avanes, AA; Rus, M; Olson, DE (2021). \"Psychedelics and Other Psychoplastogens for Treating Mental Illness\". Frontiers in psychiatry. 12: 727117. doi:10.3389/fpsyt.2021.727117. PMC 8520991 Check |pmc= value (help). PMID 34671279.\n\n↑ Gilbert, J., Senyuva, H. (2009). Bioactive Compounds in Foods. John Wiley & Sons. ISBN 9781444302295.\n\n\n                    Context: \n                    This chunk is part of the References section at the end of the Psilocybin mushrooms page, listing sources that support claims made throughout the article about the effects, research, chemistry, and therapeutic uses of psilocybin and related psychedelics.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_70", "document_index": 98, "latency_s": 31.563399599981494, "prompt_toks": 15778, "completion_toks": 66}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Gilbert, J., Senyuva, H. (2009). Bioactive Compounds in Foods. John Wiley & Sons. ISBN 9781444302295.\n\n↑ Horita, A., Weber, L. J. (1 January 1961). \"Dephosphorylation of Psilocybin to Psilocin by Alkaline Phosphatase\". Experimental Biology and Medicine. 106 (1): 32–34. doi:10.3181/00379727-106-26228. ISSN 1535-3702.\n\n↑ Anastos, N., Barnett, N. W., Pfeffer, F. M., Lewis, S. W. (April 2006). \"Investigation into the temporal stability of aqueous standard solutions of psilocin and psilocybin using high performance liquid chromatography\". Science & Justice. 46 (2): 91–96. doi:10.1016/S1355-0306(06)71579-9. ISSN 1355-0306.\n\n↑ Petri, G., Expert, P., Turkheimer, F., Carhart-Harris, R., Nutt, D., Hellyer, P. J., Vaccarino, F. (6 December 2014). \"Homological scaffolds of brain functional networks\". Journal of The Royal Society Interface. 11 (101): 20140873. doi:10.1098/rsif.2014.0873. ISSN 1742-5689.\n\n\n                    Context: \n                    This chunk is from the references section of the Psilocybin mushrooms webpage, listing key scientific publications related to the chemistry, pharmacology, and analysis of psilocybin and psilocin. These works are cited within sections discussing the chemical properties, conversion processes, stability, and neurological effects of psilocybin mushrooms.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_71", "document_index": 98, "latency_s": 31.20102360000601, "prompt_toks": 15750, "completion_toks": 48}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Jerome, L. (2007), Psilocybin Investigator’s Brochure (PDF), Multidisciplinary Association for Psychedelic Studies (MAPS).\n\n↑ Johnson, M. W., Garcia-Romeu, A., Cosimano, M. P., Griffiths, R. R. (November 2014). \"Pilot study of the 5-HT 2A R agonist psilocybin in the treatment of tobacco addiction\". Journal of Psychopharmacology. 28 (11): 983–992. doi:10.1177/0269881114548296. ISSN 0269-8811.\n\n↑ Armstrong, B. D., Paik, E., Chhith, S., Lelievre, V., Waschek, J. A., Howard, S. G. (September 2004). \"Potentiation of (DL)-3,4-methylenedioxymethamphetamine (MDMA)-induced toxicity by the serotonin 2A receptior partial agonist d-lysergic acid diethylamide (LSD), and the protection of same by the serotonin 2A/2C receptor antagonist MDL 11,939\". Neuroscience Research Communications. 35 (2): 83–95. doi:10.1002/nrc.20023. ISSN 0893-6609.\n\n\n                    Context: \n                    This chunk appears in the References section at the end of the document, listing academic sources and further reading that underpin the information presented throughout the page on psilocybin mushrooms, their pharmacology, effects, research, and related topics.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_72", "document_index": 98, "latency_s": 31.62597510003252, "prompt_toks": 15804, "completion_toks": 80}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Gudelsky, G. A., Yamamoto, B. K., Frank Nash, J. (November 1994). \"Potentiation of 3,4-methylenedioxymethamphetamine-induced dopamine release and serotonin neurotoxicity by 5-HT2 receptor agonists\". European Journal of Pharmacology. 264 (3): 325–330. doi:10.1016/0014-2999(94)90669-6. ISSN 0014-2999.\n\n↑ Capela, J. P., Fernandes, E., Remião, F., Bastos, M. L., Meisel, A., Carvalho, F. (July 2007). \"Ecstasy induces apoptosis via 5-HT(2A)-receptor stimulation in cortical neurons\". Neurotoxicology. 28 (4): 868–875. doi:10.1016/j.neuro.2007.04.005. ISSN 0161-813X.\n\n↑ https://www.sciencedirect.com/topics/immunology-and-microbiology/psilocybin\n\n↑ Gartz, J., Allen, J. W., Merlin, M. D. (July 1994). \"Ethnomycology, biochemistry, and cultivation of Psilocybe samuiensis Guzmán, Bandala and Allen, a new psychoactive fungus from Koh Samui, Thailand\". Journal of Ethnopharmacology. 43 (2): 73–80. doi:10.1016/0378-8741(94)90006-X. ISSN 0378-8741.\n\n\n                    Context: \n                    This chunk appears in the references section of the Psilocybin mushrooms webpage, providing citations for scientific studies related to the pharmacology, neurotoxicity, and ethnomycology of psilocybin and its effects. These references support statements made in sections discussing substance interactions, potential neurotoxic effects, and the chemistry and cultivation of specific Psilocybe species within the main article.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_73", "document_index": 98, "latency_s": 31.065507900028024, "prompt_toks": 15728, "completion_toks": 73}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Grob, C. S., Danforth, A. L., Chopra, G. S., Hagerty, M., McKay, C. R., Halberstadt, A. L., Greer, G. R. (3 January 2011). \"Pilot Study of Psilocybin Treatment for Anxiety in Patients With Advanced-Stage Cancer\". Archives of General Psychiatry. 68 (1): 71. doi:10.1001/archgenpsychiatry.2010.116. ISSN 0003-990X.\n\n↑ Carhart-Harris, R. L., Bolstridge, M., Rucker, J., Day, C. M. J., Erritzoe, D., Kaelen, M., Bloomfield, M., Rickard, J. A., Forbes, B., Feilding, A., Taylor, D., Pilling, S., Curran, V. H., Nutt, D. J. (July 2016). \"Psilocybin with psychological support for treatment-resistant depression: an open-label feasibility study\". The Lancet Psychiatry. 3 (7): 619–627. doi:10.1016/S2215-0366(16)30065-7. ISSN 2215-0366.\n\n\n                    Context: \n                    This chunk appears in the references section of the Psilocybin mushrooms article, specifically citing clinical studies on psilocybin’s therapeutic potential for anxiety and depression, as discussed earlier in the document's \"Research\" and \"Antidepressant effects\" sections. These references support content about modern medical research into psilocybin-assisted therapy for mental health conditions.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_74", "document_index": 98, "latency_s": 31.43421539996052, "prompt_toks": 15729, "completion_toks": 65}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ 37.0 37.1 Carhart-Harris, R. L., Erritzoe, D., Williams, T., Stone, J. M., Reed, L. J., Colasanti, A., Tyacke, R. J., Leech, R., Malizia, A. L., Murphy, K., Hobden, P., Evans, J., Feilding, A., Wise, R. G., Nutt, D. J. (7 February 2012). \"Neural correlates of the psychedelic state as determined by fMRI studies with psilocybin\". Proceedings of the National Academy of Sciences. 109 (6): 2138–2143. doi:10.1073/pnas.1119598109. ISSN 0027-8424.\n\n↑ Farb, N. A. S., Anderson, A. K., Bloch, R. T., Segal, Z. V. (August 2011). \"Mood-Linked Responses in Medial Prefrontal Cortex Predict Relapse in Patients with Recurrent Unipolar Depression\". Biological Psychiatry. 70 (4): 366–372. doi:10.1016/j.biopsych.2011.03.009. ISSN 0006-3223.\n\n\n                    Context: \n                    This chunk appears in the \"Research\" section discussing the antidepressant effects of psilocybin mushrooms. It cites studies exploring the neural mechanisms underlying psilocybin's impact on depression, specifically referencing brain imaging (fMRI) research on the medial prefrontal cortex and its relevance to mood regulation and treatment-resistant depression.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_75", "document_index": 98, "latency_s": 32.72189320001053, "prompt_toks": 15829, "completion_toks": 84}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Bhagwagar, Z., Hinz, R., Taylor, M., Fancy, S., Cowen, P., Grasby, P. (September 2006). \"Increased 5-HT 2A Receptor Binding in Euthymic, Medication-Free Patients Recovered From Depression: A Positron Emission Study With [ 11 C]MDL 100,907\". American Journal of Psychiatry. 163 (9): 1580–1587. doi:10.1176/ajp.2006.163.9.1580. ISSN 0002-953X.\n\n↑ Meyer, J. H., McMain, S., Kennedy, S. H., Korman, L., Brown, G. M., DaSilva, J. N., Wilson, A. A., Blak, T., Eynan-Harvey, R., Goulding, V. S., Houle, S., Links, P. (January 2003). \"Dysfunctional Attitudes and 5-HT2 Receptors During Depression and Self-Harm\". American Journal of Psychiatry. 160 (1): 90–99. doi:10.1176/appi.ajp.160.1.90. ISSN 0002-953X.\n\n↑ Nutt DJ, King LA, Phillips LD (November 2010). \"Drug harms in the UK: a multicriteria decision analysis\". Lancet. 376 (9752): 1558–1565. CiteSeerX 10.1.1.690.1283 . doi:10.1016/S0140-6736(10)61462-6. PMID 21036393. Unknown parameter |s2cid= ignored (help)\n\n\n                    Context: \n                    This chunk appears in the references section of the Psilocybin mushrooms page, supporting statements made earlier in the document regarding the role of serotonin 5-HT2A receptors in depression, dysfunctional attitudes, self-harm, and comparisons of drug-related harms. The references are specifically cited in discussions about psilocybin’s antidepressant potential, its mechanism of action involving serotonin receptors, and harm profiles relative to other substances.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_76", "document_index": 98, "latency_s": 30.404950899945106, "prompt_toks": 15850, "completion_toks": 60}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Nutt, D., King, L. A., Saulsbury, W., Blakemore, C. (24 March 2007). \"Development of a rational scale to assess the harm of drugs of potential misuse\". The Lancet. 369 (9566): 1047–1053. doi:10.1016/S0140-6736(07)60464-4. ISSN 0140-6736.\n\n↑ 43.0 43.1 43.2 Nichols, David E. (2004). \"Hallucinogens\". Pharmacology & Therapeutics. 101 (2): 131–181. doi:10.1016/j.pharmthera.2003.11.002. eISSN 1879-016X. ISSN 0163-7258. OCLC 04981366.\n\n↑ 44.0 44.1 Johnson, M. W., Griffiths, R. R., Hendricks, P. S., Henningfield, J. E. (November 2018). \"The abuse potential of medical psilocybin according to the 8 factors of the Controlled Substances Act\". Neuropharmacology. 142: 143–166. doi:10.1016/j.neuropharm.2018.05.012. ISSN 0028-3908.\n\n↑ Halpern, J. H.; Pope Jr, H. G. (2003). \"Hallucinogen persisting perception disorder: what do we know after 50 years?\" (PDF). Drug and Alcohol Dependence. 69 (2): 109–119. doi:10.1016/S0376-8716(02)00306-X. ISSN 0376-8716. PMID 12609692.\n\n↑ Lysergic acid diethylamide\n\n\n                    Context: \n                    This chunk is part of the references section at the end of the Psilocybin mushrooms article, listing scientific studies and resources that provide supporting evidence for information discussed throughout the document, including drug harm assessment, pharmacology, abuse potential, hallucinogen persisting perception disorder, and related psychedelic substances.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_77", "document_index": 98, "latency_s": 30.645856200018898, "prompt_toks": 15763, "completion_toks": 48}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Lysergic acid diethylamide\n\n↑ TripSit Factsheets - Mushrooms\n\n↑ Unternehmensberatung, A., § 27 SMG (Suchtmittelgesetz), Unerlaubter Umgang mit Suchtgiften - JUSLINE Österreich\n\n↑ All acording to articles (artigos) 2 and 33, Lei nº 11.343 of 23/8/2006, referring to numbers 160 and 161 of chart F2 (lista F2) of the Portaria SVS/MS nº 344 of 12/5/1998, last amended by Resolução de Diretoria Colegiada - RDC nº 835 of 13/12/2023, as of 29/2/2024.\n\n↑ Branch, L. S. (2022), Consolidated federal laws of Canada, Controlled Drugs and Substances Act\n\n↑ Anlage I BtMG - Einzelnorm\n\n↑ Zaudējis spēku - Noteikumi par Latvijā kontrolējamajām narkotiskajām vielām, psihotropajām vielām un prekursoriem\n\n↑ Legilux\n\n↑ \"Sidan kunde inte visas (#404) - Läkemedelsverket\". 25 September 2013. Archived from the original on 25 September 2013.\n\n\n                    Context: \n                    This chunk is part of the references section at the end of the Psilocybin mushrooms webpage. It provides citation details supporting the preceding content, particularly for the legal status information about psilocybin mushrooms in various countries and related substances.\n                "}
{"metadata": {"source": "psychonaut", "title": "Psilocybin mushrooms - PsychonautWiki", "description": "Please see this section for more information.", "language": "en-GB", "url": "https://m.psychonautwiki.org/wiki/Psilocybin", "drug": "Psilocybin", "cid": 10624, "char_count": 61205, "word_count": 8567, "doc_id": "doc_98", "chunk_id": "98::chunk_78", "document_index": 98, "latency_s": 30.985200900002383, "prompt_toks": 15669, "completion_toks": 38}, "content": "Drug: Psilocybin | cid: 10624\nSource: psychonaut | Source description: Please see this section for more information.\n\n                    Text: \n                    ↑ Legilux\n\n↑ \"Sidan kunde inte visas (#404) - Läkemedelsverket\". 25 September 2013. Archived from the original on 25 September 2013.\n\n↑ \"Verordnung des EDI über die Verzeichnisse der Betäubungsmittel, psychotropen Stoffe, Vorläuferstoffe und Hilfschemikalien\" (in German). Bundeskanzlei [Federal Chancellery of Switzerland]. Retrieved January 1, 2020.\n\n↑ Participation, E., Drugs Act 2005\n\n↑ FDA - Controlled Substances Act, 2017\n\n↑ LEGGE 16 maggio 2014, n. 79 https://www.gazzettaufficiale.it/eli/id/2014/05/20/14G00090/sg\n\nRetrieved from ‘https://psychonautwiki.org/w/index.php?title=Psilocybin_mushrooms&oldid=162645’\n\n\n                    Context: \n                    This chunk appears at the end of the References section, following citations related to the legal status of psilocybin mushrooms in various countries, and directly precedes the document’s source URL.\n                "}
