{
    "pubchem": "Compound pages present a prominent summary box with core chemical information, identifiers, molecular structure images, and key physical properties at the top. The page is organized into collapsible sections such as chemical and physical properties, safety, toxicity, uses, literature, and related compounds for in-depth reference.",
    "psychonaut": "Each drug page begins with a concise summary and infobox including chemical data, subjective effects, dosage, and warnings. The content is structured into sections covering effects, chemistry, pharmacology, subjective experiences, history, legal status, and harm reduction, frequently supported by citations and user reports.",
    "erowid_main_page": "The main chart page features a categorized and alphabetical table listing substances, their basic information, and links to individual profiles. It serves as a navigational overview, summarizing substance categories and providing quick access to detailed resource pages.",
    "erowid_basics": "Basics pages provide a descriptive overview of the substance, including its effects, usage context, history, and essential safety notes. These sections are written in accessible language and present key facts and introductory guidance for new readers.",
    "erowid_law": "Law sections summarize the legal status of the substance across different countries and regions, often including legislative history and notable legal cases. The information is structured by country or jurisdiction, and may include official scheduling references.",
    "erowid_dose": "Dose pages present detailed dosing guidelines, listing thresholds, common, and strong dose ranges for various forms and routes of administration. Additional notes address factors affecting dosage, onset time, duration, and safety considerations.",
    "erowid_faq": "FAQ pages comprise a list of frequently asked questions with concise, clear answers about the substance’s effects, use, risks, and related practical topics. The format is straightforward, typically organized as a question and answer list for quick reference.",
    "erowid_effects": "Effects pages contain organized tables or lists detailing the physical, cognitive, and emotional effects commonly reported for the substance. Sections may include onset, duration, aftereffects, and both positive and negative effects as described by users.",
    "erowid_chemistry": "Chemistry sections detail the substance’s molecular structure, synthesis routes, physical-chemical properties, and related analogues. Diagrams and chemical data are presented alongside explanatory notes for academic or technical readers.",
    "erowid_testing": "Testing pages describe available methods for detecting, analyzing, or verifying the substance with reagent kits, laboratory protocols, and field tests. Content includes guidance on test accuracy, interpretation of results, and potential limitations.",
    "erowid_health": "Health information focuses on acute and chronic physical and psychological risks, presenting data on toxicity, harm reduction, contraindications, and medical interactions. The sections may include summaries of known medical issues, safety tips, and links to further reading.",
    "erowid_history": "History or timeline pages provide a chronological narrative or table outlining key events in the discovery, synthesis, medical use, cultural context, and legal changes related to the substance. These timelines are supplemented with notable dates, quotations, and milestone summaries.",
    "erowid_journals": "Journals pages curate first-person experience reports organized by individual users, session type, or outcome. Each entry presents a narrative account, including context, dose, subjective effects, and conclusions.",
    "erowid_writings": "Writings pages compile essays, articles, and in-depth commentaries relevant to the substance, often authored by experts or notable figures. Content covers historical, philosophical, legal, scientific, or cultural perspectives beyond personal experience.",
    "erowid_media": "Media sections aggregate images, audio, and video content related to the substance, including photographs, chemical diagrams, user submissions, and event recordings. Media galleries are typically organized by type, with descriptive captions and source attribution."
}