{
    "pubchem": "PubChem compound pages share a structured layout centered around chemical information, including sections like molecular structure, properties, biological activities, safety, and references. Content is organized systematically to provide detailed chemical and pharmacological data, often with tabs or sections for easy navigation. Visuals such as chemical structures and links to related compounds are prominent features. The focus is on comprehensive chemical data and scientific resources for researchers and professionals.",
    "psychonaut": "PsychonautWiki drug pages typically feature a simplified, user-friendly design with sections covering drug effects, risks, administration methods, and harm reduction tips. Content is organized into clear headings that guide users through effects, dosage, and safety information. Visual icons and tables are used to enhance readability and quick reference. The site emphasizes harm reduction, personal experiences, and factual data to inform users about various substances.",
    "erowid_main_page": "Erowid's main page serves as a comprehensive portal with links to various sections including drug information, experience vaults, and media. It features a simple, navigational layout with categorized menus, emphasizing ease of access to detailed substance profiles and general resources. Visual icons and an index-based structure facilitate quick navigation across diverse topics. The site functions as an extensive repository of user-submitted experiences and factual data on psychoactive substances.",
    "erowid_basics": "The Erowid basics page provides foundational information about a substance, including general description, effects, and usage tips, structured with clearly labeled sections for quick reference. Content is concise and aims to educate newcomers and experienced users alike. It often includes procedural guidelines and safety considerations. The layout relies on headings and short paragraphs to facilitate easy understanding of key points.",
    "erowid_law": "Erowid's law page discusses legal issues associated with substances, presenting laws organized regionally and by substance type. The layout typically uses tables or bullet points to distinguish legal statuses, penalties, and jurisdictional nuances. Clear headings guide users through complex legal information, emphasizing factual and non-advocacy content. The focus is on providing legal context rather than advice.",
    "erowid_dose": "The dose page on Erowid lists typical dosage ranges, with tables or bullet points categorizing doses for different methods of administration. It includes side notes on variability and safety margins, with clear sections for different effects and experience levels. Content is aimed at informing responsible use, with visual cues aiding quick comprehension. The structure emphasizes practicality and safety in dosing information.",
    "erowid_faq": "Erowid's FAQ page organizes common questions about substances, safety, and usage into categories for easy lookup. Questions are presented as headings with brief, informative answers underneath, often supplemented with links or references for further reading. The layout prioritizes clarity and quick access to key concerns, fostering user understanding and harm reduction.",
    "erowid_effects": "The effects page details subjective experiences and physical changes caused by substances, often with user-submitted reports and scientific summaries. Sections are divided into categories such as mental, physical, and emotional effects, sometimes with visual indicators like icons. The layout facilitates comparison across different substances and highlights potential risks, focusing on informational accuracy.",
    "erowid_chemistry": "The chemistry page explains the chemical structures, synthesis, and pharmacology of substances, presenting diagrams, structural formulas, and descriptive text. Sections follow a logical progression from chemical composition to synthesis methods, often with scientific references. The focus is on providing technical details for researchers or informed users, with organized subsections for clarity.",
    "erowid_testing": "The testing page describes methods and kits used for substance analysis, listing types of tests, procedures, and interpretation guides. Content is arranged in step-by-step segments with visuals demonstrating testing techniques. The layout emphasizes safety, accuracy, and practical application to minimize harm from unknown substances.",
    "erowid_health": "The health page offers information on potential health risks, interactions, and medical considerations associated with substances, organized into categories such as physical health, mental health, and emergency procedures. It employs headings, bullet points, and references to medical sources to support harm reduction. The content aims to inform users about safe practices and warning signs to watch for.",
    "erowid_history": "The history or timeline page presents chronological information about a substance's discovery, cultural use, and legal changes, often with timelines or bullet-point summaries. Visuals like timelines or images are used to contextualize the information historically. The layout focuses on educational storytelling, emphasizing key cultural and scientific milestones.",
    "erowid_journals": "The journals section features individual user-submitted experiences, organized chronologically or by substance, with personal narratives and reports. Entries are often anonymous and include detailed descriptions, effects, and context. The layout allows for easy browsing and search, serving as a crowdsourced experiential archive.",
    "erowid_writings": "The writings page includes articles, essays, and research summaries related to substances, organized by topics or authors. Content is presented in a text-heavy format with headings, references, and links for further exploration. It aims to provide educational, scientific, or literary insights, fostering informed discussion and literacy.",
    "erowid_media": "The media page hosts audio, video, and visual content related to substances or drug experiences, categorized for easy access. It includes multimedia submissions such as interviews, documentaries, and artistic works, often with descriptions and source information. The layout facilitates browsing media content to enhance understanding and engagement."
}